[
{
  "title": "Regex patterns following a possessive quantifier should not always fail",
  "description": "Possessive quantifiers in Regex patterns like below improve performance by eliminating needless backtracking: ?+ , *+ , ++ , {n}+ , {n,}+ , {n,m}+ But because possessive quantifiers do not keep backtracking positions and never give back, the following sub-patterns should not match only similar characters. Otherwise, possessive quantifiers consume all characters that could have matched the following sub-patterns and nothing remains for the following sub-patterns. Noncompliant code example \"/a++abc/\" // Noncompliant, the second 'a' never matches \"/\\d*+[02468]/\" // Noncompliant, the sub-pattern \"[02468]\" never matches Compliant solution \"/aa++bc/\" // Compliant, for example it can match \"aaaabc\" \"/\\d*+(?&lt;=[02468])/\" // Compliant, for example it can match an even number like \"1234\"",
  "url": "https://rules.sonarsource.com/php/rspec-5994/"
},
{
  "title": "Regex boundaries should not be used in a way that can never be matched",
  "description": "In regular expressions the boundaries ^ and \\A can only match at the beginning of the input (or, in case of ^ in combination with the MULTILINE flag, the beginning of the line) and $, \\Z and \\z only at the end. These patterns can be misused, by accidentally switching ^ and $ for example, to create a pattern that can never match. Noncompliant code example // This can never match because $ and ^ have been switched around preg_match(\"/$[a-z]+^/\", $str); // Noncompliant Compliant solution preg_match(\"/^[a-z]+$/\", $str);",
  "url": "https://rules.sonarsource.com/php/rspec-5996/"
},
{
  "title": "Back references in regular expressions should only refer to capturing groups that are matched before the reference",
  "description": "When a back reference in a regex refers to a capturing group that hasn’t been defined yet (or at all), it can never be matched. Named back references throw a warning in that case; numeric back references fail silently when they can’t match, simply making the match fail. When the group is defined before the back reference but on a different control path (like in (.)|\\1 for example), this also leads to a situation where the back reference can never match. Noncompliant code example preg_match(\"/\\\\1(.)/\", $str); // Noncompliant, group 1 is defined after the back reference preg_match(\"/(.)\\\\2/\", $str); // Noncompliant, group 2 isn't defined at all preg_match(\"/(.)|\\\\1/\", $str); // Noncompliant, group 1 and the back reference are in different branches preg_match(\"/(?&lt;x&gt;.)|\\k&lt;x&gt;/\", $str); // Noncompliant, group x and the back reference are in different branches Compliant solution preg_match(\"/(.)\\\\1/\", $str); preg_match(\"/(?&lt;x&gt;.)\\\\k&lt;x&gt;/\", $str);",
  "url": "https://rules.sonarsource.com/php/rspec-6001/"
},
{
  "title": "Regex lookahead assertions should not be contradictory",
  "description": "This rule raises an issue when a regex lookahead contradicts the rest of the regex.",
  "url": "https://rules.sonarsource.com/php/rspec-6002/"
},
{
  "title": "Reluctant quantifiers in regular expressions should be followed by an expression that can't match the empty string",
  "description": "When a reluctant (or lazy) quantifier is followed by a pattern that can match the empty string or directly by the end of the regex, it will always match zero times for *? or one time for +?. If a reluctant quantifier is followed directly by the end anchor ($), it behaves indistinguishably from a greedy quantifier while being less efficient. This is likely a sign that the regex does not work as intended. Noncompliant code example preg_replace(\"/start\\w*?(end)?/\", \"x\", \"start123endstart456\"); // Noncompliant. In contrast to what one would expect, the result is not \"xx\". preg_match(\"/^\\d*?$/\", \"123456789\"); // Noncompliant. Matches the same as \"/^\\d*$/\", but will backtrack in every position. Compliant solution preg_replace(\"/start\\w*?(end|$)/\", \"x\", \"start123endstart456\"); // Result is \"xx\". preg_match(\"/^\\d*$/\", \"123456789\");",
  "url": "https://rules.sonarsource.com/php/rspec-6019/"
},
{
  "title": "Single-character alternations in regular expressions should be replaced with character classes",
  "description": "When an alternation contains multiple alternatives that consist of a single character, it can be rewritten as a character class. This should be preferred because it is more efficient. Noncompliant code example preg_match(\"/a|b|c/\", $str); // Noncompliant Compliant solution preg_match(\"/[abc]/\", $str); // or preg_match(\"/[a-c]/\", $str);",
  "url": "https://rules.sonarsource.com/php/rspec-6035/"
},
{
  "title": "Reflection should not be vulnerable to injection attacks",
  "description": "Reflection injections occur in a web application when it retrieves data from a user or a third-party service and fully or partially uses it to inspect, load or invoke a component by name. If an application uses a reflection method in a way that is vulnerable to injections, it is exposed to attacks that aim to achieve remote code execution on the server’s website. A user with malicious intent exploits this by carefully crafting a string involving symbols such as class methods, that will help them change the initial reflection logic to an impactful malicious one. After creating the malicious request and triggering it, the attacker can attack the servers affected by this vulnerability without relying on any pre-requisites. What is the potential impact? If user-supplied values are used to choose which code is executed, an attacker may be able to supply carefully-chosen values that cause unexpected code to run. The attacker can use this ability to run arbitrary code on the server. Below are some real-world scenarios that illustrate some impacts of an attacker exploiting the vulnerability. Application-specific attacks In this scenario, the attackers succeed in injecting a seemingly-legitimate object, but whose properties might be used maliciously. Depending on the application, attackers might be able to modify important data structures or content to escalate privileges or perform unwanted actions. For example, with an e-commerce application, this could be changing the number of products or prices. Full application compromise In the worst-case scenario, the attackers succeed in injecting an object triggering code execution. Depending on the attacker, code execution can be used with different intentions: Download the internal server’s data, most likely to sell it. Modify data, install malware, for instance, malware that mines cryptocurrencies. Stop services or exhaust resources, for instance, with fork bombs. This threat is particularly insidious if the attacked organization does not maintain a Disaster Recovery Plan (DRP). Root privilege escalation and pivot In this scenario, the attacker can do everything described in the previous section. The difference is that the attacker additionally manages to elevate their privileges as an administrator and attack other servers. Here, the impact depends on how much the target company focuses on its Defense In Depth. For example, the entire infrastructure can be compromised through a combination of unsafe deserialization and misconfiguration: Docker or Kubernetes clusters cloud services network firewalls and routing OS access control",
  "url": "https://rules.sonarsource.com/php/rspec-6173/"
},
{
  "title": "Applications should not create session cookies from untrusted input",
  "description": "Session Cookie Injection occurs when a web application assigns session cookies to users using untrusted data. Session cookies are used by web applications to identify users. Thus, controlling these enable control over the identity of the users within the application. The injection might occur via a GET parameter, and the payload, for example, https://example.com?cookie=injectedcookie, delivered using phishing techniques. What is the potential impact? A well-intentioned user opens a malicious link that injects a session cookie in their web browser. This forces the user into unknowingly browsing a session that isn’t theirs. Below are some real-world scenarios that illustrate some impacts of an attacker exploiting the vulnerability. Sensitive data disclosure A victim introduces sensitive data within the attacker’s application session that can later be retrieved by them. This can lead to a variety of implications depending on what type of data is disclosed. Strictly confidential user data or organizational data leakage have different impacts. Vulnerability chaining An attacker not only manipulates a user into browsing an application using a session cookie of their control but also successfully detects and exploits a self-XSS on the target application. The victim browses the vulnerable page using the attacker’s session and is affected by the XSS, which can then be used for a wide range of attacks including credential stealing using mirrored login pages.",
  "url": "https://rules.sonarsource.com/php/rspec-6287/"
},
{
  "title": "Alternation in regular expressions should not contain empty alternatives",
  "description": "Alternation is used to match a single regular expression out of several possible regular expressions. If one of the alternatives is empty it would match any input, which is most probably a mistake. Noncompliant code example preg_match(\"/Jack|Peter|/\", \"John\"); // Noncompliant - returns 1 preg_match(\"/Jack||Peter/\", \"John\"); // Noncompliant - returns 1 Compliant solution preg_match(\"/Jack|Peter/\", \"John\"); // returns 0 Exceptions One could use an empty alternation to make a regular expression group optional. Note that the empty alternation should be the first or the last within the group, or else the rule will still report. preg_match(\"/mandatory(|-optional)/\", \"mandatory\"); // returns 1 preg_match(\"/mandatory(-optional|)/\", \"mandatory-optional\"); // returns 1 However, if there is a quantifier after the group the issue will be reported as using both | and quantifier is redundant. preg_match(\"/mandatory(-optional|)?/\", \"mandatory-optional\"); // Noncompliant - using both `|` inside the group and `?` for the group.",
  "url": "https://rules.sonarsource.com/php/rspec-6323/"
},
{
  "title": "Regular expressions should not contain multiple spaces",
  "description": "Multiple spaces in a regular expression can make it hard to tell how many spaces should be matched. It’s more readable to use only one space and then indicate with a quantifier how many spaces are expected. Noncompliant code example \"/Hello, world!/\" Compliant solution \"/Hello, {3}world!/\" Exceptions If the extended modifier is set, whitespaces are ignored. In this case no issue should be triggered, because the whitespaces may be intended to improve readability.",
  "url": "https://rules.sonarsource.com/php/rspec-6326/"
},
{
  "title": "Replacement strings should reference existing regular expression groups",
  "description": "The PHP function preg_replace can be used to perform a search and replace based on regular expression matches. The $replacement parameter can contain references to capturing groups used in the $pattern parameter. This can be achieved with \\n or $n to reference the n’th group. When referencing a nonexistent group, it will be substituted with an empty string. This is in general not the intended behavior, and might stay unnoticed since no warning is raised. Noncompliant code example preg_replace(\"/(a)(b)(c)/\", \"\\\\1, \\\\9, \\\\3\", \"abc\"); // Noncompliant - result is \"a, , c\" Compliant solution preg_replace(\"/(a)(b)(c)/\", \"\\\\1, \\\\2, \\\\3\", \"abc\");",
  "url": "https://rules.sonarsource.com/php/rspec-6328/"
},
{
  "title": "Regular expressions should not contain empty groups",
  "description": "There are several reasons to use a group in a regular expression: to change the precedence (e.g. do(g|or) will match 'dog' and 'door') to remember parenthesised part of the match in the case of capturing group to improve readability In any case, having an empty group is most probably a mistake. Either it is a leftover after refactoring and should be removed, or the actual parentheses were intended and were not escaped. Noncompliant code example \"/foo()/\" // Noncompliant, will match only 'foo' Compliant solution \"/foo\\(\\)/\" // Matches 'foo()'",
  "url": "https://rules.sonarsource.com/php/rspec-6331/"
},
{
  "title": "Secret keys and salt values should be robust",
  "description": "Secret keys are used in combination with an algorithm to encrypt data. A typical use case is an authentication system. For such a system to be secure, the secret key should have a value which cannot be guessed and which is long enough to not be vulnerable to brute-force attacks. A \"salt\" is an extra piece of data which is included when hashing data such as a password. Its value should have the same properties as a secret key. This rule raises an issue when it detects that a secret key or a salt has a predictable value or that it’s not long enough. Noncompliant code example WordPress: define('AUTH_KEY', 'hello'); // Noncompliant define('AUTH_SALT', 'hello'); // Noncompliant define('AUTH_KEY', 'put your unique phrase here'); // Noncompliant, this is the default value Compliant solution WordPress: define('AUTH_KEY', 'D&amp;ovlU#|CvJ##uNq}bel+^MFtT&amp;.b9{UvR]g%ixsXhGlRJ7q!h}XWdEC[BOKXssj'); define('AUTH_SALT', 'FIsAsXJKL5ZlQo)iD-pt??eUbdc{_Cn&lt;4!d~yqz))&amp;B D?AwK%)+)F2aNwI|siOe');",
  "url": "https://rules.sonarsource.com/php/rspec-6339/"
},
{
  "title": "WordPress theme and plugin editors are security-sensitive",
  "description": "WordPress makes it possible to edit theme and plugin files directly in the Administration Screens. While it may look like an easy way to customize a theme or do a quick change, it’s a dangerous feature. When visiting the theme or plugin editor for the first time, WordPress displays a warning to make it clear that using such a feature may break the web site by mistake. More importantly, users who have access to this feature can trigger the execution of any PHP code and may therefore take full control of the WordPress instance. This security risk could be exploited by an attacker who manages to get access to one of the authorized users. Setting the DISALLOW_FILE_EDIT option to true in wp-config.php disables this risky feature. The default value is false. Ask Yourself Whether You really need to use the theme and plugin editors. The theme and plugin editors are available to users who cannot be fully trusted. There’s a chance that the accounts of authorized users get compromised. There is a risk if you answered yes to any of those questions. Recommended Secure Coding Practices Modify the theme and plugin files using a local editor and deploy them to the server in a secure way. Make sure that DISALLOW_FILE_EDIT is defined in wp-config.php. Make sure that DISALLOW_FILE_EDIT is set to true. Sensitive Code Example define( 'DISALLOW_FILE_EDIT', false ); // Sensitive Compliant Solution define( 'DISALLOW_FILE_EDIT', true ); See OWASP - Top 10 2021 Category A3 - Injection OWASP - Top 10 2021 Category A4 - Insecure Design OWASP - Top 10 2021 Category A5 - Security Misconfiguration wordpress.org - Disable the Plugin and Theme Editor OWASP - Top 10 2017 Category A1 - Injection OWASP - Top 10 2017 Category A6 - Security Misconfiguration OWASP - Top 10 2017 Category A7 - Cross-Site Scripting (XSS) CWE - CWE-79 - Improper Neutralization of Input During Web Page Generation ('Cross-site Scripting') CWE - CWE-94 - Improper Control of Generation of Code ('Code Injection') CWE - CWE-95 - Improper Neutralization of Directives in Dynamically Evaluated Code ('Eval Injection')",
  "url": "https://rules.sonarsource.com/php/rspec-6341/"
},
{
  "title": "Disabling automatic updates is security-sensitive",
  "description": "Automatic updates are a great way of making sure your application gets security updates as soon as they are available. Once a vendor releases a security update, it is crucial to apply it in a timely manner before malicious actors exploit the vulnerability. Relying on manual updates is usually too late, especially if the application is publicly accessible on the internet. Ask Yourself Whether there is no specific reason for deactivating all automatic updates. you meant to deactivate only automatic major updates. There is a risk if you answered yes to any of those questions. Recommended Secure Coding Practices Don’t deactivate automatic updates unless you have a good reason to do so. This way, you’ll be sure to receive security updates as soon as they are available. If you are worried about an automatic update breaking something, check if it is possible to only activate automatic updates for minor or security updates. Sensitive Code Example define( 'WP_AUTO_UPDATE_CORE', false ); // Sensitive define( 'AUTOMATIC_UPDATER_DISABLED', true ); // Sensitive Compliant Solution define( 'WP_AUTO_UPDATE_CORE', true ); // Minor and major automatic updates enabled define( 'WP_AUTO_UPDATE_CORE', 'minor' ); // Only minor updates are enabled define( 'AUTOMATIC_UPDATER_DISABLED', false ); See OWASP - Top 10 2021 Category A5 - Security Misconfiguration Wordpress.org - Disable WordPress Auto Updates OWASP - Top 10 2017 Category A6 - Security Misconfiguration",
  "url": "https://rules.sonarsource.com/php/rspec-6343/"
},
{
  "title": "Constants should not be redefined",
  "description": "In PHP, the define function allows you to define a named constant with a specific value, which cannot be changed later in the code. Once a constant has been defined, it can be used throughout the entire script, including in function and class definitions. Assigning a value to the same constant name using two or more define statements does not cause PHP to fail. In such a case, PHP only issues a warning and ignores the second and further define. What is the potential impact? Using duplicate define statements can lead to unnecessary code that can be safely removed in the best case scenario. It is important to note that in the worst case, duplicate define statements may assign different values, which can result in hard-to-debug issues when other parts of the code make incorrect assumptions about the constant’s value. It is advisable to avoid duplicate define statements to prevent potential unexpected behavior and to ensure code clarity and correctness.",
  "url": "https://rules.sonarsource.com/php/rspec-6344/"
},
{
  "title": "Function names should comply with a naming convention",
  "description": "Shared naming conventions allow teams to collaborate efficiently. This rule raises an issue when a function name does not match a provided regular expression. For example, with the default provided regular expression ^[a-z][a-zA-Z0-9]*$, the function: function DoSomething(){ // Noncompliant // ... } should be renamed to function doSomething(){ // ... } In case the Drupal framework is detected and the default regex is not replaced, it will follow the PHP coding standards for Drupal. function doSomething(){ // Noncompliant // ... } should be renamed to function do_something(){ // ... } Exceptions Methods with an @inheritdoc annotation, as well as magic methods (__construct(), __destruct(), __call(), __callStatic(), __get(), __set(), __isset(), __unset(), __sleep(), __wakeup(), __toString(), __invoke(), __set_state(), __clone(), __debugInfo()) are ignored. function __construct(){...} // Compliant by exception function __destruct(){...} // Compliant by exception /** * {@inheritdoc} */ function myFunc(){...} // Compliant by exception",
  "url": "https://rules.sonarsource.com/php/rspec-100/"
},
{
  "title": "Class names should comply with a naming convention",
  "description": "Shared naming conventions allow teams to collaborate efficiently. This rule raises an issue when a class name does not match a provided regular expression. For example, with the default provided regular expression ^[A-Z][a-zA-Z0-9]*$, the class: class my_class {...} // Noncompliant should be renamed to class MyClass {...}",
  "url": "https://rules.sonarsource.com/php/rspec-101/"
},
{
  "title": "Lines should not be too long",
  "description": "Scrolling horizontally to see a full line of code lowers the code readability.",
  "url": "https://rules.sonarsource.com/php/rspec-103/"
},
{
  "title": "Files should not have too many lines of code",
  "description": "When a source file grows too much, it can accumulate numerous responsibilities and become challenging to understand and maintain. Above a specific threshold, refactor the file into smaller files whose code focuses on well-defined tasks. Those smaller files will be easier to understand and test.",
  "url": "https://rules.sonarsource.com/php/rspec-104/"
},
{
  "title": "All \"catch\" blocks should be able to catch exceptions",
  "description": "Exceptions handlers (catch) are evaluated in the order they are written. Once a match is found, the evaluation stops. In some contexts a catch block is dead code as it will never catch any exception: If there is a handler for a base class followed by a handler for class derived from that base class, the second handler will never trigger: the handler for the base class will match the derived class, and will be the only executed handler. When multiple catch blocks try to catch the same exception class, only the first one will be executed. This rule raises an issue when a catch block catches every exception before a later catch block could catch it. Noncompliant code example class MyException extends Exception {} class MySubException extends MyException {} try { doSomething(); } catch (MyException $e) { echo $e; } catch (MySubException $e) { // Noncompliant: MySubException is a subclass of MyException echo \"Never executed\"; } Compliant solution class MyException extends Exception {} class MySubException extends MyException {} try { doSomething(); } catch (MySubException $e) { echo \"Executed\"; } catch (MyException $e) { echo $e; }",
  "url": "https://rules.sonarsource.com/php/rspec-1045/"
},
{
  "title": "Tabulation characters should not be used",
  "description": "The tab width can differ from one development environment to another. Using tabs may require other developers to configure their environment (text editor, preferences, etc.) to read source code. That is why using spaces is preferable.",
  "url": "https://rules.sonarsource.com/php/rspec-105/"
},
{
  "title": "Mergeable \"if\" statements should be combined",
  "description": "Nested code - blocks of code inside blocks of code - is eventually necessary, but increases complexity. This is why keeping the code as flat as possible, by avoiding unnecessary nesting, is considered a good practice. Merging if statements when possible will decrease the nesting of the code and improve its readability. Code like if (condition1) { if (condition2) { // Noncompliant ... } } Will be more readable as if (condition1 &amp;&amp; condition2) { // Compliant ... }",
  "url": "https://rules.sonarsource.com/php/rspec-1066/"
},
{
  "title": "Expressions should not be too complex",
  "description": "The complexity of an expression is defined by the number of &amp;&amp;, || and condition ? ifTrue : ifFalse operators it contains. A single expression’s complexity should not become too high to keep the code readable. Noncompliant code example With the default threshold value of 3 if ((($condition1 &amp;&amp; $condition2) || ($condition3 &amp;&amp; $condition4)) &amp;&amp; $condition5) { ... } Compliant solution if ( (my_first_condition() || my_second_condition()) &amp;&amp; my_last_condition()) { ... }",
  "url": "https://rules.sonarsource.com/php/rspec-1067/"
},
{
  "title": "Unused \"private\" fields should be removed",
  "description": "If a private field is declared but not used locally, its limited visibility makes it dead code. This is either a sign that some logic is missing or that the code should be cleaned. Cleaning out dead code decreases the size of the maintained codebase, making it easier to understand and preventing bugs from being introduced. class MyClass { private $foo = 4; // Noncompliant: foo is unused and should be removed public function compute($a) { return $a * 4; } }",
  "url": "https://rules.sonarsource.com/php/rspec-1068/"
},
{
  "title": "Functions should not have too many parameters",
  "description": "Functions with a long parameter list are difficult to use because maintainers must figure out the role of each parameter and keep track of their position. function setCoordinates($x1, $y1, $z1, $x2, $y2, $z2) { // Noncompliant // ... } The solution can be to: Split the function into smaller ones // Each function does a part of what the original setCoordinates function was doing, so confusion risks are lower function setOrigin(int $x, int $y, int $z) { // ... } function setSize(int $width, int $height, float $depth) { // ... } Find a better data structure for the parameters that group data in a way that makes sense for the specific application domain class Point { // In geometry, Point is a logical structure to group data public function __construct( public int $x, public int $y, public int $z ) {} } function setCoordinates(Point $p1, Point $p2) { // ... } This rule raises an issue when a function has more parameters than the provided threshold.",
  "url": "https://rules.sonarsource.com/php/rspec-107/"
},
{
  "title": "URIs should not be hardcoded",
  "description": "Hard-coding a URI makes it difficult to test a program for a variety of reasons: path literals are not always portable across operating systems a given absolute path may not exist in a specific test environment a specified Internet URL may not be available when executing the tests production environment filesystems usually differ from the development environment In addition, hard-coded URIs can contain sensitive information, like IP addresses, and they should not be stored in the code. For all those reasons, a URI should never be hard coded. Instead, it should be replaced by a customizable parameter. Further, even if the elements of a URI are obtained dynamically, portability can still be limited if the path delimiters are hard-coded. This rule raises an issue when URIs or path delimiters are hard-coded.",
  "url": "https://rules.sonarsource.com/php/rspec-1075/"
},
{
  "title": "Nested blocks of code should not be left empty",
  "description": "An empty code block is confusing. It will require some effort from maintainers to determine if it is intentional or indicates the implementation is incomplete. for ($i = 0; $i &lt; 42; $i++){} // Noncompliant: is the block empty on purpose, or is code missing? Removing or filling the empty code blocks takes away ambiguity and generally results in a more straightforward and less surprising code. Exceptions The rule ignores code blocks that contain comments.",
  "url": "https://rules.sonarsource.com/php/rspec-108/"
},
{
  "title": "Inheritance tree of classes should not be too deep",
  "description": "Inheritance is one of the most valuable concepts in object-oriented programming. It’s a way to categorize and reuse code by creating collections of attributes and behaviors called classes, which can be based on previously created classes. But abusing this concept by creating a deep inheritance tree can lead to complex and unmaintainable source code. Often, an inheritance tree becoming too deep is the symptom of systematic use of \"inheritance\" when other approaches like \"composition\" would be better suited. This rule raises an issue when the inheritance tree has a greater depth than is allowed.",
  "url": "https://rules.sonarsource.com/php/rspec-110/"
},
{
  "title": "An open curly brace should be located at the end of a line",
  "description": "Shared naming conventions allow teams to collaborate effectively. This rule raises an issue when an open curly brace is not placed at the end of a line of code. Noncompliant code example if(condition) { doSomething(); } Compliant solution if(condition) { doSomething(); } Exceptions When blocks are inlined (left and right curly braces on the same line), no issue is triggered. if(condition) {doSomething();}",
  "url": "https://rules.sonarsource.com/php/rspec-1105/"
},
{
  "title": "An open curly brace should be located at the beginning of a line",
  "description": "Shared coding conventions make it possible to collaborate efficiently. This rule makes it mandatory to place the open curly brace at the beginning of a line. Noncompliant code example function myMethod() { // Noncompliant if(something) { // Noncompliant executeTask(); } else { //Noncompliant doSomethingElse(); } } Compliant solution function myMethod() { if(something) { executeTask(); } else { doSomethingElse(); } }",
  "url": "https://rules.sonarsource.com/php/rspec-1106/"
},
{
  "title": "A close curly brace should be located at the beginning of a line",
  "description": "Shared coding conventions make it possible for a team to efficiently collaborate. This rule makes it mandatory to place a close curly brace at the beginning of a line. Noncompliant code example if(condition) { doSomething();} Compliant solution if(condition) { doSomething(); } Exceptions When blocks are inlined (open and close curly braces on the same line), no issue is triggered. if(condition) {doSomething();}",
  "url": "https://rules.sonarsource.com/php/rspec-1109/"
},
{
  "title": "Redundant pairs of parentheses should be removed",
  "description": "Parentheses can disambiguate the order of operations in complex expressions and make the code easier to understand. a = (b * c) + (d * e); // Compliant: the intent is clear. Redundant parentheses are parenthesis that do not change the behavior of the code, and do not clarify the intent. They can mislead and complexify the code. They should be removed. Noncompliant code example $x = (($y / 2 + 1)); // Noncompliant if ($a &amp;&amp; (($x + $y &gt; 0))) { // Noncompliant return (($x + 1)); // Noncompliant } Compliant solution $x = ($y / 2 + 1); if ($a &amp;&amp; ($x + $y &gt; 0)) { return ($x + 1); }",
  "url": "https://rules.sonarsource.com/php/rspec-1110/"
},
{
  "title": "Empty statements should be removed",
  "description": "Empty statements represented by a semicolon ; are statements that do not perform any operation. They are often the result of a typo or a misunderstanding of the language syntax. It is a good practice to remove empty statements since they don’t add value and lead to confusion and errors. Noncompliant code example function doSomething() { ; // Noncompliant - was used as a kind of TODO marker } function doSomethingElse($p) { echo $p;; // Noncompliant - double ; } for ($i = 1; $i &lt;= 10; doSomething($i), $i++); // Noncompliant - Rarely, they are used on purpose as the body of a loop. It is a bad practice to have side-effects outside of the loop body Compliant solution function doSomething() {} function doSomethingElse($p) { echo $p; for ($i = 1; $i &lt;= 10; $i++) { doSomething($i); } }",
  "url": "https://rules.sonarsource.com/php/rspec-1116/"
},
{
  "title": "Local variables should not have the same name as class fields",
  "description": "This rule is deprecated, and will eventually be removed.",
  "url": "https://rules.sonarsource.com/php/rspec-1117/"
},
{
  "title": "Generic exceptions ErrorException, RuntimeException and Exception should not be thrown",
  "description": "This rule raises an issue when a generic exception (such as ErrorException, RuntimeException or Exception) is thrown.",
  "url": "https://rules.sonarsource.com/php/rspec-112/"
},
{
  "title": "Assignments should not be made from within sub-expressions",
  "description": "A common code smell that can hinder the clarity of source code is making assignments within sub-expressions. This practice involves assigning a value to a variable inside a larger expression, such as within a loop or a conditional statement. This practice essentially gives a side-effect to a larger expression, thus making it less readable. This often leads to confusion and potential errors. Exceptions This rule ignores assignments in conditions of while statements and assignments enclosed in relational expressions. while (($line = next_line()) != NULL) {...} while ($line = next_line()) {...}",
  "url": "https://rules.sonarsource.com/php/rspec-1121/"
},
{
  "title": "Modifiers should be declared in the correct order",
  "description": "The PSR2 standard recommends listing modifiers in the following order to improve the readability of PHP source code: final or abstract public or protected or private static Noncompliant code example static protected $foo; ... public static final function bar(){...} Compliant solution protected static $foo; ... final public static function bar(){...}",
  "url": "https://rules.sonarsource.com/php/rspec-1124/"
},
{
  "title": "Boolean literals should not be redundant",
  "description": "A boolean literal can be represented in two different ways: true or false. They can be combined with logical operators (!, &amp;&amp;, ||, ==, !=) to produce logical expressions that represent truth values. However, comparing a boolean literal to a variable or expression that evaluates to a boolean value is unnecessary and can make the code harder to read and understand. The more complex a boolean expression is, the harder it will be for developers to understand its meaning and expected behavior, and it will favour the introduction of new bugs. Exceptions The use of literal booleans in comparisons which use identity operators (=== and !==) are ignored.",
  "url": "https://rules.sonarsource.com/php/rspec-1125/"
},
{
  "title": "Return of boolean expressions should not be wrapped into an \"if-then-else\" statement",
  "description": "Return of boolean literal statements wrapped into if-then-else ones should be simplified. Noncompliant code example if (expression) { return true; } else { return false; } Compliant solution return expression;",
  "url": "https://rules.sonarsource.com/php/rspec-1126/"
},
{
  "title": "Files should end with a newline",
  "description": "Some tools work better when files end with a newline. This rule simply generates an issue if it is missing. For example, a Git diff looks like this if the empty line is missing at the end of the file: +class Test { +} \\ No newline at end of file",
  "url": "https://rules.sonarsource.com/php/rspec-113/"
},
{
  "title": "Lines should not end with trailing whitespaces",
  "description": "Trailing whitespaces bring no information, they may generate noise when comparing different versions of the same file, and they can create bugs when they appear after a \\ marking a line continuation. They should be systematically removed. An automated code formatter allows to completely avoid this family of issues and should be used wherever possible. Exceptions Lines containing only whitespaces.",
  "url": "https://rules.sonarsource.com/php/rspec-1131/"
},
{
  "title": "Track uses of \"FIXME\" tags",
  "description": "FIXME tags are commonly used to mark places where a bug is suspected, but which the developer wants to deal with later. Sometimes the developer will not have the time or will simply forget to get back to that tag. This rule is meant to track those tags and to ensure that they do not go unnoticed. function divide($numerator, $denominator) { return $numerator / $denominator; // FIXME denominator value might be 0 }",
  "url": "https://rules.sonarsource.com/php/rspec-1134/"
},
{
  "title": "Track uses of \"TODO\" tags",
  "description": "Developers often use TODO tags to mark areas in the code where additional work or improvements are needed but are not implemented immediately. However, these TODO tags sometimes get overlooked or forgotten, leading to incomplete or unfinished code. This rule aims to identify and address unattended TODO tags to ensure a clean and maintainable codebase. This description explores why this is a problem and how it can be fixed to improve the overall code quality. What is the potential impact? Unattended TODO tags in code can have significant implications for the development process and the overall codebase. Incomplete Functionality: When developers leave TODO tags without implementing the corresponding code, it results in incomplete functionality within the software. This can lead to unexpected behavior or missing features, adversely affecting the end-user experience. Missed Bug Fixes: If developers do not promptly address TODO tags, they might overlook critical bug fixes and security updates. Delayed bug fixes can result in more severe issues and increase the effort required to resolve them later. Impact on Collaboration: In team-based development environments, unattended TODO tags can hinder collaboration. Other team members might not be aware of the intended changes, leading to conflicts or redundant efforts in the codebase. Codebase Bloat: The accumulation of unattended TODO tags over time can clutter the codebase and make it difficult to distinguish between work in progress and completed code. This bloat can make it challenging to maintain an organized and efficient codebase. Addressing this code smell is essential to ensure a maintainable, readable, reliable codebase and promote effective collaboration among developers. Noncompliant code example function doSomething() { // TODO }",
  "url": "https://rules.sonarsource.com/php/rspec-1135/"
},
{
  "title": "Interface names should comply with a naming convention",
  "description": "Sharing some naming conventions is a key point to make it possible for a team to efficiently collaborate. This rule allows to check that all interface names match a provided regular expression. Noncompliant code example With the default regular expression ^[A-Z][a-zA-Z0-9]*$: interface myInterface {...} // Noncompliant Compliant solution interface MyInterface {...}",
  "url": "https://rules.sonarsource.com/php/rspec-114/"
},
{
  "title": "Functions should not contain too many return statements",
  "description": "Having too many return statements in a function increases the function’s essential complexity because the flow of execution is broken each time a return statement is encountered. This makes it harder to read and understand the logic of the function. Noncompliant code example With the default threshold of 3: function myFunction(){ // Noncompliant as there are 4 return statements if (condition1) { return true; } else { if (condition2) { return false; } else { return true; } } return false; }",
  "url": "https://rules.sonarsource.com/php/rspec-1142/"
},
{
  "title": "Unused \"private\" methods should be removed",
  "description": "This rule raises an issue when a private function is never referenced in the code.",
  "url": "https://rules.sonarsource.com/php/rspec-1144/"
},
{
  "title": "Useless \"if(true) {...}\" and \"if(false){...}\" blocks should be removed",
  "description": "if statements with conditions that are always false have the effect of making blocks of code non-functional. if statements with conditions that are always true are completely redundant, and make the code less readable. There are three possible causes for the presence of such code: An if statement was changed during debugging and that debug code has been committed. Some value was left unset. Some logic is not doing what the programmer thought it did. In any of these cases, unconditional if statements should be removed. Noncompliant code example if (true) { // Noncompliant doSomething(); } ... if (false) { // Noncompliant doSomethingElse(); } Compliant solution doSomething();",
  "url": "https://rules.sonarsource.com/php/rspec-1145/"
},
{
  "title": "Constant names should comply with a naming convention",
  "description": "Constants should be named consistently to communicate intent and improve maintainability. Rename your constants to follow your project’s naming convention to address this issue.",
  "url": "https://rules.sonarsource.com/php/rspec-115/"
},
{
  "title": "\"switch case\" clauses should not have too many lines of code",
  "description": "The switch statement should be used only to clearly define some new branches in the control flow. As soon as a case clause contains too many statements this highly decreases the readability of the overall control flow statement. In such case, the content of the case clause should be extracted into a dedicated method. Noncompliant code example With a threshold of 5: switch ($var) { case 0: // 6 lines till next case methodCall1(); methodCall2(); methodCall3(); methodCall4(); break; default: break; } Compliant solution switch ($var) { case 0: doSomething(); break; default: break; } function doSomething(){ methodCall1(\"\"); methodCall2(\"\"); methodCall3(\"\"); methodCall4(\"\"); }",
  "url": "https://rules.sonarsource.com/php/rspec-1151/"
},
{
  "title": "\"empty()\" should be used to test for emptiness",
  "description": "The empty() function in PHP is specifically designed to check if a variable is empty, and it returns true if the variable is empty or evaluates to false. It handles various types of values, such as empty strings, zero, null, and arrays with no elements. This makes the code more readable because it clearly expresses the intention of checking for emptiness. On the other hand, the count() function in PHP is primarily used to count the number of elements in an array or the properties of an object. It’s less explicit and may be less intuitive for someone reading the code. What is the potential impact? In terms of performance, empty() is generally faster than count() because it doesn’t need to iterate over all the elements in an array to count them. Instead, it directly checks if the variable is empty or evaluates to false. This can be advantageous when dealing with large arrays or performance-sensitive code.",
  "url": "https://rules.sonarsource.com/php/rspec-1155/"
},
{
  "title": "Field names should comply with a naming convention",
  "description": "A naming convention in software development is a set of guidelines for naming code elements like variables, functions, and classes. The goal of a naming convention is to make the code more readable and understandable, which makes it easier to maintain and debug. It also ensures consistency in the code, especially when multiple developers are working on the same project. This rule checks that field names match a provided regular expression. Using the regular expression ^[a-z][a-zA-Z0-9]*$, the noncompliant code below: class MyClass { $my_field; } Should be replaced with: class MyClass { $myField; }",
  "url": "https://rules.sonarsource.com/php/rspec-116/"
},
{
  "title": "Local variable and function parameter names should comply with a naming convention",
  "description": "Local variables and function parameters should be named consistently to communicate intent and improve maintainability. Rename your local variable or function parameter to follow your project’s naming convention to address this issue.",
  "url": "https://rules.sonarsource.com/php/rspec-117/"
},
{
  "title": "Unused function parameters should be removed",
  "description": "A typical code smell known as unused function parameters refers to parameters declared in a function but not used anywhere within the function’s body. While this might seem harmless at first glance, it can lead to confusion and potential errors in your code. Disregarding the values passed to such parameters, the function’s behavior will be the same, but the programmer’s intention won’t be clearly expressed anymore. Therefore, removing function parameters that are not being utilized is considered best practice. Exceptions Functions in classes that override a class or implement interfaces are ignored. class C extends B { function doSomething($a, $b) { // no issue reported on $b compute($a); } }",
  "url": "https://rules.sonarsource.com/php/rspec-1172/"
},
{
  "title": "Overriding methods should do more than simply call the same method in the super class",
  "description": "Overriding a method just to call the same method from the super class without performing any other actions is useless and misleading. The only time this is justified is in final overriding methods, where the effect is to lock in the parent class behavior. This rule ignores such overrides of equals, hashCode and toString. Noncompliant code example class Child extends Parent { public function func($n,$m) { parent::func($n$m); // Noncompliant } } class Parent { public function func($n, $m) { // do something } } Compliant solution class Child extends Parent { public function func($n,$m) { parent::func($n$m); // do additional things... } } class Parent { public function func($n, $m) { // do something } } or class Child extends Parent { // function eliminated } class Parent { public function func($n, $m) { // do something } }",
  "url": "https://rules.sonarsource.com/php/rspec-1185/"
},
{
  "title": "Methods should not be empty",
  "description": "An empty function is generally considered bad practice and can lead to confusion, readability, and maintenance issues. Empty functions bring no functionality and are misleading to others as they might think the function implementation fulfills a specific and identified requirement. There are several reasons for a function not to have a body: It is an unintentional omission, and should be fixed to prevent an unexpected behavior in production. It is not yet, or never will be, supported. In this case an exception should be thrown. The method is an intentionally-blank override. In this case a nested comment should explain the reason for the blank override. Exceptions This rule doesn’t raise an issue on empty methods in abstract classes. abstract class Animal { public function speak() {} // default implementation ignored }",
  "url": "https://rules.sonarsource.com/php/rspec-1186/"
},
{
  "title": "String literals should not be duplicated",
  "description": "Duplicated string literals make the process of refactoring complex and error-prone, as any change would need to be propagated on all occurrences. Exceptions No issue will be raised on: strings with less than 5 characters strings with only letters, numbers, underscores, hyphens and periods",
  "url": "https://rules.sonarsource.com/php/rspec-1192/"
},
{
  "title": "Classes should not be coupled to too many other classes",
  "description": "According to the Single Responsibility Principle, introduced by Robert C. Martin in his book \"Principles of Object Oriented Design\", a class should have only one responsibility: If a class has more than one responsibility, then the responsibilities become coupled. Changes to one responsibility may impair or inhibit the class' ability to meet the others. This kind of coupling leads to fragile designs that break in unexpected ways when changed. Classes which rely on many other classes tend to aggregate too many responsibilities and should be split into several smaller ones. Nested classes dependencies are not counted as dependencies of the outer class. Noncompliant code example class Foo { // Noncompliant - Foo depends on too many classes: T1, T2, T3, T4, T5, T6 and T7 /** * @var T1 */ public $a1; // Foo is coupled to T1 /** * @var T2 */ protected $a2; // Foo is coupled to T2 /** * @var T3 */ private $a3; // Foo is coupled to T3 /** * @param T5 * @param T6 * * @return T4 */ public function compute(T5 $a, $b) { // Foo is coupled to T4, T5 and T6 $result = new T7(); // Foo is coupled to T7 return $result; } }",
  "url": "https://rules.sonarsource.com/php/rspec-1200/"
},
{
  "title": "Control structures should use curly braces",
  "description": "Control structures are code statements that impact the program’s control flow (e.g., if statements, for loops, etc.)",
  "url": "https://rules.sonarsource.com/php/rspec-121/"
},
{
  "title": "Statements should be on separate lines",
  "description": "Putting multiple statements on a single line lowers the code readability and makes debugging the code more complex. if (someCondition) doSomething(); // Noncompliant Write one statement per line to improve readability. if (someCondition) { doSomething(); } Exceptions The rule ignores anonymous functions containing a single statement. $max_comparator = function ($v) { return $v &gt; 2; }; // Compliant by exception $max_comparator = function ($v) { echo $v; return $v &gt; 2; }; // Noncompliant",
  "url": "https://rules.sonarsource.com/php/rspec-122/"
},
{
  "title": "Function and method parameters' initial values should not be ignored",
  "description": "While it is technically correct to assign to parameters from within function bodies, doing so before the parameter value is read is likely a bug. Instead, initial values of parameters should be, if not treated as read-only, then at least read before reassignment. Noncompliant code example function foo($str, $array) { $str = \"name; // Noncompliant foreach ($array as $item) { $item = \"hello world\"; // Noncompliant } }",
  "url": "https://rules.sonarsource.com/php/rspec-1226/"
},
{
  "title": "Sections of code should not be commented out",
  "description": "Commented-out code distracts the focus from the actual executed code. It creates a noise that increases maintenance code. And because it is never executed, it quickly becomes out of date and invalid. Commented-out code should be deleted and can be retrieved from source control history if required.",
  "url": "https://rules.sonarsource.com/php/rspec-125/"
},
{
  "title": "\"if ... else if\" constructs should end with \"else\" clauses",
  "description": "This rule applies whenever an if statement is followed by one or more else if statements; the final else if should be followed by an else statement. The requirement for a final else statement is defensive programming. The else statement should either take appropriate action or contain a suitable comment as to why no action is taken. This is consistent with the requirement to have a final default clause in a switch statement. Noncompliant code example if (condition1) { do_something(); } elseif (condition2) { do_something_else(); } Compliant solution if (condition1) { do_something(); } elseif (condition2) { do_something_else(); } else { throw new InvalidArgumentException('message'); } Exceptions When all branches of an if-elseif end with return, break, continue or throw, the code that comes after the if implicitly behaves as if it was in an else clause. This rule will therefore ignore that case.",
  "url": "https://rules.sonarsource.com/php/rspec-126/"
},
{
  "title": "A \"while\" loop should be used instead of a \"for\" loop",
  "description": "When only the condition expression is defined in a for loop, and the initialization and increment expressions are missing, a while loop should be used instead to increase readability. Noncompliant code example for (;condition;) { /*...*/ } Compliant solution while (condition) { /*...*/ }",
  "url": "https://rules.sonarsource.com/php/rspec-1264/"
},
{
  "title": "\"for\" loop stop conditions should be invariant",
  "description": "A for loop stop condition should test the loop counter against an invariant value (i.e. one that is true at both the beginning and ending of every loop iteration). Ideally, this means that the stop condition is set to a local variable just before the loop begins. Stop conditions that are not invariant are slightly less efficient, as well as being difficult to understand and maintain, and likely lead to the introduction of errors in the future. This rule tracks three types of non-invariant stop conditions: When the loop counters are updated in the body of the for loop When the stop condition depend upon a method call When the stop condition depends on an object property, since such properties could change during the execution of the loop. Noncompliant code example for ($i = 0; $i &lt; 10; $i++) { echo $i; if(condition) { $i = 20; } } Compliant solution for ($i = 0; $i &lt; 10; $i++) { echo $i; }",
  "url": "https://rules.sonarsource.com/php/rspec-127/"
},
{
  "title": "Switch cases should end with an unconditional \"break\" statement",
  "description": "When the execution is not explicitly terminated at the end of a switch case, it continues to execute the statements of the following case. While this is sometimes intentional, it often is a mistake which leads to unexpected behavior. Noncompliant code example switch ($myVariable) { case 1: foo(); break; case 2: // Both 'doSomething()' and 'doSomethingElse()' will be executed. Is it on purpose ? do_something(); default: do_something_else(); break; } Compliant solution switch ($myVariable) { case 1: foo(); break; case 2: do_something(); break; default: do_something_else(); break; } Exceptions This rule is relaxed in following cases: switch ($myVariable) { case 0: // Empty case used to specify the same behavior for a group of cases. case 1: do_something(); break; case 2: // Use of continue statement continue; case 3: // Case includes a jump statement (exit, return, break &amp;etc) exit(0); case 4: echo 'Second case, which falls through'; // no break &lt;- comment is used when fall-through is intentional in a non-empty case body default: // For the last case, use of break statement is optional doSomethingElse(); }",
  "url": "https://rules.sonarsource.com/php/rspec-128/"
},
{
  "title": "Track uses of \"NOSONAR\" comments",
  "description": "Any issue to quality rule can be deactivated with the NOSONAR marker. This marker is pretty useful to exclude false-positive results but it can also be used abusively to hide real quality flaws. This rule raises an issue when NOSONAR is used.",
  "url": "https://rules.sonarsource.com/php/rspec-1291/"
},
{
  "title": "\"switch\" statements should have at least 3 \"case\" clauses",
  "description": "switch statements are useful when there are many different cases depending on the value of the same expression. For just one or two cases, however, the code will be more readable with if statements. Noncompliant code example switch ($variable) { case 0: do_something(); break; default: do_something_else(); break; } Compliant solution if ($variable == 0) { do_something(); } else { do_something_else(); }",
  "url": "https://rules.sonarsource.com/php/rspec-1301/"
},
{
  "title": "\"switch\" statements should have \"default\" clauses",
  "description": "The requirement for a final case default clause is defensive programming. The clause should either take appropriate action, or contain a suitable comment as to why no action is taken. Even when the switch covers all current values of an enum, a default case should still be used because there is no guarantee that the enum won’t be extended. Noncompliant code example switch ($param) { //missing default clause case 0: do_something(); break; case 1: do_something_else(); break; } Compliant solution switch ($param) { case 0: do_something(); break; case 1: do_something_else(); break; default: error(); break; }",
  "url": "https://rules.sonarsource.com/php/rspec-131/"
},
{
  "title": "Cyclomatic Complexity of classes should not be too high",
  "description": "This rule is deprecated, and will eventually be removed.",
  "url": "https://rules.sonarsource.com/php/rspec-1311/"
},
{
  "title": "Using hardcoded IP addresses is security-sensitive",
  "description": "Hardcoding IP addresses is security-sensitive. It has led in the past to the following vulnerabilities: CVE-2006-5901 CVE-2005-3725 Today’s services have an ever-changing architecture due to their scaling and redundancy needs. It is a mistake to think that a service will always have the same IP address. When it does change, the hardcoded IP will have to be modified too. This will have an impact on the product development, delivery, and deployment: The developers will have to do a rapid fix every time this happens, instead of having an operation team change a configuration file. It misleads to use the same address in every environment (dev, sys, qa, prod). Last but not least it has an effect on application security. Attackers might be able to decompile the code and thereby discover a potentially sensitive address. They can perform a Denial of Service attack on the service, try to get access to the system, or try to spoof the IP address to bypass security checks. Such attacks can always be possible, but in the case of a hardcoded IP address solving the issue will take more time, which will increase an attack’s impact. Ask Yourself Whether The disclosed IP address is sensitive, e.g.: Can give information to an attacker about the network topology. It’s a personal (assigned to an identifiable person) IP address. There is a risk if you answered yes to any of these questions. Recommended Secure Coding Practices Don’t hard-code the IP address in the source code, instead make it configurable with environment variables, configuration files, or a similar approach. Alternatively, if confidentially is not required a domain name can be used since it allows to change the destination quickly without having to rebuild the software. Sensitive Code Example $socket = socket_create(AF_INET, SOCK_STREAM, SOL_TCP); socket_connect($socket, '8.8.8.8', 23); // Sensitive Compliant Solution $socket = socket_create(AF_INET, SOCK_STREAM, SOL_TCP); socket_connect($socket, IP_ADDRESS, 23); // Compliant Exceptions No issue is reported for the following cases because they are not considered sensitive: Loopback addresses 127.0.0.0/8 in CIDR notation (from 127.0.0.0 to 127.255.255.255) Broadcast address 255.255.255.255 Non-routable address 0.0.0.0 Strings of the form 2.5.&lt;number&gt;.&lt;number&gt; as they often match Object Identifiers (OID) Addresses in the ranges 192.0.2.0/24, 198.51.100.0/24, 203.0.113.0/24, reserved for documentation purposes by RFC 5737 Addresses in the range 2001:db8::/32, reserved for documentation purposes by RFC 3849 See OWASP - Top 10 2021 Category A1 - Broken Access Control OWASP - Top 10 2017 Category A3 - Sensitive Data Exposure",
  "url": "https://rules.sonarsource.com/php/rspec-1313/"
},
{
  "title": "Octal values should not be used",
  "description": "Integer literals starting with a zero are octal rather than decimal values. While using octal values is fully supported, most developers do not have experience with them. They may not recognize octal values as such, mistaking them instead for decimal values. Noncompliant code example $myNumber = 023; # Noncompliant myNumber will hold 19, not 23 - was this really expected? Compliant solution $myNumber = 19; Exceptions This rule does not apply to values smaller than 8 and octal values having 3 digits, since 3 digits octal values are often used as file permission masks. Example: $permissionMask = 0777; $dayOfMonth = 03;",
  "url": "https://rules.sonarsource.com/php/rspec-1314/"
},
{
  "title": "Control flow statements \"if\", \"for\", \"while\", \"switch\" and \"try\" should not be nested too deeply",
  "description": "Nested control flow statements such as if, for, while, switch, and try are often key ingredients in creating what’s known as \"Spaghetti code\". This code smell can make your program difficult to understand and maintain. When numerous control structures are placed inside one another, the code becomes a tangled, complex web. This significantly reduces the code’s readability and maintainability, and it also complicates the testing process.",
  "url": "https://rules.sonarsource.com/php/rspec-134/"
},
{
  "title": "Functions should not have too many lines of code",
  "description": "A function that grows too large tends to aggregate too many responsibilities. Such functions inevitably become harder to understand and therefore harder to maintain. Above a specific threshold, it is strongly advised to refactor into smaller functions which focus on well-defined tasks. Those smaller functions will not only be easier to understand, but also probably easier to test.",
  "url": "https://rules.sonarsource.com/php/rspec-138/"
},
{
  "title": "Comments should not be located at the end of lines of code",
  "description": "This rule verifies that single-line comments are not located at the ends of lines of code. The main idea behind this rule is that in order to be really readable, trailing comments would have to be properly written and formatted (correct alignment, no interference with the visual structure of the code, not too long to be visible) but most often, automatic code formatters would not handle this correctly: the code would end up less readable. Comments are far better placed on the previous empty line of code, where they will always be visible and properly formatted. Noncompliant code example $a = $b + $c; // This is a trailing comment that can be very very long Compliant solution // This very long comment is better placed before the line of code $a = $b + $c;",
  "url": "https://rules.sonarsource.com/php/rspec-139/"
},
{
  "title": "Classes should not have too many methods",
  "description": "A class that grows too much tends to aggregate too many responsibilities and inevitably becomes harder to understand and therefore to maintain. Above a specific threshold, it is strongly advised to refactor the class into smaller ones which focus on well defined topics.",
  "url": "https://rules.sonarsource.com/php/rspec-1448/"
},
{
  "title": "Track lack of copyright and license headers",
  "description": "Each source file should start with a header stating file ownership and the license which must be used to distribute the application. This rule must be fed with the header text that is expected at the beginning of every file. Compliant solution /* * SonarQube, open source software quality management tool. * Copyright (C) 2008-2013 SonarSource * mailto:contact AT sonarsource DOT com * * SonarQube is free software; you can redistribute it and/or * modify it under the terms of the GNU Lesser General Public * License as published by the Free Software Foundation; either * version 3 of the License, or (at your option) any later version. * * SonarQube is distributed in the hope that it will be useful, * but WITHOUT ANY WARRANTY; without even the implied warranty of * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU * Lesser General Public License for more details. * * You should have received a copy of the GNU Lesser General Public License * along with this program; if not, write to the Free Software Foundation, * Inc., 51 Franklin Street, Fifth Floor, Boston, MA 02110-1301, USA. */",
  "url": "https://rules.sonarsource.com/php/rspec-1451/"
},
{
  "title": "\"switch\" statements should not have too many \"case\" clauses",
  "description": "When switch statements have large sets of case clauses, it is usually an attempt to map two sets of data. A real map structure would be more readable and maintainable, and should be used instead.",
  "url": "https://rules.sonarsource.com/php/rspec-1479/"
},
{
  "title": "Unused local variables should be removed",
  "description": "An unused local variable is a variable that has been declared but is not used anywhere in the block of code where it is defined. It is dead code, contributing to unnecessary complexity and leading to confusion when reading the code. Therefore, it should be removed from your code to maintain clarity and efficiency. What is the potential impact? Having unused local variables in your code can lead to several issues: Decreased Readability: Unused variables can make your code more difficult to read. They add extra lines and complexity, which can distract from the main logic of the code. Misunderstanding: When other developers read your code, they may wonder why a variable is declared but not used. This can lead to confusion and misinterpretation of the code’s intent. Potential for Bugs: If a variable is declared but not used, it might indicate a bug or incomplete code. For example, if you declared a variable intending to use it in a calculation, but then forgot to do so, your program might not work as expected. Maintenance Issues: Unused variables can make code maintenance more difficult. If a programmer sees an unused variable, they might think it is a mistake and try to 'fix' the code, potentially introducing new bugs. Memory Usage: Although modern compilers are smart enough to ignore unused variables, not all compilers do this. In such cases, unused variables take up memory space, leading to inefficient use of resources. In summary, unused local variables can make your code less readable, more confusing, and harder to maintain, and they can potentially lead to bugs or inefficient memory use. Therefore, it is best to remove them.",
  "url": "https://rules.sonarsource.com/php/rspec-1481/"
},
{
  "title": "Local variables should not be declared and then immediately returned or thrown",
  "description": "Declaring a variable only to immediately return or throw it is considered a bad practice because it adds unnecessary complexity to the code. This practice can make the code harder to read and understand, as it introduces an extra step that doesn’t add any value. Instead of declaring a variable and then immediately returning or throwing it, it is generally better to return or throw the value directly. This makes the code cleaner, simpler, and easier to understand. Noncompliant code example function computeDurationInMilliseconds() { $duration = ((($hours * 60) + $minutes) * 60 + $seconds ) * 1000 ; return $duration; } Compliant solution function computeDurationInMilliseconds() { return ((($hours * 60) + $minutes) * 60 + $seconds ) * 1000; }",
  "url": "https://rules.sonarsource.com/php/rspec-1488/"
},
{
  "title": "Dynamically executing code is security-sensitive",
  "description": "Executing code dynamically is security-sensitive. It has led in the past to the following vulnerabilities: CVE-2017-9807 CVE-2017-9802 Some APIs enable the execution of dynamic code by providing it as strings at runtime. These APIs might be useful in some very specific meta-programming use-cases. However most of the time their use is frowned upon as they also increase the risk of Injected Code. Such attacks can either run on the server or in the client (exemple: XSS attack) and have a huge impact on an application’s security. This rule marks for review each occurrence of the eval function. This rule does not detect code injections. It only highlights the use of APIs which should be used sparingly and very carefully. The goal is to guide security code reviews. Ask Yourself Whether the executed code may come from an untrusted source and hasn’t been sanitized. you really need to run code dynamically. There is a risk if you answered yes to any of those questions. Recommended Secure Coding Practices Regarding the execution of unknown code, the best solution is to not run code provided by an untrusted source. If you really need to do it, run the code in a sandboxed environment. Use jails, firewalls and whatever means your operating system and programming language provide (example: Security Managers in java, iframes and same-origin policy for javascript in a web browser). Do not try to create a blacklist of dangerous code. It is impossible to cover all attacks that way. Avoid using dynamic code APIs whenever possible. Hard-coded code is always safer. Sensitive Code Example eval($code_to_be_dynamically_executed) See OWASP - Top 10 2021 Category A3 - Injection OWASP - Top 10 2017 Category A1 - Injection CWE - CWE-95 - Improper Neutralization of Directives in Dynamically Evaluated Code ('Eval Injection')",
  "url": "https://rules.sonarsource.com/php/rspec-1523/"
},
{
  "title": "Cyclomatic Complexity of functions should not be too high",
  "description": "The Cyclomatic Complexity of functions should not exceed a defined threshold. Complex code may perform poorly and can be difficult to test thoroughly.",
  "url": "https://rules.sonarsource.com/php/rspec-1541/"
},
{
  "title": "File names should comply with a naming convention",
  "description": "Shared coding conventions allow teams to collaborate effectively. For that reason, file names should conform to a defined standard. This rule raises an issue when the names of analyzed files don’t match the provided regular expression.",
  "url": "https://rules.sonarsource.com/php/rspec-1578/"
},
{
  "title": "Variable variables should not be used",
  "description": "Variable variables in PHP allow you to use the value of a variable as the name of another variable. This feature can be useful in dynamic programming scenarios where variable names need to be dynamically determined and manipulated. What is the potential impact? The use of variable variables in PHP can make code harder to read and understand, as it introduces a level of indirection and can lead to confusion. It can also increase the risk of security vulnerabilities, such as allowing user input to directly manipulate variable names, potentially leading to injection attacks or unintended behavior. Noncompliant code example $var = 'foo'; $$var = 'bar'; //Noncompliant $$$var = 'hello'; //Noncompliant echo $foo; //will display 'bar' echo $bar; //will display 'hello'",
  "url": "https://rules.sonarsource.com/php/rspec-1599/"
},
{
  "title": "Deprecated predefined variables should not be used",
  "description": "Deprecated predefined variables in PHP should not be used because they may lead to compatibility issues and unpredictable behavior in future versions of PHP. Relying on deprecated variables can result in code that is difficult to maintain and may break when migrating to newer PHP versions. It is recommended to use the recommended alternatives or custom variables to ensure long-term compatibility and stability of PHP code.",
  "url": "https://rules.sonarsource.com/php/rspec-1600/"
},
{
  "title": "Deprecated constructor declarations should not be used",
  "description": "Using a function in PHP with the same name as the nesting class was historically used to declare a class constructor. However, as of PHP 8.0.0, this declaration is discouraged and will provoke an E_DEPRECATED error, albeit it functions as a constructor. Instead, users should explicitly define the constructor by declaring a __construct(...) function. However, if both styles are present in the same class, PHP will treat the __construct function as the class constructor, which can cause unintended behavior. Adhering to this convention improves readability and maintainability by ensuring that the constructor declaration is named uniformly throughout the codebase. Noncompliant code example class Foo { function Foo() {...} } Compliant solution class Foo { function __construct() {...} }",
  "url": "https://rules.sonarsource.com/php/rspec-1603/"
},
{
  "title": "\"__construct\" functions should not make PHP 4-style calls to parent constructors",
  "description": "In PHP both the way to declare a constructor and the way to make a call to a parent constructor have evolved. When declaring constructors with the __construct name, nested calls to parent constructors should also use the new __constructor name. Noncompliant code example class Foo extends Bar { function __construct() { parent::Bar(); } } Compliant solution class Foo extends Bar { function __construct() { parent::__construct(); } }",
  "url": "https://rules.sonarsource.com/php/rspec-1605/"
},
{
  "title": "A reason should be provided when skipping a test",
  "description": "When a test fails due, for example, to infrastructure issues, you might want to ignore it temporarily. But without some kind of notation about why the test is being ignored, it may never be reactivated. Such tests are difficult to address without comprehensive knowledge of the project, and end up polluting their projects. This rule raises an issue on each test that is marked as incomplete or skipped without a message explaining the reasoning behind it. Noncompliant code example protected function setUp() { if (!extension_loaded('mysqli')) { $this-&gt;markTestSkipped(); // Noncompliant } } public function testSomething() { $this-&gt;assertTrue($result-&gt;isValid()); $this-&gt;markTestIncomplete(); // Noncompliant } Compliant solution protected function setUp() { if (!extension_loaded('mysqli')) { $this-&gt;markTestSkipped( 'The MySQLi extension is not available.' ); // Compliant } } public function testSomething() { $this-&gt;assertTrue($result-&gt;isValid()); $this-&gt;markTestIncomplete( 'Testing result validation is incomplete.' ); // Compliant }",
  "url": "https://rules.sonarsource.com/php/rspec-1607/"
},
{
  "title": "Variables should not be self-assigned",
  "description": "There is no reason to re-assign a variable to itself. Either this statement is redundant and should be removed, or the re-assignment is a mistake and some other value or variable was intended for the assignment instead. Noncompliant code example public function setName($name) { $name = $name; } Compliant solution public function setName($name) { $this-&gt;name = $name; }",
  "url": "https://rules.sonarsource.com/php/rspec-1656/"
},
{
  "title": "Short-circuit logic should be used to prevent null pointer dereferences in conditionals",
  "description": "When either the equality operator in a null test or the logical operator that follows it is reversed, the code has the appearance of safely null-testing the object before dereferencing it. Unfortunately the effect is just the opposite - the object is null-tested and then dereferenced only if it is null, leading to a guaranteed null pointer dereference. Noncompliant code example if ($obj == null &amp;&amp; $obj-&gt;isOpen()) { echo \"Object is open\"; } if ($obj != null || $obj-&gt;isOpen()) { echo \"Object is not open\"; } Compliant solution if ($obj == null || $obj-&gt;isOpen()) { echo \"Object is open\"; } if ($obj != null &amp;&amp; !$obj-&gt;isOpen()) { echo \"Object is not open\"; }",
  "url": "https://rules.sonarsource.com/php/rspec-1697/"
},
{
  "title": "Loops with at most one iteration should be refactored",
  "description": "A loop with at most one iteration is equivalent to the use of an if statement to conditionally execute one piece of code. No developer expects to find such a use of a loop statement. If the initial intention of the author was really to conditionally execute one piece of code, an if statement should be used instead. At worst that was not the initial intention of the author and so the body of the loop should be fixed to use the nested return, break or throw statements in a more appropriate way. Noncompliant code example for ($i = 0; $i &lt; 10; $i++) { // Noncompliant echo \"i is $i\"; break; } ... for ($i = 0; $i &lt; 10; $i++) { // Noncompliant if ($i == $x) { break; } else { echo \"i is $i\"; return; } } Compliant solution for ($i = 0; $i &lt; 10; $i++) { echo \"i is $i\"; } ... for ($i = 0; $i &lt; 10; $i++) { if ($i == $x) { break; } else { echo \"i is $i\"; } }",
  "url": "https://rules.sonarsource.com/php/rspec-1751/"
},
{
  "title": "\"<?php\" and \"<?=\" tags should be used",
  "description": "The &lt;?php tag is used to explicitly mark the start of PHP code in a file. It is considered the recommended and portable way to open PHP blocks. On the other hand, the &lt;?= tag is a shorthand for &lt;?php echo and is specifically used to output variables or expressions directly without using the echo statement. Not using these tags can make the code less readable and harder to maintain, as it deviates from the standard conventions followed by most PHP developers. Noncompliant code example &lt;? $foo = 1; ?&gt; Compliant solution &lt;?php $foo = 1; ?&gt;",
  "url": "https://rules.sonarsource.com/php/rspec-1757/"
},
{
  "title": "All code should be reachable",
  "description": "Once control flow has been moved out of the current code block, any subsequent statements become effectively unreachable.",
  "url": "https://rules.sonarsource.com/php/rspec-1763/"
},
{
  "title": "Identical expressions should not be used on both sides of a binary operator",
  "description": "Using the same value on both sides of a binary operator is a code defect. In the case of logical operators, it is either a copy/paste error and, therefore, a bug, or it is simply duplicated code and should be simplified. In the case of bitwise operators and most binary mathematical operators, having the same value on both sides of an operator yields predictable results and should be simplified as well. Noncompliant code example if ( $a == $a ) { // always true doZ(); } if ( $a != $a ) { // always false doY(); } if ( $a == $b &amp;&amp; $a == $b ) { // if the first one is true, the second one is too doX(); } if ( $a == $b || $a == $b ) { // if the first one is true, the second one is too doW(); } $j = 5 / 5; //always 1 $k = 5 - 5; //always 0 Exceptions Left-shifting 1 onto 1 is common in the construction of bit masks, and is ignored. $i = 1 &lt;&lt; 1; // Compliant $j = $a &lt;&lt; $a; // Noncompliant",
  "url": "https://rules.sonarsource.com/php/rspec-1764/"
},
{
  "title": "The \"var\" keyword should not be used",
  "description": "The var keyword in PHP was historically used to declare class properties with default public visibility. However, its usage is discouraged as it lacks clarity and explicit visibility declaration. Instead, PHP introduced the keywords public, protected, and private to clearly define the visibility of class properties. This enhances code readability and maintainability, as it becomes easier to understand and control access to class members. Additionally, using the keywords for explicit visibility helps prevent unintended modifications or security vulnerabilities that may arise from the ambiguity of the var keyword. Noncompliant code example &lt;?php class Foo { var $bar = 1; } Compliant solution &lt;?php class Foo { public $bar = 1; }",
  "url": "https://rules.sonarsource.com/php/rspec-1765/"
},
{
  "title": "More than one property should not be declared per statement",
  "description": "It is recommended not to declare more than one property per statement for the sake of code readability and maintainability. Declaring multiple properties in a single statement can make the code harder to understand and debug. It also increases the risk of introducing errors or overlooking specific property assignments.",
  "url": "https://rules.sonarsource.com/php/rspec-1766/"
},
{
  "title": "Only LF character (Unix-like) should be used to end lines",
  "description": "All developers should use the same end-line character(s) to prevent polluting the history changelog of source files in the SCM engine. Moreover some SCM engines like Git might sometimes badly support use of Windows 'CRLF' end of line characters.",
  "url": "https://rules.sonarsource.com/php/rspec-1779/"
},
{
  "title": "Closing tag \"?>\" should be omitted on files containing only PHP",
  "description": "While it is not inherently wrong to use the closing PHP tag, developers often choose to omit it to minimize the chances of encountering issues and to follow established best practices and coding standards. What is the potential impact? There are a few reasons developers should avoid using the closing PHP tag ?&gt; at the end of a file: If a developer accidentally adds whitespace or any other characters after the closing PHP tag, it can cause PHP to automatically start output buffering. This can lead to unexpected behavior when trying to modify headers or perform redirects because headers need to be sent before any content. Some frameworks and coding standards explicitly discourage the use of the closing PHP tag to ensure compatibility and portability across different PHP environments and versions. Following a consistent coding style and adhering to best practices are important for code readability and maintainability. Many coding standards, such as the PER (PHP Evolving Recommendation), recommend omitting the closing PHP tag for the reasons mentioned above.",
  "url": "https://rules.sonarsource.com/php/rspec-1780/"
},
{
  "title": "PHP keywords and constants \"true\", \"false\", \"null\" should be lower case",
  "description": "In PHP, keywords and constants are case-insensitive, meaning they can be written in either lower case or upper case without affecting their functionality. This allows for more flexibility and ease of use when writing code. However, it is generally recommended to follow a consistent casing convention for readability and maintainability purposes. Relevant constants are true, false and null. Note that if the Drupal framework is detected, this rule will enforce Drupal standards instead. Relevant constants are TRUE, FALSE and NULL. Noncompliant code example &lt;?php ECHO 'Hello World'; ?&gt; &lt;?php // In a Drupal context const CACHE_ENABLED = true; ?&gt; Compliant solution &lt;?php echo 'Hello World'; ?&gt; &lt;?php // In a Drupal context const CACHE_ENABLED = TRUE; ?&gt;",
  "url": "https://rules.sonarsource.com/php/rspec-1781/"
},
{
  "title": "Method visibility should be explicitly declared",
  "description": "Explicitly declaring method visibility provides clarity and improves code readability. This leads to: Simplifying access to and use of the methods for other developers, enhancing the maintainability of the codebase. Promoting the principle of encapsulation, allowing you to control the accessibility of methods and prevent unintended access or modifications from external code. By explicitly stating the visibility, you establish a clear contract for how the methods should be interacted with, making it easier to understand and reason about the behavior of the code. Available access modifiers are: private - access allowed only within the same class protected - access allowed to the class and its child classes public - unfettered access by all (default)",
  "url": "https://rules.sonarsource.com/php/rspec-1784/"
},
{
  "title": "Method arguments with default values should be last",
  "description": "The ability to define default values for method arguments can make a method easier to use. Default argument values allow callers to specify as many or as few arguments as they want while getting the same functionality and minimizing boilerplate, wrapper code. But all method arguments with default values should be declared after the method arguments without default values. Otherwise, it makes it impossible for callers to take advantage of defaults; they must re-specify the defaulted values in order to \"get to\" the non-default arguments. Noncompliant code example function makeyogurt($type = \"acidophilus\", $flavor){...} // Noncompliant makeyogurt(\"raspberry\")}} // Runtime error: Missing argument 2 in call to makeyogurt() Compliant solution function makeyogurt($flavor, $type = \"acidophilus\", ){...} makeyogurt(\"raspberry\")}} // Works as expected",
  "url": "https://rules.sonarsource.com/php/rspec-1788/"
},
{
  "title": "\"elseif\" keyword should be used in place of \"else if\" keywords",
  "description": "The elseif keyword is preferred over the else if keywords in PHP due to its consistency with other programming languages. elseif is a single token, making it more efficient for the PHP parser to process. Additionally, using elseif encourages developers to follow a unified coding style and maintain a consistent syntax throughout their PHP codebase. Overall, the use of elseif improves code clarity, reduces potential errors, and enhances the overall maintainability of PHP projects. Noncompliant code example if ($expr1) { ... } else if ($expr2) { ... } else {...} Compliant solution if ($expr1) { ... } elseif ($expr2) { ... } else {...}",
  "url": "https://rules.sonarsource.com/php/rspec-1793/"
},
{
  "title": "\"exit(...)\" and \"die(...)\" statements should not be used",
  "description": "The exit(...) and die(...) statements should absolutely not be used in Web PHP pages as this might lead to a very bad user experience. In such case, the end user might have the feeling that the web site is down or has encountered a fatal error. But of course PHP can also be used to develop command line application and in such case use of exit(...) or die(...) statement can be justified but must remain limited and not spread all over the application. We expect exceptions to be used to handle errors and those exceptions should be caught just before leaving the application to specify the exit code with help of exit(...) or die(...) statements. Noncompliant code example class Foo { public function bar($param) { if ($param === 42) { exit(23); } } } Compliant solution class Foo { public function bar($param) { if ($param === 42) { throw new Exception('Value 42 is not expected.'); } } }",
  "url": "https://rules.sonarsource.com/php/rspec-1799/"
},
{
  "title": "Source code should comply with formatting standards",
  "description": "Shared coding conventions make it possible for a team to collaborate efficiently. This rule raises issues for failures to comply with formatting standard. By default, this rule conforms to the PER (PHP Evolving Recommendation) standard.",
  "url": "https://rules.sonarsource.com/php/rspec-1808/"
},
{
  "title": "Classes should not have too many fields",
  "description": "A class that grows too much tends to aggregate too many responsibilities and inevitably becomes harder to understand and therefore to maintain, and having a lot of fields is an indication that a class has grown too large. Above a specific threshold, it is strongly advised to refactor the class into smaller ones which focus on well defined topics.",
  "url": "https://rules.sonarsource.com/php/rspec-1820/"
},
{
  "title": "\"switch\" statements should not be nested",
  "description": "Nested switch structures are difficult to understand because you can easily confuse the cases of an inner switch as belonging to an outer statement. Therefore nested switch statements should be avoided. Specifically, you should structure your code to avoid the need for nested switch statements, but if you cannot, then consider moving the inner switch to another function. Noncompliant code example switch($a) { case \"foo\": switch($b) { // Noncompliant case \"bar\": doSomething(); break; } break; } Compliant solution function handleFoo($foo) { switch($foo) { case \"bar\": doSomething(); break; } } switch($a) { case \"foo\": handleFoo($b); break; }",
  "url": "https://rules.sonarsource.com/php/rspec-1821/"
},
{
  "title": "Objects should not be created to be dropped immediately without being used",
  "description": "There is no good reason to create a new object to not do anything with it. Most of the time, this is due to a missing piece of code and so could lead to an unexpected behavior in production. If it was done on purpose because the constructor has side-effects, then that side-effect code should be moved into a separate method and called directly. Noncompliant code example if ($x &lt; 0) { new foo; // Noncompliant } Compliant solution $var = NULL; if ($x &lt; 0) { $var = new foo; }",
  "url": "https://rules.sonarsource.com/php/rspec-1848/"
},
{
  "title": "Unused assignments should be removed",
  "description": "Dead stores refer to assignments made to local variables that are subsequently never used or immediately overwritten. Such assignments are unnecessary and don’t contribute to the functionality or clarity of the code. They may even negatively impact performance. Removing them enhances code cleanliness and readability. Even if the unnecessary operations do not do any harm in terms of the program’s correctness, they are - at best - a waste of computing resources. Exceptions This rule ignores initializations to -1, 0, 1, null, true, false, \"\", [] and array().",
  "url": "https://rules.sonarsource.com/php/rspec-1854/"
},
{
  "title": "Related \"if/else if\" statements and \"cases\" in a \"switch\" should not have the same condition",
  "description": "A switch and a chain of if/else if statements is evaluated from top to bottom. At most, only one branch will be executed: the first one with a condition that evaluates to true. Therefore, duplicating a condition automatically leads to dead code. Usually, this is due to a copy/paste error. At best, it’s simply dead code and at worst, it’s a bug that is likely to induce further bugs as the code is maintained, and obviously it could lead to unexpected behavior. For a switch, if the first case ends with a break, the second case will never be executed, rendering it dead code. Worse there is the risk in this situation that future maintenance will be done on the dead case, rather than on the one that’s actually used. On the other hand, if the first case does not end with a break, both cases will be executed, but future maintainers may not notice that. Noncompliant code example if ($param == 1) openWindow(); else if ($param == 2) closeWindow(); else if ($param == 1) // Noncompliant moveWindowToTheBackground(); switch($i) { case 1: //... break; case 3: //... break; case 1: // Noncompliant //... break; default: // ... break; } Compliant solution if ($param == 1) openWindow(); else if ($param == 2) closeWindow(); else if ($param == 3) moveWindowToTheBackground(); switch($i) { case 1: //... break; case 3: //... break; default: // ... break; }",
  "url": "https://rules.sonarsource.com/php/rspec-1862/"
},
{
  "title": "Two branches in a conditional structure should not have exactly the same implementation",
  "description": "When the same code is duplicated in two or more separate branches of a conditional, it can make the code harder to understand, maintain, and can potentially introduce bugs if one instance of the code is changed but others are not. Having two cases in a switch statement or two branches in an if chain with the same implementation is at best duplicate code, and at worst a coding error. if ($a &gt;= 0 &amp;&amp; $a &lt; 10) { doFirst(); doTheThing(); } else if ($a &gt;= 10 &amp;&amp; $a &lt; 20) { doTheOtherThing(); } else if ($a &gt;= 20 &amp;&amp; $a &lt; 50) { doFirst(); doTheThing(); // Noncompliant; duplicates first condition } switch ($i) { case 1: doFirst(); doSomething(); break; case 2: doSomethingDifferent(); break; case 3: // Noncompliant; duplicates case 1's implementation doFirst(); doSomething(); break; default: doTheRest(); } If the same logic is truly needed for both instances, then: in an if chain they should be combined if (($a &gt;= 0 &amp;&amp; $a &lt; 10) || ($a &gt;= 20 &amp;&amp; $a &lt; 50)) { doFirst(); doTheThing(); } else if ($a &gt;= 10 &amp;&amp; $a &lt; 20) { doTheOtherThing(); } for a switch, one should fall through to the other switch ($i) { case 1: case 3: doFirst(); doSomething(); break; case 2: doSomethingDifferent(); break; default: doTheRest(); } Exceptions Blocks in an if chain that contain a single line of code are ignored, as are blocks in a switch statement that contain a single line of code with or without a following break. if ($a &gt;= 0 &amp;&amp; $a &lt; 10) { doTheThing(); } else if ($a &gt;= 10 &amp;&amp; $a &lt; 20) { doTheOtherThing(); } else if ($a &gt;= 20 &amp;&amp; $a &lt; 50) { doTheThing(); // no issue, usually this is done on purpose to increase the readability } But this exception does not apply to if chains without else-s, or to switch-es without default clauses when all branches have the same single line of code. In the case of if chains with else-s, or of switch-es with default clauses, rule S3923 raises a bug. if ($a &gt;= 0 &amp;&amp; $a &lt; 10) { doTheThing(); } else if ($a &gt;= 20 &amp;&amp; $a &lt; 50) { doTheThing(); //Noncompliant; this might have been done on purpose but probably not }",
  "url": "https://rules.sonarsource.com/php/rspec-1871/"
},
{
  "title": "Boolean checks should not be inverted",
  "description": "It is needlessly complex to invert the result of a boolean comparison. The opposite comparison should be made instead. Noncompliant code example if (!($a == 2)) { ... } // Noncompliant $b = !($i &lt; 10); // Noncompliant Compliant solution if ($a != 2) { ... } $b = ($i &gt;= 10);",
  "url": "https://rules.sonarsource.com/php/rspec-1940/"
},
{
  "title": "\"final\" should not be used redundantly",
  "description": "There is no need to use the final modifier inside a final class. Everything in it is final by default. Noncompliant code example final class MyClass { public final String getName() { // Noncompliant return name; } } Compliant solution final class MyClass { public String getName() { // Compliant return name; } }",
  "url": "https://rules.sonarsource.com/php/rspec-1990/"
},
{
  "title": "Files should contain only one top-level class or interface each",
  "description": "A file that grows too much tends to aggregate too many responsibilities and inevitably becomes harder to understand and therefore to maintain. This is doubly true for a file with multiple top-level classes and interfaces. It is strongly advised to divide the file into one top-level class or interface per file.",
  "url": "https://rules.sonarsource.com/php/rspec-1996/"
},
{
  "title": "Files should not contain inline HTML",
  "description": "Shared coding conventions allow teams to collaborate efficiently. To avoid the confusion that can be caused by tangling two coding languages in the same file, inline HTML should be avoided. Noncompliant code example &lt;?php $name = \"George\"; ?&gt; &lt;p&gt; Hello &lt;?php echo $name ?&gt;!&lt;/p&gt; Exceptions File having the extension .phtml are ignored by this rule because they are expected to have mixed PHP and HTML.",
  "url": "https://rules.sonarsource.com/php/rspec-1997/"
},
{
  "title": "References should not be passed to function calls",
  "description": "In PHP, references allow you to create multiple names for the same variable, enabling you to access and manipulate its value through different identifiers. They are denoted by the ampersand symbol &amp; placed before the variable name during declaration or assignment. Any modification a method makes to a function parameter passed by reference will also be made to the original value. This feature can be difficult to use correctly, particularly if the callee is not expecting a reference. The improper use of references in function calls can make code less efficient rather than more efficient. What is the potential impact? While references can provide flexibility and efficiency in certain scenarios, they can also introduce complexity and potential pitfalls. Incorrect usage of references may lead to unexpected behavior, difficult-to-debug code, and unintended side effects. It’s important to exercise caution and fully understand the implications before employing references.",
  "url": "https://rules.sonarsource.com/php/rspec-1998/"
},
{
  "title": "Files should not contain characters before \"<?php\"",
  "description": "Having characters before &lt;?php can cause \"Cannot modify header information\" errors and similar problems with Ajax requests. Noncompliant code example test&lt;?php //Noncompliant // ... and // Noncompliant; newline before opening tag &lt;?php // ... Compliant solution &lt;?php // ...",
  "url": "https://rules.sonarsource.com/php/rspec-2000/"
},
{
  "title": "Deprecated features should not be used",
  "description": "Deprecated language features are those that have been retained temporarily for backward compatibility, but which will eventually be removed from the language. In effect, deprecation announces a grace period to allow the smooth transition from the old features to the new ones. In that period, no use of the deprecated features should be added to the code, and all existing uses should be gradually removed. The following functions were deprecated in PHP 5: Deprecated Use Instead call_user_method() call_user_func() call_user_method_array() call_user_func_array() define_syslog_variables() dl() ereg() preg_match() ereg_replace() preg_replace() (note that this is deprecated in PHP 5.5) eregi() preg_match() with 'i' modifier eregi_replace() preg_replace() with 'i' modifier set_magic_quotes_runtime() and its alias, magic_quotes_runtime() session_register() $_SESSION superglobal session_unregister() $_SESSION superglobal session_is_registered() $_SESSION superglobal set_socket_blocking() stream_set_blocking() split() preg_split() spliti() preg_split() with 'i' modifier sql_regcase() mysql_db_query() mysql_select_db() and mysql_query() mysql_escape_string() mysql_real_escape_string() Passing locale category names as strings Use the LC_* family of constants The following functions were deprecated in PHP 7: Deprecated Use Instead __autoload() spl_autoload_register() create_function() anonymous function parse_str() without second argument parse_str() with second argument gmp_random() gmp_random_bits() or gmp_random_range() each() foreach assert() with string argument Defining case-insensitive constants by calling define() with true as third parameter define(\"myconst\", $value) or define(\"myconst\", $value, false) FILTER_FLAG_SCHEME_REQUIRED and FILTER_FLAG_HOST_REQUIRED flags FILTER_VALIDATE_URL flag fgetss() function, \"string.strip_tags\" stream filter name, SplFileObject::fgetss() method and gzgetss() function mbregex_encoding(), mbereg(), mberegi(), mbereg_replace(), mberegi_replace(), mbsplit(), mbereg_match(), mbereg_search(), mbereg_search_pos(), mbereg_search_regs(), mbereg_search_init(), mbereg_search_getregs(), mbereg_search_getpos(), mbereg_search_setpos() Use the corresponding mb_ereg_*() variants instead string search functions with integer needle (stristr, strrchr, strstr, strripos, stripos, strrpos, strpos, strchr) use a string needle instead image2wbmp() imagewbmp() Normalizer::NONE Defining an assert() function inside a namespace use the standard assert() function",
  "url": "https://rules.sonarsource.com/php/rspec-2001/"
},
{
  "title": "Errors should not be silenced",
  "description": "Just as pain is your body’s way of telling you something is wrong, errors are PHP’s way of telling you there’s something you need to fix. Neither pain, nor PHP errors should be ignored. Noncompliant code example @doSomethingDangerous($password); // Noncompliant; '@' silences errors from function call Compliant solution doSomethingDangerous($password);",
  "url": "https://rules.sonarsource.com/php/rspec-2002/"
},
{
  "title": "\"require_once\" and \"include_once\" should be used instead of \"require\" and \"include\"",
  "description": "At root, require, require_once, include, and include_once all perform the same task of including one file in another. However, the way they perform that task differs, and they should not be used interchangeably. require includes a file but generates a fatal error if an error occurs in the process. include also includes a file, but generates only a warning if an error occurs. Predictably, the difference between require and require_once is the same as the difference between include and include_once. The _once versions ensure that the specified file is only included once. What is the potential impact? Including the same file multiple times could have unpredictable results, the _once versions are preferred. Additionally, as include_once generates only warnings, it should be used only when the file is being included conditionally, i.e. when all possible error conditions have been checked beforehand.",
  "url": "https://rules.sonarsource.com/php/rspec-2003/"
},
{
  "title": "Functions should not be nested too deeply",
  "description": "In PHP, nested functions are functions, which are defined inside other functions. They have access to the variables of the enclosing functions. Once the parent function declares the nested function, the nested function becomes available to the global scope. Code that uses nested functions can become difficult to read, refactor and to maintain and should therefore be avoided. Noncompliant code example With the default threshold of 3 level: function f () { function f_inner () { function f_inner_inner() { function f_inner_inner_inner() { // Noncompliant } } } }",
  "url": "https://rules.sonarsource.com/php/rspec-2004/"
},
{
  "title": "String literals should not be concatenated",
  "description": "There is no reason to concatenate literal strings. Doing so is an exercise in reducing code readability. Instead, the strings should be combined. Noncompliant code example $msg = \"Hello \" . \"${name}\" . \"!\"; // Noncompliant Compliant solution $msg = \"Hello ${name}!\";",
  "url": "https://rules.sonarsource.com/php/rspec-2005/"
},
{
  "title": "Functions and variables should not be defined outside of classes",
  "description": "Defining and using global variables and global functions, when the convention dictates OOP can be confusing and difficult to use properly for multiple reasons: You run the risk of name clashes. Global functions must be stateless, or they can cause difficult-to-track bugs. Global variables can be updated from anywhere and may no longer hold the value you expect. It is difficult to properly test classes that use global functions. Instead of being declared globally, such variables and functions should be moved into a class, potentially marked static, so they can be used without a class instance. This rule checks that only object-oriented programming is used and that no functions or procedures are declared outside of a class. Noncompliant code example &lt;?php $name = \"Bob\"; // Noncompliant function doSomething($arg) { // Noncompliant //... } class MyClass { //... } Compliant solution &lt;?php class MyClass { public static $name = \"Bob\"; // Compliant public static function doSomething($arg) { // Compliant //... } //... }",
  "url": "https://rules.sonarsource.com/php/rspec-2007/"
},
{
  "title": "\"&&\" and \"||\" should be used",
  "description": "Boolean operators are used to combine conditional statements based on their value. In PHP, there are two different sets of operators to use for AND and OR: &amp;&amp; / || and / or The difference between these sets is the precedence, which specifies how \"tightly\" two expressions are bound together. Because and / or have a lower precedence than almost any other operator, using them instead of &amp;&amp; / || may not have the result you expect. Noncompliant code example In both cases, the assignment has a higher precedence over the boolean operation. $resultAnd = true and false; // Noncompliant: $resultAnd == true $resultOr = false or true; // Noncompliant: $resultOr == false Compliant solution $resultAnd = true &amp;&amp; false; // $resultAnd == false $resultOr = false || true; // $resultOr == true",
  "url": "https://rules.sonarsource.com/php/rspec-2010/"
},
{
  "title": "\"global\" should not be used",
  "description": "Global variables are a useful construct, but they should not be abused. Functions can access the global scope either through the global keyword or though the $GLOBALS array, but these practices considerably reduce the function’s readability and reusability. Instead, the global variable should be passed as a parameter to the function. Noncompliant code example $myGlobalVariable; function foo() { global $myGlobalVariable; // Noncompliant $GLOBALS['myGlobalVariable']; // Noncompliant // ... } Compliant solution function foo($myStateVariable) { // ... }",
  "url": "https://rules.sonarsource.com/php/rspec-2011/"
},
{
  "title": "\"$this\" should not be used in a static context",
  "description": "To reference the current class instance the keyword $this can be used. Through the use of this keyword you have access to class properties and methods. Static methods can be accessed without instantiating the class, so $this is not available for them. Using $this in a static context will result in a runtime error.",
  "url": "https://rules.sonarsource.com/php/rspec-2014/"
},
{
  "title": "Files that define symbols should not cause side-effects",
  "description": "Files that define symbols such as classes and variables may be included into many files. Simply performing that inclusion should have no effect on those files other than declaring new symbols. For instance, a file containing a class definition should not also contain side-effects such as print statements that will be evaluated automatically on inclusion. Logic should be segregated into symbol-only files and side-effect-only files. The type of operation which is not allowed in a symbol-definition file includes but is not limited to: generating output modifying ini settings emitting errors or exceptions modifying global or static variables reading/writing files Noncompliant code example &lt;?php print \"Include worked!\"; class foo { // ... } Compliant solution &lt;?php class foo { public function log() { print \"Include worked!\"; } }",
  "url": "https://rules.sonarsource.com/php/rspec-2036/"
},
{
  "title": "Static members should be referenced with \"static::\"",
  "description": "References in a class to static class members (fields or methods) can be made using either self::$var or static::$var (introduced in 5.3). The difference between the two is one of scope. Confusingly, in subclasses, the use of self:: references the original definition of the member, i.e. the superclass version, rather than any override at the subclass level. static::, on the other hand, references the class that was called at runtime. Noncompliant code example &lt;?php class Toy { public static function status() { self::getStatus(); // Noncompliant; will always print \"Sticks are fun!\" even when called from a subclass which overrides this method; } protected static function getStatus() { echo \"Sticks are fun!\"; } } class Ball extends Toy { protected static function getStatus() { // Doesn't actually get called echo \"Balls are fun!\"; } } $myBall = new Ball(); $myBall::status(); // Prints \"Sticks are fun!\" Compliant solution &lt;?php class Toy { public static function status() { static::getStatus(); // Compliant } protected static function getStatus() { echo \"Sticks are fun!\"; } } class Ball extends Toy { protected static function getStatus() { echo \"Balls are fun!\"; } } $myBall = new Ball(); $myBall::status(); // Prints \"Balls are fun!\" Exceptions No issue is raised when self is used on a constant field, a private field or a private method. class A { private static $somevar = \"hello\"; const CONSTANT = 42; private static function foo() { $var = self::$somevar . self::CONSTANT; // Should be OK self::foo(); // Should be OK } }",
  "url": "https://rules.sonarsource.com/php/rspec-2037/"
},
{
  "title": "Colors should be defined in upper case",
  "description": "Shared coding conventions allow teams to collaborate effectively. Writing colors in upper case makes them stand out at such, thereby making the code easier to read. This rule checks that hexadecimal color definitions are written in upper case. Noncompliant code example $white = '#ffffff'; // Noncompliant $dkgray = '#006400'; $aqua = '#00ffff'; // Noncompliant Compliant solution $white = '#FFFFFF'; // Compliant $dkgray = '#006400'; $aqua = '#00FFFF'; // Compliant",
  "url": "https://rules.sonarsource.com/php/rspec-2038/"
},
{
  "title": "Parentheses should not be used for calls to \"echo\"",
  "description": "This rule is deprecated; use S6600 instead.",
  "url": "https://rules.sonarsource.com/php/rspec-2041/"
},
{
  "title": "Classes should not have too many lines of code",
  "description": "A class that grows too much tends to aggregate too many responsibilities, and inevitably becomes harder to understand and to maintain. Above a specific threshold, it is strongly advised to refactor the class into smaller ones which focus on well-defined topics.",
  "url": "https://rules.sonarsource.com/php/rspec-2042/"
},
{
  "title": "Superglobals should not be accessed directly",
  "description": "Superglobal variables are predefined variables available in all scopes throughout a script. However, accessing them directly is considered bad practice. Instead, they should be accessed through an object or framework that handles sanitation and validation. Noncompliant code example $name = $_POST['name']; Compliant solution $name = $this-&gt;params()-&gt;fromPost('name');",
  "url": "https://rules.sonarsource.com/php/rspec-2043/"
},
{
  "title": "\"php_sapi_name()\" should not be used",
  "description": "Both php_sapi_name() and the PHP_SAPI constant give the same value. But calling the method is less efficient that simply referencing the constant. Noncompliant code example if (php_sapi_name() == 'test') { ... } Compliant solution if (PHP_SAPI == 'test') { ... }",
  "url": "https://rules.sonarsource.com/php/rspec-2044/"
},
{
  "title": "Perl-style comments should not be used",
  "description": "Shared coding conventions allow teams to collaborate effectively. This rule flags all Perl-style comments. Noncompliant code example $myvar; # Noncompliant; this comment should have started with \"//\" Compliant solution $myvar; // Compliant; this comment started with \"//\"",
  "url": "https://rules.sonarsource.com/php/rspec-2046/"
},
{
  "title": "The names of methods with boolean return values should start with \"is\" or \"has\"",
  "description": "Well-named functions can allow the users of your code to understand at a glance what to expect from the function - even before reading the documentation. Toward that end, methods returning a boolean property should have names that start with \"is\" or \"has\" rather than with \"get\". Note that this rule will only apply to functions that are documented to return a boolean. Noncompliant code example /** * @return boolean */ public function getFoo() // Noncompliant { return foo; } Compliant solution /** * @return boolean */ public function isFoo() { return true; }",
  "url": "https://rules.sonarsource.com/php/rspec-2047/"
},
{
  "title": "Alias functions should not be used",
  "description": "Certain functions exist in PHP only as aliases of other functions. These aliases have been made available for backward compatibility, but should really be removed from code. This rule looks for uses of the following aliases: Alias Replacement chop rtrim close closedir doubleval floatval fputs fwrite ini_alter ini_set is_double is_float is_integer is_int is_long is_int is_real is_float is_writeable is_writable join implode key_exists array_key_exists magic_quotes_runtime set_magic_quotes_runtime pos current show_source highlight_file sizeof count strchr strstr Noncompliant code example $arr=array(\"apple\", \"pear\",\"banana\"); echo sizeof($arr); // Noncompliant Compliant solution $arr=array(\"apple\", \"pear\",\"banana\"); echo count($arr);",
  "url": "https://rules.sonarsource.com/php/rspec-2050/"
},
{
  "title": "Password hashing functions should use an unpredictable salt",
  "description": "This vulnerability increases the likelihood that attackers are able to compute the cleartext of password hashes.",
  "url": "https://rules.sonarsource.com/php/rspec-2053/"
},
{
  "title": "Hard-coded credentials are security-sensitive",
  "description": "Because it is easy to extract strings from an application source code or binary, credentials should not be hard-coded. This is particularly true for applications that are distributed or that are open-source. In the past, it has led to the following vulnerabilities: CVE-2019-13466 CVE-2018-15389 Credentials should be stored outside of the code in a configuration file, a database, or a management service for secrets. This rule flags instances of hard-coded credentials used in database and LDAP connections. It looks for hard-coded credentials in connection strings, and for variable names that match any of the patterns from the provided list. Ask Yourself Whether Credentials allow access to a sensitive component like a database, a file storage, an API or a service. Credentials are used in production environments. Application re-distribution is required before updating the credentials. There is a risk if you answered yes to any of those questions. Recommended Secure Coding Practices Store the credentials in a configuration file that is not pushed to the code repository. Store the credentials in a database. Use your cloud provider’s service for managing secrets. If a password has been disclosed through the source code: change it. Sensitive Code Example $password = \"65DBGgwe4uazdWQA\"; // Sensitive $httpUrl = \"https://example.domain?user=user&amp;password=65DBGgwe4uazdWQA\" // Sensitive $sshUrl = \"ssh://user:65DBGgwe4uazdWQA@example.domain\" // Sensitive Compliant Solution $user = getUser(); $password = getPassword(); // Compliant $httpUrl = \"https://example.domain?user=$user&amp;password=$password\" // Compliant $sshUrl = \"ssh://$user:$password@example.domain\" // Compliant See OWASP - Top 10 2021 Category A7 - Identification and Authentication Failures OWASP - Top 10 2017 Category A2 - Broken Authentication CWE - CWE-798 - Use of Hard-coded Credentials CWE - CWE-259 - Use of Hard-coded Password Derived from FindSecBugs rule Hard Coded Password",
  "url": "https://rules.sonarsource.com/php/rspec-2068/"
},
{
  "title": "SHA-1 and Message-Digest hash algorithms should not be used in secure contexts",
  "description": "This rule is deprecated; use S4790 instead.",
  "url": "https://rules.sonarsource.com/php/rspec-2070/"
},
{
  "title": "OS commands should not be vulnerable to command injection attacks",
  "description": "OS command injections occur when applications build command lines from untrusted data before executing them with a system shell. In that case, an attacker can tamper with the command line construction and force the execution of unexpected commands. This can lead to the compromise of the underlying operating system. What is the potential impact? An attacker exploiting an OS command injection vulnerability will be able to execute arbitrary commands on the underlying operating system. The impact depends on the access control measures taken on the target system OS. In the worst-case scenario, the process runs with root privileges, and therefore any OS commands or programs may be affected. Below are some real-world scenarios that illustrate some impacts of an attacker exploiting the vulnerability. Denial of service and data leaks In this scenario, the attack aims to disrupt the organization’s activities and profit from data leaks. An attacker could, for example: download the internal server’s data, most likely to sell it modify data, send malware stop services or exhaust resources (with fork bombs for example) This threat is particularly insidious if the attacked organization does not maintain a disaster recovery plan (DRP). Root privilege escalation and pivot In this scenario, the attacker can do everything described in the previous section. The difference is that the attacker also manages to elevate their privileges to an administrative level and attacks other servers. Here, the impact depends on how much the target company focuses on its Defense In Depth. For example, the entire infrastructure can be compromised by a combination of OS injections and misconfiguration of: Docker or Kubernetes clusters cloud services network firewalls and routing OS access control",
  "url": "https://rules.sonarsource.com/php/rspec-2076/"
},
{
  "title": "Formatting SQL queries is security-sensitive",
  "description": "Formatted SQL queries can be difficult to maintain, debug and can increase the risk of SQL injection when concatenating untrusted values into the query. However, this rule doesn’t detect SQL injections (unlike rule S3649), the goal is only to highlight complex/formatted queries. Ask Yourself Whether Some parts of the query come from untrusted values (like user inputs). The query is repeated/duplicated in other parts of the code. The application must support different types of relational databases. There is a risk if you answered yes to any of those questions. Recommended Secure Coding Practices Use parameterized queries, prepared statements, or stored procedures and bind variables to SQL query parameters. Consider using ORM frameworks if there is a need to have an abstract layer to access data. Sensitive Code Example $id = $_GET['id']; mysql_connect('localhost', $username, $password) or die('Could not connect: ' . mysql_error()); mysql_select_db('myDatabase') or die('Could not select database'); $result = mysql_query(\"SELECT * FROM myTable WHERE id = \" . $id); // Sensitive, could be susceptible to SQL injection while ($row = mysql_fetch_object($result)) { echo $row-&gt;name; } Compliant Solution $id = $_GET['id']; try { $conn = new PDO('mysql:host=localhost;dbname=myDatabase', $username, $password); $conn-&gt;setAttribute(PDO::ATTR_ERRMODE, PDO::ERRMODE_EXCEPTION); $stmt = $conn-&gt;prepare('SELECT * FROM myTable WHERE id = :id'); $stmt-&gt;execute(array('id' =&gt; $id)); while($row = $stmt-&gt;fetch(PDO::FETCH_OBJ)) { echo $row-&gt;name; } } catch(PDOException $e) { echo 'ERROR: ' . $e-&gt;getMessage(); } Exceptions No issue will be raised if one of the functions is called with hard-coded string (no concatenation) and this string does not contain a \"$\" sign. $result = mysql_query(\"SELECT * FROM myTable WHERE id = 42\") or die('Query failed: ' . mysql_error()); // Compliant The current implementation does not follow variables. It will only detect SQL queries which are concatenated or contain a $ sign directly in the function call. $query = \"SELECT * FROM myTable WHERE id = \" . $id; $result = mysql_query($query); // No issue will be raised even if it is Sensitive See OWASP - Top 10 2021 Category A3 - Injection OWASP - Top 10 2017 Category A1 - Injection CWE - CWE-20 - Improper Input Validation CWE - CWE-89 - Improper Neutralization of Special Elements used in an SQL Command Derived from FindSecBugs rules Potential SQL/JPQL Injection (JPA), Potential SQL/JDOQL Injection (JDO), Potential SQL/HQL Injection (Hibernate)",
  "url": "https://rules.sonarsource.com/php/rspec-2077/"
},
{
  "title": "LDAP queries should not be vulnerable to injection attacks",
  "description": "LDAP injections occur in an application when the application retrieves untrusted data and inserts it into an LDAP query without sanitizing it first. An LDAP injection can either be basic or blind, depending on whether the server’s fetched data is directly returned in the web application’s response. The absence of the corresponding response for the malicious request on the application is not a barrier to exploitation. Thus, it must be treated the same way as basic LDAP injections. What is the potential impact? In the context of a web application vulnerable to LDAP injection: after discovering the injection point, attackers insert data into the vulnerable field to execute malicious LDAP commands. The impact of this vulnerability depends on how vital LDAP servers are to the organization. Below are some real-world scenarios that illustrate some impacts of an attacker exploiting the vulnerability. Data leakage or corruption In typical scenarios where systems perform innocuous LDAP operations to find users or create inventories, an LDAP injection could result in data leakage or corruption. Privilege escalation A malicious LDAP query could allow an attacker to impersonate a low-privileged user or an administrator in scenarios where systems perform authorization checks or authentication. Attackers use this vulnerability to find multiple footholds on target organizations by gathering authentication bypasses.",
  "url": "https://rules.sonarsource.com/php/rspec-2078/"
},
{
  "title": "I/O function calls should not be vulnerable to path injection attacks",
  "description": "Path injections occur when an application uses untrusted data to construct a file path and access this file without validating its path first. A user with malicious intent would inject specially crafted values, such as ../, to change the initial intended path. The resulting path would resolve somewhere in the filesystem where the user should not normally have access to. What is the potential impact? A web application is vulnerable to path injection and an attacker is able to exploit it. The files that can be affected are limited by the permission of the process that runs the application. Worst case scenario: the process runs with root privileges on Linux, and therefore any file can be affected. Below are some real-world scenarios that illustrate some impacts of an attacker exploiting the vulnerability. Override or delete arbitrary files The injected path component tampers with the location of a file the application is supposed to delete or write into. The vulnerability is exploited to remove or corrupt files that are critical for the application or for the system to work properly. It could result in data being lost or the application being unavailable. Read arbitrary files The injected path component tampers with the location of a file the application is supposed to read and output. The vulnerability is exploited to leak the content of arbitrary files from the file system, including sensitive files like SSH private keys.",
  "url": "https://rules.sonarsource.com/php/rspec-2083/"
},
{
  "title": "XPath expressions should not be vulnerable to injection attacks",
  "description": "XPath injections occur in an application when the application retrieves untrusted data and inserts it into an XML Path (XPath) query without sanitizing it first. What is the potential impact? In the context of a web application vulnerable to XPath injection: After discovering the injection point, attackers insert data into the vulnerable field to execute malicious commands in the affected XML documents. The impact of this vulnerability depends on the importance of XML structures in the enterprise. In cases where organizations rely on XML structures for business-critical operations or where XML is used only for innocuous data transport, the severity of an attack ranges from critical to harmless. Below are some real-world scenarios that illustrate some impacts of an attacker exploiting the vulnerability. Data Leaks A malicious XPath query allows direct data leakage from one or more databases. Although XML is not as widely used as it once was, this possibility still exists with configuration files, for example. Data deletion and denial of service The malicious query allows the attacker to delete data in the affected XML documents. This threat is particularly insidious if the attacked organization does not maintain a disaster recovery plan (DRP) and if XML structures are considered important, as missing critical data can disrupt the regular operations of an organization.",
  "url": "https://rules.sonarsource.com/php/rspec-2091/"
},
{
  "title": "Creating cookies without the \"secure\" flag is security-sensitive",
  "description": "When a cookie is protected with the secure attribute set to true it will not be send by the browser over an unencrypted HTTP request and thus cannot be observed by an unauthorized person during a man-in-the-middle attack. Ask Yourself Whether the cookie is for instance a session-cookie not designed to be sent over non-HTTPS communication. it’s not sure that the website contains mixed content or not (ie HTTPS everywhere or not) There is a risk if you answered yes to any of those questions. Recommended Secure Coding Practices It is recommended to use HTTPs everywhere so setting the secure flag to true should be the default behaviour when creating cookies. Set the secure flag to true for session-cookies. Sensitive Code Example In php.ini you can specify the flags for the session cookie which is security-sensitive: session.cookie_secure = 0; // Sensitive: this security-sensitive session cookie is created with the secure flag set to false (cookie_secure = 0) Same thing in PHP code: session_set_cookie_params($lifetime, $path, $domain, false); // Sensitive: this security-sensitive session cookie is created with the secure flag (the fourth argument) set to _false_ If you create a custom security-sensitive cookie in your PHP code: $value = \"sensitive data\"; setcookie($name, $value, $expire, $path, $domain, false); // Sensitive: a security-sensitive cookie is created with the secure flag (the sixth argument) set to _false_ By default setcookie and setrawcookie functions set the sixth argument / secure flag to false: $value = \"sensitive data\"; setcookie($name, $value, $expire, $path, $domain); // Sensitive: a security-sensitive cookie is created with the secure flag (the sixth argument) not defined (by default to false) setrawcookie($name, $value, $expire, $path, $domain); // Sensitive: a security-sensitive cookie is created with the secure flag (the sixth argument) not defined (by default to false) Compliant Solution session.cookie_secure = 1; // Compliant: the sensitive cookie will not be send during an unencrypted HTTP request thanks to cookie_secure property set to 1 session_set_cookie_params($lifetime, $path, $domain, true); // Compliant: the sensitive cookie will not be send during an unencrypted HTTP request thanks to the secure flag (the fouth argument) set to true $value = \"sensitive data\"; setcookie($name, $value, $expire, $path, $domain, true); // Compliant: the sensitive cookie will not be send during an unencrypted HTTP request thanks to the secure flag (the sixth argument) set to true setrawcookie($name, $value, $expire, $path, $domain, true);// Compliant: the sensitive cookie will not be send during an unencrypted HTTP request thanks to the secure flag (the sixth argument) set to true See OWASP - Top 10 2021 Category A4 - Insecure Design OWASP - Top 10 2021 Category A5 - Security Misconfiguration OWASP - Top 10 2017 Category A3 - Sensitive Data Exposure CWE - CWE-311 - Missing Encryption of Sensitive Data CWE - CWE-315 - Cleartext Storage of Sensitive Information in a Cookie CWE - CWE-614 - Sensitive Cookie in HTTPS Session Without 'Secure' Attribute STIG Viewer - Application Security and Development: V-222576 - The application must set the secure flag on session cookies.",
  "url": "https://rules.sonarsource.com/php/rspec-2092/"
},
{
  "title": "A secure password should be used when connecting to a database",
  "description": "When accessing a database, an empty password should be avoided as it introduces a weakness.",
  "url": "https://rules.sonarsource.com/php/rspec-2115/"
},
{
  "title": "Values should not be uselessly incremented",
  "description": "A value that is incremented or decremented and then not stored is at best wasted code and at worst a bug. Noncompliant code example $i = 0; $i = $i++; // Noncompliant; i is still zero Compliant solution $i = 0; $i++;",
  "url": "https://rules.sonarsource.com/php/rspec-2123/"
},
{
  "title": "Classes named like \"Exception\" should extend \"Exception\" or a subclass",
  "description": "Clear, communicative naming is important in code. It helps maintainers and API users understand the intentions for and uses of a unit of code. Using \"exception\" in the name of a class that does not extend Exception or one of its subclasses is a clear violation of the expectation that a class' name will indicate what it is and/or does. Noncompliant code example class FruitException { // Noncompliant; this has nothing to do with Exception private $expected; private $unusualCharacteristics; private $appropriateForCommercialExploitation; // ... } class CarException { // Noncompliant; the extends clause was forgotten? public function __construct(string message, Throwable cause) { // ... Compliant solution class FruitSport { private $expected; private $unusualCharacteristics; private $appropriateForCommercialExploitation; // ... } class CarException extends Exception { public function __construct(string message, Throwable cause) { // ...",
  "url": "https://rules.sonarsource.com/php/rspec-2166/"
},
{
  "title": "TestCases should contain tests",
  "description": "There’s no point in having a PHPUnit test case without any test methods. Similarly, you shouldn’t have a file in the tests directory which extends PHPUnit\\Framework\\TestCase but no tests in the file. Doing either of these things may lead someone to think that uncovered classes have been tested. Add some test method or make the class abstract if it is used by a real test case class. Noncompliant code example use PHPUnit\\Framework\\TestCase; class MyTest extends TestCase { protected function setUp() { doSomethind(); } private function doSomethind() { //... } } Compliant solution use PHPUnit\\Framework\\TestCase; class MyTest extends TestCase { public function testBehaviour() { //... } //... } // or abstract class MyAbstractTest extends TestCase { protected function setUp() { doSomethind(); } private function doSomethind() { //... } }",
  "url": "https://rules.sonarsource.com/php/rspec-2187/"
},
{
  "title": "Return values from functions without side effects should not be ignored",
  "description": "When the call to a function doesn’t have any side effect, what is the point of making the call if the results are ignored? In such cases, either the function call is useless and should be dropped, or the source code doesn’t behave as expected. Noncompliant code example strlen($name); // Noncompliant; \"strlen\" has no side effect Compliant solution $length = strlen($name);",
  "url": "https://rules.sonarsource.com/php/rspec-2201/"
},
{
  "title": "Parameters should be passed in the correct order",
  "description": "When the names of parameters in a method call match the names of the method arguments, it contributes to clearer, more readable code. However, when the names match, but are passed in a different order than the method arguments, it indicates a mistake in the parameter order which will likely lead to unexpected results. Noncompliant code example public function divide($divisor, $dividend) { return $divisor/$dividend; } public function doTheThing() { $divisor = 15; $dividend = 5; $result = $this-&gt;divide($dividend, $divisor); // Noncompliant; operation succeeds, but result is unexpected } Compliant solution public function divide($divisor, $dividend) { return $divisor/$dividend; } public function doTheThing() { $divisor = 15; $dividend = 5; $result = $this-&gt;divide($divisor, $dividend); // Compliant }{code} h4.",
  "url": "https://rules.sonarsource.com/php/rspec-2234/"
},
{
  "title": "Using pseudorandom number generators (PRNGs) is security-sensitive",
  "description": "PRNGs are algorithms that produce sequences of numbers that only approximate true randomness. While they are suitable for applications like simulations or modeling, they are not appropriate for security-sensitive contexts because their outputs can be predictable if the internal state is known. In contrast, cryptographically secure pseudorandom number generators (CSPRNGs) are designed to be secure against prediction attacks. CSPRNGs use cryptographic algorithms to ensure that the generated sequences are not only random but also unpredictable, even if part of the sequence or the internal state becomes known. This unpredictability is crucial for security-related tasks such as generating encryption keys, tokens, or any other values that must remain confidential and resistant to guessing attacks. For example, the use of non-cryptographic PRNGs has led to vulnerabilities such as: CVE-2013-6386 CVE-2006-3419 CVE-2008-4102 When software generates predictable values in a context requiring unpredictability, it may be possible for an attacker to guess the next value that will be generated, and use this guess to impersonate another user or access sensitive information. Therefore, it is critical to use CSPRNGs in any security-sensitive application to ensure the robustness and security of the system. As the rand() and mt_rand() functions are no CSPRNGs, they should not be used for security-critical applications or for protecting sensitive data. Ask Yourself Whether the code using the generated value requires it to be unpredictable. It is the case for all encryption mechanisms or when a secret value, such as a password, is hashed. the function you use is a non-cryptographic PRNG. the generated value is used multiple times. an attacker can access the generated value. There is a risk if you answered yes to any of those questions. Recommended Secure Coding Practices Use functions which rely on a cryptographically secure pseudo random number generator (CSPRNG) such as random_int() or random_bytes() or openssl_random_pseudo_bytes(). When using openssl_random_pseudo_bytes(), provide and check the crypto_strong parameter. Use the generated random values only once. You should not expose the generated random value. If you have to store it, make sure that the database or file is secure. Sensitive Code Example $random = rand(); // Sensitive $random2 = mt_rand(0, 99); // Sensitive Compliant Solution $randomInt = random_int(0,99); See OWASP - Secure Random Number Generation Cheat Sheet OWASP - Top 10 2021 Category A2 - Cryptographic Failures OWASP - Top 10 2017 Category A3 - Sensitive Data Exposure CWE - CWE-338 - Use of Cryptographically Weak Pseudo-Random Number Generator (PRNG) CWE - CWE-330 - Use of Insufficiently Random Values CWE - CWE-326 - Inadequate Encryption Strength CWE - CWE-1241 - Use of Predictable Algorithm in Random Number Generator",
  "url": "https://rules.sonarsource.com/php/rspec-2245/"
},
{
  "title": "A \"for\" loop update clause should move the counter in the right direction",
  "description": "A for loop with a counter that moves in the wrong direction, away from the stop condition, is not an infinite loop. Because of wraparound, the loop will eventually reach its stop condition, but in doing so, it will probably run more times than anticipated, potentially causing unexpected behavior.",
  "url": "https://rules.sonarsource.com/php/rspec-2251/"
},
{
  "title": "Writing cookies is security-sensitive",
  "description": "This rule is deprecated, and will eventually be removed. Using cookies is security-sensitive. It has led in the past to the following vulnerabilities: CVE-2018-11639 CVE-2016-6537 Attackers can use widely-available tools to read cookies. Any sensitive information they may contain will be exposed. This rule flags code that writes cookies. Ask Yourself Whether sensitive information is stored inside the cookie. You are at risk if you answered yes to this question. Recommended Secure Coding Practices Cookies should only be used to manage the user session. The best practice is to keep all user-related information server-side and link them to the user session, never sending them to the client. In a very few corner cases, cookies can be used for non-sensitive information that need to live longer than the user session. Do not try to encode sensitive information in a non human-readable format before writing them in a cookie. The encoding can be reverted and the original information will be exposed. Using cookies only for session IDs doesn’t make them secure. Follow OWASP best practices when you configure your cookies. As a side note, every information read from a cookie should be Sanitized. Sensitive Code Example $value = \"1234 1234 1234 1234\"; // Review this cookie as it seems to send sensitive information (credit card number). setcookie(\"CreditCardNumber\", $value, $expire, $path, $domain, true, true); // Sensitive setrawcookie(\"CreditCardNumber\", $value, $expire, $path, $domain, true, true); // Sensitive See OWASP - Top 10 2017 Category A3 - Sensitive Data Exposure CWE - CWE-312 - Cleartext Storage of Sensitive Information CWE - CWE-315 - Cleartext Storage of Sensitive Information in a Cookie Derived from FindSecBugs rule COOKIE_USAGE",
  "url": "https://rules.sonarsource.com/php/rspec-2255/"
},
{
  "title": "PHP parser failure",
  "description": "When the PHP parser fails, it is possible to record the failure as a violation on the file. This way, not only it is possible to track the number of files that do not parse but also to easily find out why they do not parse.",
  "url": "https://rules.sonarsource.com/php/rspec-2260/"
},
{
  "title": "Cryptographic RSA algorithms should always incorporate OAEP (Optimal Asymmetric Encryption Padding)",
  "description": "This rule is deprecated; use S5542 instead.",
  "url": "https://rules.sonarsource.com/php/rspec-2277/"
},
{
  "title": "Neither DES (Data Encryption Standard) nor DESede (3DES) should be used",
  "description": "This rule is deprecated; use S5547 instead.",
  "url": "https://rules.sonarsource.com/php/rspec-2278/"
},
{
  "title": "Setting loose POSIX file permissions is security-sensitive",
  "description": "In Unix file system permissions, the \"others\" category refers to all users except the owner of the file system resource and the members of the group assigned to this resource. Granting permissions to this category can lead to unintended access to files or directories that could allow attackers to obtain sensitive information, disrupt services or elevate privileges. Ask Yourself Whether The application is designed to be run on a multi-user environment. Corresponding files and directories may contain confidential information. There is a risk if you answered yes to any of those questions. Recommended Secure Coding Practices The most restrictive possible permissions should be assigned to files and directories. Sensitive Code Example chmod(\"foo\", 0777); // Sensitive umask(0); // Sensitive umask(0750); // Sensitive For Symfony Filesystem: use Symfony\\Component\\Filesystem\\Filesystem; $fs = new Filesystem(); $fs-&gt;chmod(\"foo\", 0777); // Sensitive For Laravel Filesystem: use Illuminate\\Filesystem\\Filesystem; $fs = new Filesystem(); $fs-&gt;chmod(\"foo\", 0777); // Sensitive Compliant Solution chmod(\"foo\", 0750); // Compliant umask(0027); // Compliant For Symfony Filesystem: use Symfony\\Component\\Filesystem\\Filesystem; $fs = new Filesystem(); $fs-&gt;chmod(\"foo\", 0750); // Compliant For Laravel Filesystem: use Illuminate\\Filesystem\\Filesystem; $fs = new Filesystem(); $fs-&gt;chmod(\"foo\", 0750); // Compliant See OWASP - Top 10 2021 Category A1 - Broken Access Control OWASP - Top 10 2021 Category A4 - Insecure Design OWASP - Top 10 2017 Category A5 - Broken Access Control OWASP File Permission CWE - CWE-732 - Incorrect Permission Assignment for Critical Resource CWE - CWE-266 - Incorrect Privilege Assignment STIG Viewer - Application Security and Development: V-222430 - The application must execute without excessive account permissions.",
  "url": "https://rules.sonarsource.com/php/rspec-2612/"
},
{
  "title": "Regular expressions should not be vulnerable to Denial of Service attacks",
  "description": "Regular expression injections occur when the application retrieves untrusted data and uses it as a regex to pattern match a string with it. Most regular expression search engines use backtracking to try all possible regex execution paths when evaluating an input. Sometimes this can lead to performance problems also referred to as catastrophic backtracking situations. What is the potential impact? In the context of a web application vulnerable to regex injection: After discovering the injection point, attackers insert data into the vulnerable field to make the affected component inaccessible. Depending on the application’s software architecture and the injection point’s location, the impact may or may not be visible. Below are some real-world scenarios that illustrate some impacts of an attacker exploiting the vulnerability. Self Denial of Service In cases where the complexity of the regular expression is exponential to the input size, a small, carefully-crafted input (for example, 20 chars) can trigger catastrophic backtracking and cause a denial of service of the application. Super-linear regex complexity can produce the same effects for a large, carefully crafted input (thousands of chars). If the component jeopardized by this vulnerability is not a bottleneck that acts as a single point of failure (SPOF) within the application, the denial of service might only affect the attacker who initiated it. Such benign denial of service can also occur in architectures that rely heavily on containers and container orchestrators. Replication systems would detect the failure of a container and automatically replace it. Infrastructure SPOFs However, a denial of service attack can be critical to the enterprise if it targets a SPOF component. Sometimes the SPOF is a software architecture vulnerability (such as a single component on which multiple critical components depend) or an operational vulnerability (for example, insufficient container creation capabilities or failures from containers to terminate). In either case, attackers aim to exploit the infrastructure weakness by sending as many malicious payloads as possible, using potentially huge offensive infrastructures. These threats are particularly insidious if the attacked organization does not maintain a disaster recovery plan (DRP).",
  "url": "https://rules.sonarsource.com/php/rspec-2631/"
},
{
  "title": "Multiline blocks should be enclosed in curly braces",
  "description": "Having inconsistent indentation and omitting curly braces from a control structure, such as an if statement or for loop, is misleading and can induce bugs. This rule raises an issue when the indentation of the lines after a control structure indicates an intent to include those lines in the block, but the omission of curly braces means the lines will be unconditionally executed once. The following patterns are recognized: if ($condition) firstActionInBlock(); secondAction(); // Noncompliant: secondAction is executed unconditionally thirdAction(); if($condition) firstActionInBlock(); secondAction(); // Noncompliant: secondAction is executed unconditionally if($condition) firstActionInBlock(); // Noncompliant secondAction(); // Executed unconditionally $str = null; for ($i = 0; $i &lt; count($array); $i++) $str = $array[$i]; doTheThing($str); // Noncompliant: executed only on the last element Note that this rule considers tab characters to be equivalent to 1 space. When mixing spaces and tabs, a code may look fine in one editor but be confusing in another configured differently.",
  "url": "https://rules.sonarsource.com/php/rspec-2681/"
},
{
  "title": "Tests should include assertions",
  "description": "A test case without assertions ensures only that no exceptions are thrown. Beyond basic runnability, it ensures nothing about the behavior of the code under test. This rule raised an issue when no assertions are found within a PHPUnit test method. Noncompliant code example public function testDoSomething() { // Compliant $myClass = new MyClass(); $myClass-&gt;getSomething(); } Compliant solution public function testDoSomething() { // Noncompliant $myClass = new MyClass(); $this-&gt;assertEquals(\"foo\", $myClass-&gt;getSomething()); }",
  "url": "https://rules.sonarsource.com/php/rspec-2699/"
},
{
  "title": "Literal boolean values and nulls should not be used in equality assertions",
  "description": "Instead of using boolean literals or null in an equality with assertSame() or assertEquals(), it is recommended to rely on the alternative functions assertTrue(), assertFalse(), assertNull(), and assertNotNull(). Noncompliant code example assertEquals(true, $x); // Noncompliant {{Use assertTrue() instead.}} assertNotEquals(false, $x); // Noncompliant {{Use assertTrue() instead.}} assertSame(null, $x); // Noncompliant {{Use assertNull() instead.}} assertNotSame(true, $x); // Noncompliant {{Use assertFalse() instead.}} Compliant solution assertTrue($x); // Compliant assertFalse($x); // Compliant assertNull($x); // Compliant assertNotNull($x); // Compliant",
  "url": "https://rules.sonarsource.com/php/rspec-2701/"
},
{
  "title": "\"catch\" clauses should do more than rethrow",
  "description": "A catch clause that only rethrows the caught exception has the same effect as omitting the catch altogether and letting it bubble up automatically. $s = \"\"; try { $s = readMyFile($fileName); } catch (Exception $e) { throw $e; // Noncompliant } Such clauses should either be removed or populated with the appropriate logic. $s = readMyFile($fileName); or $s = \"\"; try { $s = readMyFile($fileName); } catch (Exception $e) { error_log($e-&gt;getMessage()); throw new MyException(\"an exception occurred\", 2, $e); }",
  "url": "https://rules.sonarsource.com/php/rspec-2737/"
},
{
  "title": "XML parsers should not be vulnerable to XXE attacks",
  "description": "This vulnerability allows the usage of external entities in XML.",
  "url": "https://rules.sonarsource.com/php/rspec-2755/"
},
{
  "title": "Non-existent operators like \"=+\" should not be used",
  "description": "Using operator pairs (=+, =-, or =!) that look like reversed single operators (+=, -= or !=) is confusing. They compile and run but do not produce the same result as their mirrored counterpart. $target = -5; $num = 3; $target =- $num; // Noncompliant: target = -3. Is that the expected behavior? $target =+ $num; // Noncompliant: target = 3 This rule raises an issue when =+, =-, or =! are used without any space between the operators and when there is at least one whitespace after. Replace the operators with a single one if that is the intention $target = -5; $num = 3; $target -= $num; // target = -8 Or fix the spacing to avoid confusion $target = -5; $num = 3; $target = -$num; // target = -3",
  "url": "https://rules.sonarsource.com/php/rspec-2757/"
},
{
  "title": "Unary prefix operators should not be repeated",
  "description": "The repetition of a prefix operator (!, or ~) is usually a typo. The second operator invalidates the first one: $a = false; $b = ~~$a; // Noncompliant: equivalent to \"$a\" While calling ! twice is equivalent to calling the boolval() function, the latter increases the code readability, so it should be preferred. $a = 0; $b = !!$a; // Noncompliant: equivalent to \"boolval($a)\"",
  "url": "https://rules.sonarsource.com/php/rspec-2761/"
},
{
  "title": "Class constructors should not create other objects",
  "description": "Dependency injection is a software design pattern in which one or more dependencies (or services) are injected, or passed by reference, into a dependent object (or client) and are made part of the client’s state. The pattern separates the creation of a client’s dependencies from its own behavior, which allows program designs to be loosely coupled and to follow the dependency inversion and single responsibility principles. Noncompliant code example class SomeClass { public function __construct() { $this-&gt;object = new SomeOtherClass(); // Noncompliant } } Compliant solution class SomeClass { public function __construct(SomeOtherClass $object) { $this-&gt;object = $object; } }",
  "url": "https://rules.sonarsource.com/php/rspec-2830/"
},
{
  "title": "Configuration should not be changed dynamically",
  "description": "ini_set changes the value of the given configuration option for the duration of the script’s execution. While there may be a reason to do this, you should make sure that it’s a very good reason indeed, because this is the sort of \"magic\" change which can cause severe teeth-gnashing and hair tearing when the script needs to be debugged. For instance, if the user explicitly turns logging on for a script, but then the script itself uses ini_set('display_errors', 0); to turn logging back off, it is likely that every other aspect of the environment will be examined before, in desperation, the script is read to figure out where the logging is going. Noncompliant code example ini_set('display_errors', 0); // Noncompliant",
  "url": "https://rules.sonarsource.com/php/rspec-2918/"
},
{
  "title": "\"sleep\" should not be called",
  "description": "This rule is deprecated, and will eventually be removed.",
  "url": "https://rules.sonarsource.com/php/rspec-2964/"
},
{
  "title": "Reflection should not be used to increase accessibility of classes, methods, or fields",
  "description": "Altering or bypassing the accessibility of classes, methods, or fields through reflection violates the encapsulation principle. This can break the internal contracts of the accessed target and lead to maintainability issues and runtime errors. This rule raises an issue when reflection is used to change the visibility of a class, method or field, and when it is used to directly update a field value. $reflectionMethod = new ReflectionMethod(MyClass::class, \"privateMethode\"); $reflectionMethod-&gt;setAccessible(true); $reflectionProperty = new ReflectionProperty(MyClass::class, \"privateProperty\"); $reflectionProperty-&gt;setAccessible(true);",
  "url": "https://rules.sonarsource.com/php/rspec-3011/"
},
{
  "title": "Creating cookies without the \"HttpOnly\" flag is security-sensitive",
  "description": "When a cookie is configured with the HttpOnly attribute set to true, the browser guaranties that no client-side script will be able to read it. In most cases, when a cookie is created, the default value of HttpOnly is false and it’s up to the developer to decide whether or not the content of the cookie can be read by the client-side script. As a majority of Cross-Site Scripting (XSS) attacks target the theft of session-cookies, the HttpOnly attribute can help to reduce their impact as it won’t be possible to exploit the XSS vulnerability to steal session-cookies. Ask Yourself Whether the cookie is sensitive, used to authenticate the user, for instance a session-cookie the HttpOnly attribute offer an additional protection (not the case for an XSRF-TOKEN cookie / CSRF token for example) There is a risk if you answered yes to any of those questions. Recommended Secure Coding Practices By default the HttpOnly flag should be set to true for most of the cookies and it’s mandatory for session / sensitive-security cookies. Sensitive Code Example In php.ini you can specify the flags for the session cookie which is security-sensitive: session.cookie_httponly = 0; // Sensitive: this sensitive session cookie is created with the httponly flag set to false and so it can be stolen easily in case of XSS vulnerability Same thing in PHP code: session_set_cookie_params($lifetime, $path, $domain, true, false); // Sensitive: this sensitive session cookie is created with the httponly flag (the fifth argument) set to false and so it can be stolen easily in case of XSS vulnerability If you create a custom security-sensitive cookie in your PHP code: $value = \"sensitive data\"; setcookie($name, $value, $expire, $path, $domain, true, false); // Sensitive: this sensitive cookie is created with the httponly flag (the seventh argument) set to false and so it can be stolen easily in case of XSS vulnerability By default setcookie and setrawcookie functions set httpOnly flag to false (the seventh argument) and so cookies can be stolen easily in case of XSS vulnerability: $value = \"sensitive data\"; setcookie($name, $value, $expire, $path, $domain, true); // Sensitive: a sensitive cookie is created with the httponly flag (the seventh argument) not defined (by default set to false) setrawcookie($name, $value, $expire, $path, $domain, true); // Sensitive: a sensitive cookie is created with the httponly flag (the seventh argument) not defined (by default set to false) Compliant Solution session.cookie_httponly = 1; // Compliant: the sensitive cookie is protected against theft thanks (cookie_httponly=1) session_set_cookie_params($lifetime, $path, $domain, true, true); // Compliant: the sensitive cookie is protected against theft thanks to the fifth argument set to true (HttpOnly=true) $value = \"sensitive data\"; setcookie($name, $value, $expire, $path, $domain, true, true); // Compliant: the sensitive cookie is protected against theft thanks to the seventh argument set to true (HttpOnly=true) setrawcookie($name, $value, $expire, $path, $domain, true, true); // Compliant: the sensitive cookie is protected against theft thanks to the seventh argument set to true (HttpOnly=true) See OWASP - Top 10 2021 Category A5 - Security Misconfiguration OWASP HttpOnly OWASP - Top 10 2017 Category A7 - Cross-Site Scripting (XSS) CWE - CWE-1004 - Sensitive Cookie Without 'HttpOnly' Flag Derived from FindSecBugs rule HTTPONLY_COOKIE STIG Viewer - Application Security and Development: V-222575 - The application must set the HTTPOnly flag on session cookies.",
  "url": "https://rules.sonarsource.com/php/rspec-3330/"
},
{
  "title": "Creating cookies with broadly defined \"domain\" flags is security-sensitive",
  "description": "This rule is deprecated, and will eventually be removed. A cookie’s domain specifies which websites should be able to read it. Left blank, browsers are supposed to only send the cookie to sites that exactly match the sending domain. For example, if a cookie was set by lovely.dream.com, it should only be readable by that domain, and not by nightmare.com or even strange.dream.com. If you want to allow sub-domain access for a cookie, you can specify it by adding a dot in front of the cookie’s domain, like so: .dream.com. But cookie domains should always use at least two levels. Cookie domains can be set either programmatically or via configuration. This rule raises an issue when any cookie domain is set with a single level, as in .com. Ask Yourself Whether the domain attribute has only one level as domain naming. You are at risk if you answered yes to any of those questions. Recommended Secure Coding Practices You should check the domain attribute has been set and its value has more than one level of domain nanimg, like: sonarsource.com Sensitive Code Example setcookie(\"TestCookie\", $value, time()+3600, \"/~path/\", \".com\", 1); // Noncompliant session_set_cookie_params(3600, \"/~path/\", \".com\"); // Noncompliant // inside php.ini session.cookie_domain=\".com\"; // Noncompliant Compliant Solution setcookie(\"TestCookie\", $value, time()+3600, \"/~path/\", \".myDomain.com\", 1); session_set_cookie_params(3600, \"/~path/\", \".myDomain.com\"); // inside php.ini session.cookie_domain=\".myDomain.com\"; See OWASP - Top 10 2017 Category A3 - Sensitive Data Exposure",
  "url": "https://rules.sonarsource.com/php/rspec-3331/"
},
{
  "title": "Session-management cookies should not be persistent",
  "description": "This rule is deprecated, and will eventually be removed.",
  "url": "https://rules.sonarsource.com/php/rspec-3332/"
},
{
  "title": "\"open_basedir\" should limit file access",
  "description": "When accessing files on the local filesystem, PHP can enforce security checks to defend against some attacks. The open_basedir setting in the main PHP configuration defines a set of directories that the application is allowed to access. Access to locations outside of these directories will be blocked.",
  "url": "https://rules.sonarsource.com/php/rspec-3333/"
},
{
  "title": "\"allow_url_fopen\" and \"allow_url_include\" should be disabled",
  "description": "File access functions in PHP are typically used to open local files. They are also capable of reading files from remote servers using protocols such as HTTP, HTTPS and FTP. This behavior is controlled by the allow_url_fopen and allow_url_include settings.",
  "url": "https://rules.sonarsource.com/php/rspec-3334/"
},
{
  "title": "\"cgi.force_redirect\" should be enabled",
  "description": "The cgi.force_redirect php.ini configuration controls the behavior of the PHP engine when used in CGI mode. In particular, it prevents CGI scripts from being directly requested without prior web server or application processing. When disabled, CGI scripts can be requested directly.",
  "url": "https://rules.sonarsource.com/php/rspec-3335/"
},
{
  "title": "\"session.use_trans_sid\" should not be enabled",
  "description": "PHP session tokens are normally transmitted through HTTP cookies. However, for clients that do not support cookies and when the PHP session.use_trans_sid setting is enabled, those tokens can be transmitted as URL parameters.",
  "url": "https://rules.sonarsource.com/php/rspec-3336/"
},
{
  "title": "\"enable_dl\" should be disabled",
  "description": "The enable_dl PHP configuration setting allows PHP extensions to be loaded dynamically at runtime.",
  "url": "https://rules.sonarsource.com/php/rspec-3337/"
},
{
  "title": "\"file_uploads\" should be disabled",
  "description": "This rule is deprecated, and will eventually be removed.",
  "url": "https://rules.sonarsource.com/php/rspec-3338/"
},
{
  "title": "Ternary operators should not be nested",
  "description": "Nested ternaries are hard to read and can make the order of operations complex to understand. function get_readable_status($is_running, $has_errors) { return $is_running ? \"Running\" : ($has_errors ? \"Failure\" : \"Succeeded\"); // Noncompliant } Instead, use another line to express the nested operation in a separate statement. function get_readable_status($is_running, $has_errors) { if ($is_running) { return \"Running\"; } return $has_errors ? \"Failure. \" : \"Succeeded \"; } Exceptions Exclusively chained shorthand ternary operators ?: are excluded from this rule. $result = $option1 ?: $option2 ?: 'default'; // Compliant by exception",
  "url": "https://rules.sonarsource.com/php/rspec-3358/"
},
{
  "title": "Test class names should end with \"Test\"",
  "description": "For better organization and clarity in test suites, test classes should end with *Test.php. This naming convention helps to easily identify and distinguish test classes from other classes in the codebase. It allows for automated test runners or frameworks to locate and execute the tests systematically. The PHPUnit command-line test runner will look for *Test.php files. In that case, test files without this pattern are ignored and not executed without warning. What is the potential impact? When tests are ignored or skipped, there can be several negative impacts on the development process and code quality. Firstly, ignoring tests can lead to undetected bugs and vulnerabilities, as the skipped tests are not being executed and their associated functionality is not being thoroughly tested. This increases the risk of releasing software with undiscovered issues. Furthermore, skipped tests can result in a false sense of confidence, as developers might assume that the code is functioning correctly without proper validation. This can lead to regression issues or unexpected behavior in the future when changes are made to the codebase.",
  "url": "https://rules.sonarsource.com/php/rspec-3360/"
},
{
  "title": "Assertion arguments should be passed in the correct order",
  "description": "The standard PHPUnit assertion methods such as __assertEquals__, expect the first argument to be the expected value and the second argument to be the actual value. What is the potential impact? Having the expected value and the actual value in the wrong order will not alter the outcome of tests, (succeed/fail when it should) but the error messages will contain misleading information. This rule raises an issue when the actual argument to an assertions library method is a hard-coded value and the expected argument is not.",
  "url": "https://rules.sonarsource.com/php/rspec-3415/"
},
{
  "title": "Jump statements should not be redundant",
  "description": "Jump statements, such as return, goto, and continue let you change the default flow of program execution, but jump statements that direct the control flow to the original direction are just a waste of keystrokes. Noncompliant code example function foo($p) { $i = $p; while ($i &gt; 0) { $i--; continue; // Noncompliant } } Compliant solution function foo($p) { $i = $p; while ($i &gt; 0) { $i--; } }",
  "url": "https://rules.sonarsource.com/php/rspec-3626/"
},
{
  "title": "Database queries should not be vulnerable to injection attacks",
  "description": "Database injections (such as SQL injections) occur in an application when the application retrieves data from a user or a third-party service and inserts it into a database query without sanitizing it first. If an application contains a database query that is vulnerable to injections, it is exposed to attacks that target any database where that query is used. A user with malicious intent is able to modify the existing query to change its logic to a malicious one. After creating the malicious request, the attacker can attack the databases affected by this vulnerability without relying on any pre-requisites. What is the potential impact? In the context of a web application that is vulnerable to SQL injection: After discovering the injection, attackers inject data into the vulnerable field to execute malicious commands in the affected databases. Below are some real-world scenarios that illustrate some impacts of an attacker exploiting the vulnerability. Identity spoofing and data manipulation A malicious database query enables privilege escalation or direct data leakage from one or more databases. This threat is the most widespread impact. Data deletion and denial of service The malicious query makes it possible for the attacker to delete data in the affected databases. This threat is particularly insidious if the attacked organization does not maintain a disaster recovery plan (DRP). Chaining DB injections with other vulnerabilities Attackers who exploit SQL injections rely on other vulnerabilities to maximize their profits. Most of the time, organizations overlook some defense in depth measures because they assume attackers cannot reach certain points in the infrastructure. This misbehavior can lead to multiple attacks with great impact: When secrets are stored unencrypted in databases: Secrets can be exfiltrated and lead to compromise of other components. If server-side OS and/or database permissions are misconfigured, injection can lead to remote code execution (RCE). See our article on this topic",
  "url": "https://rules.sonarsource.com/php/rspec-3649/"
},
{
  "title": "The output of functions that don't return anything should not be used",
  "description": "This rule raises an issue when a function call result is used, even though the function does not return anything.",
  "url": "https://rules.sonarsource.com/php/rspec-3699/"
},
{
  "title": "Cognitive Complexity of functions should not be too high",
  "description": "This rule raises an issue when the code cognitive complexity of a function is above a certain threshold.",
  "url": "https://rules.sonarsource.com/php/rspec-3776/"
},
{
  "title": "Functions should use \"return\" consistently",
  "description": "Because it is dynamically typed, PHP does not enforce a return type on a function. This means that different paths through a function can return different types of values, which can be very confusing to the user and significantly harder to maintain. In particular, it is consequently also possible to mix empty return statements (implicitly returning null) with some returning an expression. This rule verifies that all the return statements from a function are consistent. Noncompliant code example function foo($a) { // Noncompliant, function will return \"true\" or null if ($a == 1) { return true; } return; } Compliant solution function foo($a) { if ($a == 1) { return true; } return false; } or function foo($a) { if ($a == 1) { return true; } return null; }",
  "url": "https://rules.sonarsource.com/php/rspec-3801/"
},
{
  "title": "All branches in a conditional structure should not have exactly the same implementation",
  "description": "Having all branches of a switch or if chain with the same implementation indicates a problem. In the following code: if ($b == 0) { // Noncompliant doOneMoreThing(); } else { doOneMoreThing(); } $b = $a &gt; 12 ? 4 : 4; // Noncompliant switch ($i) { // Noncompliant case 1: doSomething(); break; case 2: doSomething(); break; case 3: doSomething(); break; default: doSomething(); } Either there is a copy-paste error that needs fixing or an unnecessary switch or if chain that should be removed. Exceptions This rule does not apply to if chains without else, nor to switch without a default clause. if($b == 0) { //no issue, this could have been done on purpose to make the code more readable doSomething(); } elseif($b == 1) { doSomething(); }",
  "url": "https://rules.sonarsource.com/php/rspec-3923/"
},
{
  "title": "Conditionals should start on new lines",
  "description": "Placing an if statement on the same line as the closing } from a preceding if, else, or elseif block can lead to confusion and potential errors. It may indicate a missing else statement or create ambiguity for maintainers who might fail to understand that the two statements are unconnected. The following code snippet is confusing: if ($condition1) { // ... } if ($condition2) { // Noncompliant //... } Either the two conditions are unrelated and they should be visually separated: if ($condition1) { // ... } if ($condition2) { //... } Or they were supposed to be exclusive and you should use elseif instead: if ($condition1) { // ... } elseif ($condition2) { //... }",
  "url": "https://rules.sonarsource.com/php/rspec-3972/"
},
{
  "title": "A conditionally executed single line should be denoted by indentation",
  "description": "When the line immediately after a conditional has neither curly braces nor indentation, the intent of the code is unclear and perhaps not what is executed. Additionally, such code is confusing to maintainers. if ($x &gt; 0) // Noncompliant doTheThing(); doTheOtherThing(); // Was the intent to call this function unconditionally? It becomes even more confusing and bug-prone if lines get commented out. if ($x &gt; 0) // Noncompliant // doTheThing(); doTheOtherThing(); // Was the intent to call this function conditionally? Indentation alone or together with curly braces makes the intent clear. if ($x &gt; 0) doTheThing(); doTheOtherThing(); // Clear intent to call this function unconditionally // or if ($x &gt; 0) { doTheThing(); } doTheOtherThing(); // Clear intent to call this function unconditionally This rule raises an issue if the line controlled by a conditional has the same indentation as the conditional and is not enclosed in curly braces.",
  "url": "https://rules.sonarsource.com/php/rspec-3973/"
},
{
  "title": "Array or Countable object count comparisons should make sense",
  "description": "The count of elements from an array or Countable object is always greater than or equal to zero. Testing it doesn’t make sense, since the result is always true. if (count($arr) &gt;= 0) {...} // Noncompliant: always true $result = count($arr) &gt;= 0; // Noncompliant always true Similarly testing that it is less than zero will always return false. if (count($arr) &lt; 0) {...} // Noncompliant: always false Fix the code to properly check for emptiness if it was the intent, or remove the redundant code to keep the current behavior.",
  "url": "https://rules.sonarsource.com/php/rspec-3981/"
},
{
  "title": "Exceptions should not be created without being thrown",
  "description": "Creating a new Exception without actually throwing it is useless and is probably due to a mistake. Noncompliant code example if ($x &lt; 0) new Exception('$x must be nonnegative'); Compliant solution if ($x &lt; 0) throw new Exception('$x must be nonnegative');",
  "url": "https://rules.sonarsource.com/php/rspec-3984/"
},
{
  "title": "Duplicate values should not be passed as arguments",
  "description": "This rule is deprecated, and will eventually be removed.",
  "url": "https://rules.sonarsource.com/php/rspec-4142/"
},
{
  "title": "Array values should not be replaced unconditionally",
  "description": "Storing a value inside a collection at a given key or index and then unconditionally overwriting it without reading the initial value is a case of a \"dead store\". $someArray[1] = \"someValue\"; $someArray[1] = \"someOtherValue\"; // Noncompliant This practice is redundant and will cause confusion for the reader. More importantly, it is often an error and not what the developer intended to do.",
  "url": "https://rules.sonarsource.com/php/rspec-4143/"
},
{
  "title": "Methods should not have identical implementations",
  "description": "Two methods having the same implementation are suspicious. It might be that something else was intended. Or the duplication is intentional, which becomes a maintenance burden. class A { private const CODE = \"secret\"; public function getCode() { doTheThing(); return A::CODE; } public function getName() { // Noncompliant: duplicates getCode doTheThing(); return A::CODE; } } If the identical logic is intentional, the code should be refactored to avoid duplication. For example, by having both methods call the same method or by having one implementation invoke the other. class A { private const CODE = \"secret\"; public function getCode() { doTheThing(); return A::CODE; } public function getName() { // Intent is clear return $this-&gt;getCode(); } } Exceptions Methods that are not accessors (getters and setters), with fewer than 2 statements are ignored. Additionally, accessors consisting of a single statement are ignored, if this statement does one of the following: Return null or an empty list [] Throw an exception Return a newly created object",
  "url": "https://rules.sonarsource.com/php/rspec-4144/"
},
{
  "title": "Weak SSL/TLS protocols should not be used",
  "description": "This vulnerability exposes encrypted data to a number of attacks whose goal is to recover the plaintext.",
  "url": "https://rules.sonarsource.com/php/rspec-4423/"
},
{
  "title": "Cryptographic keys should be robust",
  "description": "This vulnerability exposes encrypted data to attacks whose goal is to recover the plaintext.",
  "url": "https://rules.sonarsource.com/php/rspec-4426/"
},
{
  "title": "LDAP connections should be authenticated",
  "description": "Lightweight Directory Access Protocol (LDAP) servers provide two main authentication methods: the SASL and Simple ones. The Simple Authentication method also breaks down into three different mechanisms: Anonymous Authentication Unauthenticated Authentication Name/Password Authentication A server that accepts either the Anonymous or Unauthenticated mechanisms will accept connections from clients not providing credentials.",
  "url": "https://rules.sonarsource.com/php/rspec-4433/"
},
{
  "title": "Disabling CSRF protections is security-sensitive",
  "description": "A cross-site request forgery (CSRF) attack occurs when a trusted user of a web application can be forced, by an attacker, to perform sensitive actions that he didn’t intend, such as updating his profile or sending a message, more generally anything that can change the state of the application. The attacker can trick the user/victim to click on a link, corresponding to the privileged action, or to visit a malicious web site that embeds a hidden web request and as web browsers automatically include cookies, the actions can be authenticated and sensitive. Ask Yourself Whether The web application uses cookies to authenticate users. There exist sensitive operations in the web application that can be performed when the user is authenticated. The state / resources of the web application can be modified by doing HTTP POST or HTTP DELETE requests for example. There is a risk if you answered yes to any of those questions. Recommended Secure Coding Practices Protection against CSRF attacks is strongly recommended: to be activated by default for all unsafe HTTP methods. implemented, for example, with an unguessable CSRF token Of course all sensitive operations should not be performed with safe HTTP methods like GET which are designed to be used only for information retrieval. Sensitive Code Example For Laravel VerifyCsrfToken middleware use Illuminate\\Foundation\\Http\\Middleware\\VerifyCsrfToken as Middleware; class VerifyCsrfToken extends Middleware { protected $except = [ 'api/*' ]; // Sensitive; disable CSRF protection for a list of routes } For Symfony Forms use Symfony\\Bundle\\FrameworkBundle\\Controller\\AbstractController; class Controller extends AbstractController { public function action() { $this-&gt;createForm('', null, [ 'csrf_protection' =&gt; false, // Sensitive; disable CSRF protection for a single form ]); } } Compliant Solution For Laravel VerifyCsrfToken middleware use Illuminate\\Foundation\\Http\\Middleware\\VerifyCsrfToken as Middleware; class VerifyCsrfToken extends Middleware { protected $except = []; // Compliant } Remember to add @csrf blade directive to the relevant forms when removing an element from $except. Otherwise the form submission will stop working. For Symfony Forms use Symfony\\Bundle\\FrameworkBundle\\Controller\\AbstractController; class Controller extends AbstractController { public function action() { $this-&gt;createForm('', null, []); // Compliant; CSRF protection is enabled by default } } See OWASP - Top 10 2021 Category A1 - Broken Access Control CWE - CWE-352 - Cross-Site Request Forgery (CSRF) OWASP - Top 10 2017 Category A6 - Security Misconfiguration OWASP - Cross-Site Request Forgery STIG Viewer - Application Security and Development: V-222603 - The application must protect from Cross-Site Request Forgery (CSRF) vulnerabilities. PortSwigger - Web storage: the lesser evil for session tokens",
  "url": "https://rules.sonarsource.com/php/rspec-4502/"
},
{
  "title": "Delivering code in production with debug features activated is security-sensitive",
  "description": "Development tools and frameworks usually have options to make debugging easier for developers. Although these features are useful during development, they should never be enabled for applications deployed in production. Debug instructions or error messages can leak detailed information about the system, like the application’s path or file names. Ask Yourself Whether The code or configuration enabling the application debug features is deployed on production servers or distributed to end users. The application runs by default with debug features activated. There is a risk if you answered yes to any of those questions. Recommended Secure Coding Practices Do not enable debugging features on production servers or applications distributed to end users. Sensitive Code Example CakePHP 1.x, 2.x: Configure::write('debug', 1); // Sensitive: development mode or Configure::write('debug', 2); // Sensitive: development mode or Configure::write('debug', 3); // Sensitive: development mode CakePHP 3.0: use Cake\\Core\\Configure; Configure::config('debug', true); // Sensitive: development mode WordPress: define( 'WP_DEBUG', true ); // Sensitive: development mode Compliant Solution CakePHP 1.2: Configure::write('debug', 0); // Compliant; this is the production mode CakePHP 3.0: use Cake\\Core\\Configure; Configure::config('debug', false); // Compliant: \"0\" or \"false\" for CakePHP 3.x is suitable (production mode) to not leak sensitive data on the logs. WordPress: define( 'WP_DEBUG', false ); // Compliant See OWASP - Top 10 2021 Category A5 - Security Misconfiguration OWASP - Top 10 2017 Category A3 - Sensitive Data Exposure CWE - CWE-489 - Active Debug Code CWE - CWE-215 - Information Exposure Through Debug Information",
  "url": "https://rules.sonarsource.com/php/rspec-4507/"
},
{
  "title": "Deserializing objects from an untrusted source is security-sensitive",
  "description": "This rule is deprecated, and will eventually be removed. Deserializing objects is security-sensitive. For example, it has led in the past to the following vulnerabilities: CVE-2017-17672: vBulletin: Unserialize PHP Code Execution CVE-2018-1000167: Jenkins Pipeline: arbitrary code execution vulnerability Object deserialization from an untrusted source can lead to unexpected code execution. Deserialization takes a stream of bits and turns it into an object. If the stream contains the type of object you expect, all is well. But if you’re deserializing data coming from untrusted input, and an attacker has inserted some other type of object, you’re in trouble. Why? A known attack scenario involves the creation of a serialized PHP object with crafted attributes which will modify your application’s behavior. This attack relies on PHP magic methods like __desctruct, __wakeup or __string. The attacker doesn’t necessarily need the source code of the targeted application to exploit the vulnerability, he can also rely on the presence of open-source component and use tools to craft malicious payloads. Ask Yourself Whether an attacker could have tampered with the source provided to the deserialization function you are using an unsafe deserialization function You are at risk if you answered yes to any of those questions. Recommended Secure Coding Practices To prevent insecure deserialization, it is recommended to: Use safe libraries that do not allow code execution at deserialization. Not communicate with the outside world using serialized objects Limit access to the serialized source if it is a file, restrict the access to it. if it comes from the network, restrict who has access to the process, such as with a Firewall or by authenticating the sender first. See OWASP - Deserialization of untrusted data OWASP - Top 10 2017 Category A8 - Insecure Deserialization CWE - CWE-502 - Deserialization of Untrusted Data Derived from FindSecBugs rule OBJECT_DESERIALIZATION",
  "url": "https://rules.sonarsource.com/php/rspec-4508/"
},
{
  "title": "\"default\" clauses should be first or last",
  "description": "switch can contain a default clause for various reasons: to handle unexpected values, to show that all the cases were properly considered, etc. For readability purposes, to help a developer quickly spot the default behavior of a switch statement, it is recommended to put the default clause at the beginning or the end of the switch statement. This rule raises an issue if the default clause is not the first or the last one of the switch's cases. switch ($param) { case 0: doSomething(); break; default: // Noncompliant: default clause should be the first or last one error(); break; case 1: doSomethingElse(); break; }",
  "url": "https://rules.sonarsource.com/php/rspec-4524/"
},
{
  "title": "Using regular expressions is security-sensitive",
  "description": "This rule is deprecated; use S2631 instead. Using regular expressions is security-sensitive. It has led in the past to the following vulnerabilities: CVE-2017-16021 CVE-2018-13863 CVE-2018-8926 Evaluating regular expressions against input strings is potentially an extremely CPU-intensive task. Specially crafted regular expressions such as /(a+)+s/ will take several seconds to evaluate the input string aaaaaaaaaaaaaaaaaaaaaaaaaaaaaabs. The problem is that with every additional a character added to the input, the time required to evaluate the regex doubles. However, the equivalent regular expression, a+s (without grouping) is efficiently evaluated in milliseconds and scales linearly with the input size. Evaluating such regular expressions opens the door to Regular expression Denial of Service (ReDoS) attacks. In the context of a web application, attackers can force the web server to spend all of its resources evaluating regular expressions thereby making the service inaccessible to genuine users. This rule flags any execution of a hardcoded regular expression which has at least 3 characters and contains at at least two instances of any of the following characters *+{. Example: (a+)* The following functions are detected as executing regular expressions: PCRE: Perl style regular expressions: preg_filter, preg_grep, preg_match_all, preg_match, preg_replace_callback, preg_replace, preg_split POSIX extended, which are deprecated: ereg_replace, ereg, eregi_replace, eregi, split, spliti. fnmatch Any of the multibyte string regular expressions: mb_eregi_replace, mb_ereg_match, mb_ereg_replace_callback, mb_ereg_replace, mb_ereg_search_init, mb_ereg_search_pos, mb_ereg_search_regs, mb_ereg_search, mb_ereg, mb_eregi_replace, mb_eregi Note that ereg* functions have been removed in PHP 7 and PHP 5 end of life date is the 1st of January 2019. Using PHP 5 is dangerous as there will be no security fix. This rule’s goal is to guide security code reviews. Ask Yourself Whether the executed regular expression is sensitive and a user can provide a string which will be analyzed by this regular expression. your regular expression engine performance decrease with specially crafted inputs and regular expressions. There is a risk if you answered yes to any of those questions. Recommended Secure Coding Practices Do not set the constant pcre.backtrack_limit to a high value as it will increase the resource consumption of PCRE functions. Check the error codes of PCRE functions via preg_last_error. Check whether your regular expression engine (the algorithm executing your regular expression) has any known vulnerabilities. Search for vulnerability reports mentioning the one engine you’re are using. Do not run vulnerable regular expressions on user input. Use if possible a library which is not vulnerable to Redos Attacks such as Google Re2. Remember also that a ReDos attack is possible if a user-provided regular expression is executed. This rule won’t detect this kind of injection. Avoid executing a user input string as a regular expression or use at least preg_quote to escape regular expression characters. Exceptions An issue will be created for the functions mb_ereg_search_pos, mb_ereg_search_regs and mb_ereg_search if and only if at least the first argument, i.e. the $pattern, is provided. The current implementation does not follow variables. It will only detect regular expressions hard-coded directly in the function call. $pattern = \"/(a+)+/\"; $result = eregi($pattern, $input); // No issue will be raised even if it is Sensitive Some corner-case regular expressions will not raise an issue even though they might be vulnerable. For example: (a|aa)``, ``(a|a?). It is a good idea to test your regular expression if it has the same pattern on both side of a \"|\". See OWASP - Top 10 2017 Category A1 - Injection CWE - CWE-624 - Executable Regular Expression Error OWASP Regular expression Denial of Service - ReDoS",
  "url": "https://rules.sonarsource.com/php/rspec-4784/"
},
{
  "title": "Encrypting data is security-sensitive",
  "description": "This rule is deprecated; use S4426, S5542, S5547 instead. Encrypting data is security-sensitive. It has led in the past to the following vulnerabilities: CVE-2017-7902 CVE-2006-1378 CVE-2003-1376 Proper encryption requires both the encryption algorithm and the key to be strong. Obviously the private key needs to remain secret and be renewed regularly. However these are not the only means to defeat or weaken an encryption. This rule flags function calls that initiate encryption/decryption. Ask Yourself Whether the private key might not be random, strong enough or the same key is reused for a long long time. the private key might be compromised. It can happen when it is stored in an unsafe place or when it was transferred in an unsafe manner. the key exchange is made without properly authenticating the receiver. the encryption algorithm is not strong enough for the level of protection required. Note that encryption algorithms strength decreases as time passes. the chosen encryption library is deemed unsafe. a nonce is used, and the same value is reused multiple times, or the nonce is not random. the RSA algorithm is used, and it does not incorporate an Optimal Asymmetric Encryption Padding (OAEP), which might weaken the encryption. the CBC (Cypher Block Chaining) algorithm is used for encryption, and it’s IV (Initialization Vector) is not generated using a secure random algorithm, or it is reused. the Advanced Encryption Standard (AES) encryption algorithm is used with an unsecure mode. See the recommended practices for more information. You are at risk if you answered yes to any of those questions. Recommended Secure Coding Practices Generate encryption keys using secure random algorithms. When generating cryptographic keys (or key pairs), it is important to use a key length that provides enough entropy against brute-force attacks. For the Blowfish algorithm the key should be at least 128 bits long, while for the RSA algorithm it should be at least 2048 bits long. Regenerate the keys regularly. Always store the keys in a safe location and transfer them only over safe channels. If there is an exchange of cryptographic keys, check first the identity of the receiver. Only use strong encryption algorithms. Check regularly that the algorithm is still deemed secure. It is also imperative that they are implemented correctly. Use only encryption libraries which are deemed secure. Do not define your own encryption algorithms as they will most probably have flaws. When a nonce is used, generate it randomly every time. When using the RSA algorithm, incorporate an Optimal Asymmetric Encryption Padding (OAEP). When CBC is used for encryption, the IV must be random and unpredictable. Otherwise it exposes the encrypted value to crypto-analysis attacks like \"Chosen-Plaintext Attacks\". Thus a secure random algorithm should be used. An IV value should be associated to one and only one encryption cycle, because the IV’s purpose is to ensure that the same plaintext encrypted twice will yield two different ciphertexts. The Advanced Encryption Standard (AES) encryption algorithm can be used with various modes. Galois/Counter Mode (GCM) with no padding should be preferred to the following combinations which are not secured: Electronic Codebook (ECB) mode: Under a given key, any given plaintext block always gets encrypted to the same ciphertext block. Thus, it does not hide data patterns well. In some senses, it doesn’t provide serious message confidentiality, and it is not recommended for use in cryptographic protocols at all. Cipher Block Chaining (CBC) with PKCS#5 padding (or PKCS#7) is susceptible to padding oracle attacks. Sensitive Code Example Builtin functions function myEncrypt($cipher, $key, $data, $mode, $iv, $options, $padding, $infile, $outfile, $recipcerts, $headers, $nonce, $ad, $pub_key_ids, $env_keys) { mcrypt_ecb ($cipher, $key, $data, $mode); // Sensitive mcrypt_cfb($cipher, $key, $data, $mode, $iv); // Sensitive mcrypt_cbc($cipher, $key, $data, $mode, $iv); // Sensitive mcrypt_encrypt($cipher, $key, $data, $mode); // Sensitive openssl_encrypt($data, $cipher, $key, $options, $iv); // Sensitive openssl_public_encrypt($data, $crypted, $key, $padding); // Sensitive openssl_pkcs7_encrypt($infile, $outfile, $recipcerts, $headers); // Sensitive openssl_seal($data, $sealed_data, $env_keys, $pub_key_ids); // Sensitive sodium_crypto_aead_aes256gcm_encrypt ($data, $ad, $nonce, $key); // Sensitive sodium_crypto_aead_chacha20poly1305_encrypt ($data, $ad, $nonce, $key); // Sensitive sodium_crypto_aead_chacha20poly1305_ietf_encrypt ($data, $ad, $nonce, $key); // Sensitive sodium_crypto_aead_xchacha20poly1305_ietf_encrypt ($data, $ad, $nonce, $key); // Sensitive sodium_crypto_box_seal ($data, $key); // Sensitive sodium_crypto_box ($data, $nonce, $key); // Sensitive sodium_crypto_secretbox ($data, $nonce, $key); // Sensitive sodium_crypto_stream_xor ($data, $nonce, $key); // Sensitive } CakePHP use Cake\\Utility\\Security; function myCakeEncrypt($key, $data, $engine) { Security::encrypt($data, $key); // Sensitive // Do not use custom made engines and remember that Mcrypt is deprecated. Security::engine($engine); // Sensitive. Setting the encryption engine. } CodeIgniter class EncryptionController extends CI_Controller { public function __construct() { parent::__construct(); $this-&gt;load-&gt;library('encryption'); } public function index() { $this-&gt;encryption-&gt;create_key(16); // Sensitive. Review the key length. $this-&gt;encryption-&gt;initialize( // Sensitive. array( 'cipher' =&gt; 'aes-256', 'mode' =&gt; 'ctr', 'key' =&gt; 'the key', ) ); $this-&gt;encryption-&gt;encrypt(\"mysecretdata\"); // Sensitive. } } CraftCMS version 3 use Craft; // This is similar to Yii as it used by CraftCMS function craftEncrypt($data, $key, $password) { Craft::$app-&gt;security-&gt;encryptByKey($data, $key); // Sensitive Craft::$app-&gt;getSecurity()-&gt;encryptByKey($data, $key); // Sensitive Craft::$app-&gt;security-&gt;encryptByPassword($data, $password); // Sensitive Craft::$app-&gt;getSecurity()-&gt;encryptByPassword($data, $password); // Sensitive } Drupal 7 - Encrypt module function drupalEncrypt() { $encrypted_text = encrypt('some string to encrypt'); // Sensitive } Joomla use Joomla\\Crypt\\CipherInterface; abstract class MyCipher implements CipherInterface // Sensitive. Implementing custom cipher class {} function joomlaEncrypt() { new Joomla\\Crypt\\Cipher_Sodium(); // Sensitive new Joomla\\Crypt\\Cipher_Simple(); // Sensitive new Joomla\\Crypt\\Cipher_Rijndael256(); // Sensitive new Joomla\\Crypt\\Cipher_Crypto(); // Sensitive new Joomla\\Crypt\\Cipher_Blowfish(); // Sensitive new Joomla\\Crypt\\Cipher_3DES(); // Sensitive } } Laravel use Illuminate\\Support\\Facades\\Crypt; function myLaravelEncrypt($data) { Crypt::encryptString($data); // Sensitive Crypt::encrypt($data); // Sensitive // encrypt using the Laravel \"encrypt\" helper encrypt($data); // Sensitive } PHP-Encryption library use Defuse\\Crypto\\Crypto; use Defuse\\Crypto\\File; function mypPhpEncryption($data, $key, $password, $inputFilename, $outputFilename, $inputHandle, $outputHandle) { Crypto::encrypt($data, $key); // Sensitive Crypto::encryptWithPassword($data, $password); // Sensitive File::encryptFile($inputFilename, $outputFilename, $key); // Sensitive File::encryptFileWithPassword($inputFilename, $outputFilename, $password); // Sensitive File::encryptResource($inputHandle, $outputHandle, $key); // Sensitive File::encryptResourceWithPassword($inputHandle, $outputHandle, $password); // Sensitive } PhpSecLib function myphpseclib($mode) { new phpseclib\\Crypt\\RSA(); // Sensitive. Note: RSA can also be used for signing data. new phpseclib\\Crypt\\AES(); // Sensitive new phpseclib\\Crypt\\Rijndael(); // Sensitive new phpseclib\\Crypt\\Twofish(); // Sensitive new phpseclib\\Crypt\\Blowfish(); // Sensitive new phpseclib\\Crypt\\RC4(); // Sensitive new phpseclib\\Crypt\\RC2(); // Sensitive new phpseclib\\Crypt\\TripleDES(); // Sensitive new phpseclib\\Crypt\\DES(); // Sensitive new phpseclib\\Crypt\\AES($mode); // Sensitive new phpseclib\\Crypt\\Rijndael($mode); // Sensitive new phpseclib\\Crypt\\TripleDES($mode); // Sensitive new phpseclib\\Crypt\\DES($mode); // Sensitive } Sodium Compat library function mySodiumCompatEncrypt($data, $ad, $nonce, $key) { ParagonIE_Sodium_Compat::crypto_aead_chacha20poly1305_ietf_encrypt($data, $ad, $nonce, $key); // Sensitive ParagonIE_Sodium_Compat::crypto_aead_xchacha20poly1305_ietf_encrypt($data, $ad, $nonce, $key); // Sensitive ParagonIE_Sodium_Compat::crypto_aead_chacha20poly1305_encrypt($data, $ad, $nonce, $key); // Sensitive ParagonIE_Sodium_Compat::crypto_aead_aes256gcm_encrypt($data, $ad, $nonce, $key); // Sensitive ParagonIE_Sodium_Compat::crypto_box($data, $nonce, $key); // Sensitive ParagonIE_Sodium_Compat::crypto_secretbox($data, $nonce, $key); // Sensitive ParagonIE_Sodium_Compat::crypto_box_seal($data, $key); // Sensitive ParagonIE_Sodium_Compat::crypto_secretbox_xchacha20poly1305($data, $nonce, $key); // Sensitive } Yii version 2 use Yii; // Similar to CraftCMS as it uses Yii function YiiEncrypt($data, $key, $password) { Yii::$app-&gt;security-&gt;encryptByKey($data, $key); // Sensitive Yii::$app-&gt;getSecurity()-&gt;encryptByKey($data, $key); // Sensitive Yii::$app-&gt;security-&gt;encryptByPassword($data, $password); // Sensitive Yii::$app-&gt;getSecurity()-&gt;encryptByPassword($data, $password); // Sensitive } Zend use Zend\\Crypt\\FileCipher; use Zend\\Crypt\\PublicKey\\DiffieHellman; use Zend\\Crypt\\PublicKey\\Rsa; use Zend\\Crypt\\Hybrid; use Zend\\Crypt\\BlockCipher; function myZendEncrypt($key, $data, $prime, $options, $generator, $lib) { new FileCipher; // Sensitive. This is used to encrypt files new DiffieHellman($prime, $generator, $key); // Sensitive $rsa = Rsa::factory([ // Sensitive 'public_key' =&gt; 'public_key.pub', 'private_key' =&gt; 'private_key.pem', 'pass_phrase' =&gt; 'mypassphrase', 'binary_output' =&gt; false, ]); $rsa-&gt;encrypt($data); // No issue raised here. The configuration of the Rsa object is the line to review. $hybrid = new Hybrid(); // Sensitive BlockCipher::factory($lib, $options); // Sensitive } See OWASP - Top 10 2017 Category A3 - Sensitive Data Exposure OWASP - Top 10 2017 Category A6 - Security Misconfiguration CWE - CWE-321 - Use of Hard-coded Cryptographic Key CWE - CWE-322 - Key Exchange without Entity Authentication CWE - CWE-323 - Reusing a Nonce, Key Pair in Encryption CWE - CWE-324 - Use of a Key Past its Expiration Date CWE - CWE-325 - Missing Required Cryptographic Step CWE - CWE-326 - Inadequate Encryption Strength CWE - CWE-327 - Use of a Broken or Risky Cryptographic Algorithm",
  "url": "https://rules.sonarsource.com/php/rspec-4787/"
},
{
  "title": "Using weak hashing algorithms is security-sensitive",
  "description": "Cryptographic hash algorithms such as MD2, MD4, MD5, MD6, HAVAL-128, DSA (which uses SHA-1), RIPEMD, RIPEMD-128, RIPEMD-160and SHA-1 are no longer considered secure, because it is possible to have collisions (little computational effort is enough to find two or more different inputs that produce the same hash). Message authentication code (MAC) algorithms such as HMAC-MD5 or HMAC-SHA1 use weak hash functions as building blocks. Although they are not all proven to be weak, they are considered legacy algorithms and should be avoided. Ask Yourself Whether The hashed value is used in a security context like: User-password storage. Security token generation (used to confirm e-mail when registering on a website, reset password, etc …​). To compute some message integrity. There is a risk if you answered yes to any of those questions. Recommended Secure Coding Practices Safer alternatives, such as SHA-256, SHA-512, SHA-3 are recommended, and for password hashing, it’s even better to use algorithms that do not compute too \"quickly\", like bcrypt, scrypt, argon2 or pbkdf2 because it slows down brute force attacks. Sensitive Code Example $hash = md5($data); // Sensitive $hash = sha1($data); // Sensitive Compliant Solution // for a password $hash = password_hash($password, PASSWORD_BCRYPT); // Compliant // other context $hash = hash(\"sha512\", $data); See OWASP - Top 10 2021 Category A2 - Cryptographic Failures OWASP - Top 10 2017 Category A3 - Sensitive Data Exposure OWASP - Top 10 2017 Category A6 - Security Misconfiguration CWE - CWE-1240 - Use of a Risky Cryptographic Primitive",
  "url": "https://rules.sonarsource.com/php/rspec-4790/"
},
{
  "title": "Configuring loggers is security-sensitive",
  "description": "This rule is deprecated, and will eventually be removed. Configuring loggers is security-sensitive. It has led in the past to the following vulnerabilities: CVE-2018-0285 CVE-2000-1127 CVE-2017-15113 CVE-2015-5742 Logs are useful before, during and after a security incident. Attackers will most of the time start their nefarious work by probing the system for vulnerabilities. Monitoring this activity and stopping it is the first step to prevent an attack from ever happening. In case of a successful attack, logs should contain enough information to understand what damage an attacker may have inflicted. Logs are also a target for attackers because they might contain sensitive information. Configuring loggers has an impact on the type of information logged and how they are logged. This rule flags for review code that initiates loggers configuration. The goal is to guide security code reviews. Ask Yourself Whether unauthorized users might have access to the logs, either because they are stored in an insecure location or because the application gives access to them. the logs contain sensitive information on a production server. This can happen when the logger is in debug mode. the log can grow without limit. This can happen when additional information is written into logs every time a user performs an action and the user can perform the action as many times as he/she wants. the logs do not contain enough information to understand the damage an attacker might have inflicted. The loggers mode (info, warn, error) might filter out important information. They might not print contextual information like the precise time of events or the server hostname. the logs are only stored locally instead of being backuped or replicated. There is a risk if you answered yes to any of those questions. Recommended Secure Coding Practices Check that your production deployment doesn’t have its loggers in \"debug\" mode as it might write sensitive information in logs. Production logs should be stored in a secure location which is only accessible to system administrators. Configure the loggers to display all warnings, info and error messages. Write relevant information such as the precise time of events and the hostname. Choose log format which is easy to parse and process automatically. It is important to process logs rapidly in case of an attack so that the impact is known and limited. Check that the permissions of the log files are correct. If you index the logs in some other service, make sure that the transfer and the service are secure too. Add limits to the size of the logs and make sure that no user can fill the disk with logs. This can happen even when the user does not control the logged information. An attacker could just repeat a logged action many times. Remember that configuring loggers properly doesn’t make them bullet-proof. Here is a list of recommendations explaining on how to use your logs: Don’t log any sensitive information. This obviously includes passwords and credit card numbers but also any personal information such as user names, locations, etc…​ Usually any information which is protected by law is good candidate for removal. Sanitize all user inputs before writing them in the logs. This includes checking its size, content, encoding, syntax, etc…​ As for any user input, validate using whitelists whenever possible. Enabling users to write what they want in your logs can have many impacts. It could for example use all your storage space or compromise your log indexing service. Log enough information to monitor suspicious activities and evaluate the impact an attacker might have on your systems. Register events such as failed logins, successful logins, server side input validation failures, access denials and any important transaction. Monitor the logs for any suspicious activity. Sensitive Code Example Basic PHP configuration: function configure_logging() { error_reporting(E_RECOVERABLE_ERROR); // Sensitive error_reporting(32); // Sensitive ini_set('docref_root', '1'); // Sensitive ini_set('display_errors', '1'); // Sensitive ini_set('display_startup_errors', '1'); // Sensitive ini_set('error_log', \"path/to/logfile\"); // Sensitive - check logfile is secure ini_set('error_reporting', E_PARSE ); // Sensitive ini_set('error_reporting', 64); // Sensitive ini_set('log_errors', '0'); // Sensitive ini_set('log_errors_max_length', '512'); // Sensitive ini_set('ignore_repeated_errors', '1'); // Sensitive ini_set('ignore_repeated_source', '1'); // Sensitive ini_set('track_errors', '0'); // Sensitive ini_alter('docref_root', '1'); // Sensitive ini_alter('display_errors', '1'); // Sensitive ini_alter('display_startup_errors', '1'); // Sensitive ini_alter('error_log', \"path/to/logfile\"); // Sensitive - check logfile is secure ini_alter('error_reporting', E_PARSE ); // Sensitive ini_alter('error_reporting', 64); // Sensitive ini_alter('log_errors', '0'); // Sensitive ini_alter('log_errors_max_length', '512'); // Sensitive ini_alter('ignore_repeated_errors', '1'); // Sensitive ini_alter('ignore_repeated_source', '1'); // Sensitive ini_alter('track_errors', '0'); // Sensitive } Definition of custom loggers with psr/log abstract class MyLogger implements \\Psr\\Log\\LoggerInterface { // Sensitive // ... } abstract class MyLogger2 extends \\Psr\\Log\\AbstractLogger { // Sensitive // ... } abstract class MyLogger3 { use \\Psr\\Log\\LoggerTrait; // Sensitive // ... } Exceptions No issue will be raised for logger configuration when it follows recommended settings for production servers. The following examples are all valid: ini_set('docref_root', '0'); ini_set('display_errors', '0'); ini_set('display_startup_errors', '0'); error_reporting(0); ini_set('error_reporting', 0); ini_set('log_errors', '1'); ini_set('log_errors_max_length', '0'); ini_set('ignore_repeated_errors', '0'); ini_set('ignore_repeated_source', '0'); ini_set('track_errors', '1'); See OWASP - Top 10 2021 Category A9 - Security Logging and Monitoring Failures OWASP - Top 10 2017 Category A3 - Sensitive Data Exposure OWASP - Top 10 2017 Category A10 - Insufficient Logging &amp; Monitoring CWE - CWE-117 - Improper Output Neutralization for Logs CWE - CWE-532 - Information Exposure Through Log Files",
  "url": "https://rules.sonarsource.com/php/rspec-4792/"
},
{
  "title": "Using Sockets is security-sensitive",
  "description": "This rule is deprecated, and will eventually be removed. Using sockets is security-sensitive. It has led in the past to the following vulnerabilities: CVE-2011-178 CVE-2017-5645 CVE-2018-6597 Sockets are vulnerable in multiple ways: They enable a software to interact with the outside world. As this world is full of attackers it is necessary to check that they cannot receive sensitive information or inject dangerous input. The number of sockets is limited and can be exhausted. Which makes the application unresponsive to users who need additional sockets. This rules flags code that creates sockets. It matches only the direct use of sockets, not use through frameworks or high-level APIs such as the use of http connections. Ask Yourself Whether sockets are created without any limit every time a user performs an action. input received from sockets is used without being sanitized. sensitive data is sent via sockets without being encrypted. There is a risk if you answered yes to any of those questions. Recommended Secure Coding Practices In many cases there is no need to open a socket yourself. Use instead libraries and existing protocols. Encrypt all data sent if it is sensitive. Usually it is better to encrypt it even if the data is not sensitive as it might change later. Sanitize any input read from the socket. Limit the number of sockets a given user can create. Close the sockets as soon as possible. Sensitive Code Example function handle_sockets($domain, $type, $protocol, $port, $backlog, $addr, $hostname, $local_socket, $remote_socket, $fd) { socket_create($domain, $type, $protocol); // Sensitive socket_create_listen($port, $backlog); // Sensitive socket_addrinfo_bind($addr); // Sensitive socket_addrinfo_connect($addr); // Sensitive socket_create_pair($domain, $type, $protocol, $fd); fsockopen($hostname); // Sensitive pfsockopen($hostname); // Sensitive stream_socket_server($local_socket); // Sensitive stream_socket_client($remote_socket); // Sensitive stream_socket_pair($domain, $type, $protocol); // Sensitive } See OWASP - Top 10 2017 Category A3 - Sensitive Data Exposure CWE - CWE-20 - Improper Input Validation CWE - CWE-400 - Uncontrolled Resource Consumption ('Resource Exhaustion') CWE - CWE-200 - Exposure of Sensitive Information to an Unauthorized Actor",
  "url": "https://rules.sonarsource.com/php/rspec-4818/"
},
{
  "title": "Using command line arguments is security-sensitive",
  "description": "This rule is deprecated, and will eventually be removed. Using command line arguments is security-sensitive. It has led in the past to the following vulnerabilities: CVE-2018-7281 CVE-2018-12326 CVE-2011-3198 Command line arguments can be dangerous just like any other user input. They should never be used without being first validated and sanitized. Remember also that any user can retrieve the list of processes running on a system, which makes the arguments provided to them visible. Thus passing sensitive information via command line arguments should be considered as insecure. This rule raises an issue when on every program entry points (main methods) when command line arguments are used. The goal is to guide security code reviews. Ask Yourself Whether any of the command line arguments are used without being sanitized first. your application accepts sensitive information via command line arguments. If you answered yes to any of these questions you are at risk. Recommended Secure Coding Practices Sanitize all command line arguments before using them. Any user or application can list running processes and see the command line arguments they were started with. There are safer ways of providing sensitive information to an application than exposing them in the command line. It is common to write them on the process' standard input, or give the path to a file containing the information. Sensitive Code Example Builtin access to $argv function globfunc() { global $argv; // Sensitive. Reference to global $argv foreach ($argv as $arg) { // Sensitive. // ... } } function myfunc($argv) { $param = $argv[0]; // OK. Reference to local $argv parameter // ... } foreach ($argv as $arg) { // Sensitive. Reference to $argv. // ... } $myargv = $_SERVER['argv']; // Sensitive. Equivalent to $argv. function serve() { $myargv = $_SERVER['argv']; // Sensitive. // ... } myfunc($argv); // Sensitive $myvar = $HTTP_SERVER_VARS[0]; // Sensitive. Note: HTTP_SERVER_VARS has ben removed since PHP 5.4. $options = getopt('a:b:'); // Sensitive. Parsing arguments. $GLOBALS[\"argv\"]; // Sensitive. Equivalent to $argv. function myglobals() { $GLOBALS[\"argv\"]; // Sensitive } $argv = [1,2,3]; // Sensitive. It is a bad idea to override argv. Zend Console new Zend\\Console\\Getopt(['myopt|m' =&gt; 'this is an option']); // Sensitive Getopt-php library new \\GetOpt\\Option('m', 'myoption', \\GetOpt\\GetOpt::REQUIRED_ARGUMENT); // Sensitive See OWASP - Top 10 2017 Category A1 - Injection CWE - CWE-88 - Argument Injection or Modification CWE - CWE-214 - Information Exposure Through Process Environment",
  "url": "https://rules.sonarsource.com/php/rspec-4823/"
},
{
  "title": "References used in \"foreach\" loops should be \"unset\"",
  "description": "In PHP, references allow you to create multiple names for the same variable, enabling you to access and manipulate its value through different identifiers. They are denoted by the ampersand symbol &amp; placed before the variable name during declaration or assignment. When a reference is used in a foreach loop instead of using a simple variable, the reference remains assigned and keeps its \"value\" which is a reference, even after the foreach execution. What is the potential impact? Not unsetting the reference can lead to bugs later in the code, as most of the time, this behavior is different from what the developer is expecting. For example, the reference may be used incorrectly with the previous value. To avoid unexpected side effects, it is recommended to always unset a reference that is used in a foreach loop.",
  "url": "https://rules.sonarsource.com/php/rspec-4824/"
},
{
  "title": "Signaling processes is security-sensitive",
  "description": "Signaling processes or process groups can seriously affect the stability of this application or other applications on the same system. Accidentally setting an incorrect PID or signal or allowing untrusted sources to assign arbitrary values to these parameters may result in a denial of service. Also, the system treats the signal differently if the destination PID is less than or equal to 0. This different behavior may affect multiple processes with the same (E)UID simultaneously if the call is left uncontrolled. Ask Yourself Whether The parameters pid and sig are untrusted (they come from an external source). This function is triggered by non-administrators. Signal handlers on the target processes stop important functions. There is a risk if you answered yes to any of those questions. Recommended Secure Coding Practices For stateful applications with user management, ensure that only administrators trigger this code. Verify that the pid and sig parameters are correct before using them. Ensure that the process sending the signals runs with as few OS privileges as possible. Isolate the process on the system based on its (E)UID. Ensure that the signal does not interrupt any essential functions when intercepted by a target’s signal handlers. Sensitive Code Example $targetPid = (int)$_GET[\"pid\"]; posix_kill($targetPid, 9); // Sensitive Compliant Solution $targetPid = (int)$_GET[\"pid\"]; // Validate the untrusted PID, // With a pre-approved list or authorization checks if (isValidPid($targetPid)) { posix_kill($targetPid, 9); } See CWE - CWE-283 - Unverified Ownership kill(1) — Linux manual page kill(2) — Linux manual page",
  "url": "https://rules.sonarsource.com/php/rspec-4828/"
},
{
  "title": "Reading the Standard Input is security-sensitive",
  "description": "This rule is deprecated, and will eventually be removed. Reading Standard Input is security-sensitive. It has led in the past to the following vulnerabilities: CVE-2005-2337 CVE-2017-11449 It is common for attackers to craft inputs enabling them to exploit software vulnerabilities. Thus any data read from the standard input (stdin) can be dangerous and should be validated. This rule flags code that reads from the standard input. Ask Yourself Whether data read from the standard input is not sanitized before being used. You are at risk if you answered yes to this question. Recommended Secure Coding Practices Sanitize all data read from the standard input before using it. Sensitive Code Example // Any reference to STDIN is Sensitive $varstdin = STDIN; // Sensitive stream_get_line(STDIN, 40); // Sensitive stream_copy_to_stream(STDIN, STDOUT); // Sensitive // ... // Except those references as they can't create an injection vulnerability. ftruncate(STDIN, 5); // OK ftell(STDIN); // OK feof(STDIN); // OK fseek(STDIN, 5); // OK fclose(STDIN); // OK // STDIN can also be referenced like this $mystdin = 'php://stdin'; // Sensitive file_get_contents('php://stdin'); // Sensitive readfile('php://stdin'); // Sensitive $input = fopen('php://stdin', 'r'); // Sensitive fclose($input); // OK See CWE - CWE-20 - Improper Input Validation",
  "url": "https://rules.sonarsource.com/php/rspec-4829/"
},
{
  "title": "Server certificates should be verified during SSL/TLS connections",
  "description": "This vulnerability makes it possible that an encrypted communication is intercepted.",
  "url": "https://rules.sonarsource.com/php/rspec-4830/"
},
{
  "title": "Use of namespaces should be preferred to \"include\" or \"require\" functions",
  "description": "Namespaces should be preferred over the include or require functions in PHP because they provide a cleaner and more organized approach for managing code dependencies. Namespaces allow you to logically group related classes, functions, and constants, preventing naming conflicts and improving code readability. They also promote code reusability by enabling modularization and encapsulation. On the other hand, using include or require functions directly can lead to a cluttered global namespace and make it harder to track and manage dependencies, especially in larger projects. Exceptions This rule doesn’t raise issues on autoload.php files. This file is typically generated by Composer that provides an autoloading mechanism for classes and functions. Composer is a dependency management tool for PHP that simplifies the process of integrating external libraries and packages into your project.",
  "url": "https://rules.sonarsource.com/php/rspec-4833/"
},
{
  "title": "Controlling permissions is security-sensitive",
  "description": "This rule is deprecated, and will eventually be removed. The access control of an application must be properly implemented in order to restrict access to resources to authorized entities otherwise this could lead to vulnerabilities: CVE-2018-12999 CVE-2018-10285 CVE-2017-7455 Granting correct permissions to users, applications, groups or roles and defining required permissions that allow access to a resource is sensitive, must therefore be done with care. For instance, it is obvious that only users with administrator privilege should be authorized to add/remove the administrator permission of another user. Ask Yourself Whether Granted permission to an entity (user, application) allow access to information or functionalities not needed by this entity. Privileges are easily acquired (eg: based on the location of the user, type of device used, defined by third parties, does not require approval …​). Inherited permission, default permission, no privileges (eg: anonymous user) is authorized to access to a protected resource. There is a risk if you answered yes to any of those questions. Recommended Secure Coding Practices At minimum, an access control system should: Use a well-defined access control model like RBAC or ACL. Entities' permissions should be reviewed regularly to remove permissions that are no longer needed. Respect the principle of least privilege (\"an entity has access only the information and resources that are necessary for its legitimate purpose\"). Sensitive Code Example CakePHP use Cake\\Auth\\BaseAuthorize; use Cake\\Controller\\Controller; abstract class MyAuthorize extends BaseAuthorize { // Sensitive. Method extending Cake\\Auth\\BaseAuthorize. // ... } // Note that \"isAuthorized\" methods will only be detected in direct subclasses of Cake\\Controller\\Controller. abstract class MyController extends Controller { public function isAuthorized($user) { // Sensitive. Method called isAuthorized in a Cake\\Controller\\Controller. return false; } } See OWASP - Top 10 2017 Category A5 - Broken Access Control CWE - CWE-276 - Incorrect Default Permissions CWE - CWE-732 - Incorrect Permission Assignment for Critical Resource CWE - CWE-668 - Exposure of Resource to Wrong Sphere CWE - CWE-277 - Insecure Inherited Permissions",
  "url": "https://rules.sonarsource.com/php/rspec-4834/"
},
{
  "title": "Expanding archive files without controlling resource consumption is security-sensitive",
  "description": "Successful Zip Bomb attacks occur when an application expands untrusted archive files without controlling the size of the expanded data, which can lead to denial of service. A Zip bomb is usually a malicious archive file of a few kilobytes of compressed data but turned into gigabytes of uncompressed data. To achieve this extreme compression ratio, attackers will compress irrelevant data (eg: a long string of repeated bytes). Ask Yourself Whether Archives to expand are untrusted and: There is no validation of the number of entries in the archive. There is no validation of the total size of the uncompressed data. There is no validation of the ratio between the compressed and uncompressed archive entry. There is a risk if you answered yes to any of those questions. Recommended Secure Coding Practices Define and control the ratio between compressed and uncompressed data, in general the data compression ratio for most of the legit archives is 1 to 3. Define and control the threshold for maximum total size of the uncompressed data. Count the number of file entries extracted from the archive and abort the extraction if their number is greater than a predefined threshold, in particular it’s not recommended to recursively expand archives (an entry of an archive could be also an archive). Sensitive Code Example For ZipArchive module: $zip = new ZipArchive(); if ($zip-&gt;open($file) === true) { $zip-&gt;extractTo('.'); // Sensitive $zip-&gt;close(); } For Zip module: $zip = zip_open($file); while ($file = zip_read($zip)) { $filename = zip_entry_name($file); $size = zip_entry_filesize($file); if (substr($filename, -1) !== '/') { $content = zip_entry_read($file, zip_entry_filesize($file)); // Sensitive - zip_entry_read() uses zip_entry_filesize() file_put_contents($filename, $content); } else { mkdir($filename); } } zip_close($zip); Compliant Solution For ZipArchive module: define('MAX_FILES', 10000); define('MAX_SIZE', 1000000000); // 1 GB define('MAX_RATIO', 10); define('READ_LENGTH', 1024); $fileCount = 0; $totalSize = 0; $zip = new ZipArchive(); if ($zip-&gt;open($file) === true) { for ($i = 0; $i &lt; $zip-&gt;numFiles; $i++) { $filename = $zip-&gt;getNameIndex($i); $stats = $zip-&gt;statIndex($i); if (strpos($filename, '../') !== false || substr($filename, 0, 1) === '/') { throw new Exception(); } if (substr($filename, -1) !== '/') { $fileCount++; if ($fileCount &gt; MAX_FILES) { // Reached max. number of files throw new Exception(); } $fp = $zip-&gt;getStream($filename); // Compliant $currentSize = 0; while (!feof($fp)) { $currentSize += READ_LENGTH; $totalSize += READ_LENGTH; if ($totalSize &gt; MAX_SIZE) { // Reached max. size throw new Exception(); } // Additional protection: check compression ratio if ($stats['comp_size'] &gt; 0) { $ratio = $currentSize / $stats['comp_size']; if ($ratio &gt; MAX_RATIO) { // Reached max. compression ratio throw new Exception(); } } file_put_contents($filename, fread($fp, READ_LENGTH), FILE_APPEND); } fclose($fp); } else { mkdir($filename); } } $zip-&gt;close(); } For Zip module: define('MAX_FILES', 10000); define('MAX_SIZE', 1000000000); // 1 GB define('MAX_RATIO', 10); define('READ_LENGTH', 1024); $fileCount = 0; $totalSize = 0; $zip = zip_open($file); while ($file = zip_read($zip)) { $filename = zip_entry_name($file); if (strpos($filename, '../') !== false || substr($filename, 0, 1) === '/') { throw new Exception(); } if (substr($filename, -1) !== '/') { $fileCount++; if ($fileCount &gt; MAX_FILES) { // Reached max. number of files throw new Exception(); } $currentSize = 0; while ($data = zip_entry_read($file, READ_LENGTH)) { // Compliant $currentSize += READ_LENGTH; $totalSize += READ_LENGTH; if ($totalSize &gt; MAX_SIZE) { // Reached max. size throw new Exception(); } // Additional protection: check compression ratio if (zip_entry_compressedsize($file) &gt; 0) { $ratio = $currentSize / zip_entry_compressedsize($file); if ($ratio &gt; MAX_RATIO) { // Reached max. compression ratio throw new Exception(); } } file_put_contents($filename, $data, FILE_APPEND); } } else { mkdir($filename); } } zip_close($zip); See OWASP - Top 10 2021 Category A1 - Broken Access Control OWASP - Top 10 2021 Category A5 - Security Misconfiguration OWASP - Top 10 2017 Category A5 - Broken Access Control OWASP - Top 10 2017 Category A6 - Security Misconfiguration CWE - CWE-409 - Improper Handling of Highly Compressed Data (Data Amplification) bamsoftware.com - A better Zip Bomb",
  "url": "https://rules.sonarsource.com/php/rspec-5042/"
},
{
  "title": "Having a permissive Cross-Origin Resource Sharing policy is security-sensitive",
  "description": "Having a permissive Cross-Origin Resource Sharing policy is security-sensitive. It has led in the past to the following vulnerabilities: CVE-2018-0269 CVE-2017-14460 Same origin policy in browsers prevents, by default and for security-reasons, a javascript frontend to perform a cross-origin HTTP request to a resource that has a different origin (domain, protocol, or port) from its own. The requested target can append additional HTTP headers in response, called CORS, that act like directives for the browser and change the access control policy / relax the same origin policy. Ask Yourself Whether You don’t trust the origin specified, example: Access-Control-Allow-Origin: untrustedwebsite.com. Access control policy is entirely disabled: Access-Control-Allow-Origin: * Your access control policy is dynamically defined by a user-controlled input like origin header. There is a risk if you answered yes to any of those questions. Recommended Secure Coding Practices The Access-Control-Allow-Origin header should be set only for a trusted origin and for specific resources. Allow only selected, trusted domains in the Access-Control-Allow-Origin header. Prefer whitelisting domains over blacklisting or allowing any domain (do not use * wildcard nor blindly return the Origin header content without any checks). Sensitive Code Example PHP built-in header function: header(\"Access-Control-Allow-Origin: *\"); // Sensitive Laravel: response()-&gt;header('Access-Control-Allow-Origin', \"*\"); // Sensitive Symfony: use Symfony\\Component\\HttpFoundation\\Response; $response = new Response( 'Content', Response::HTTP_OK, ['Access-Control-Allow-Origin' =&gt; '*'] // Sensitive ); $response-&gt;headers-&gt;set('Access-Control-Allow-Origin', '*'); // Sensitive User-controlled origin: use Symfony\\Component\\HttpFoundation\\Response; use Symfony\\Component\\HttpFoundation\\Request; $origin = $request-&gt;headers-&gt;get('Origin'); $response-&gt;headers-&gt;set('Access-Control-Allow-Origin', $origin); // Sensitive Compliant Solution PHP built-in header function: header(\"Access-Control-Allow-Origin: $trusteddomain\"); Laravel: response()-&gt;header('Access-Control-Allow-Origin', $trusteddomain); Symfony: use Symfony\\Component\\HttpFoundation\\Response; $response = new Response( 'Content', Response::HTTP_OK, ['Access-Control-Allow-Origin' =&gt; $trusteddomain] ); $response-&gt;headers-&gt;set('Access-Control-Allow-Origin', $trusteddomain); User-controlled origin validated with an allow-list: use Symfony\\Component\\HttpFoundation\\Response; use Symfony\\Component\\HttpFoundation\\Request; $origin = $request-&gt;headers-&gt;get('Origin'); if (in_array($origin, $trustedOrigins)) { $response-&gt;headers-&gt;set('Access-Control-Allow-Origin', $origin); } See OWASP - Top 10 2021 Category A5 - Security Misconfiguration OWASP - Top 10 2021 Category A7 - Identification and Authentication Failures developer.mozilla.org - CORS developer.mozilla.org - Same origin policy OWASP - Top 10 2017 Category A6 - Security Misconfiguration OWASP HTML5 Security Cheat Sheet - Cross Origin Resource Sharing CWE - CWE-346 - Origin Validation Error CWE - CWE-942 - Overly Permissive Cross-domain Whitelist",
  "url": "https://rules.sonarsource.com/php/rspec-5122/"
},
{
  "title": "Endpoints should not be vulnerable to reflected cross-site scripting (XSS) attacks",
  "description": "This vulnerability makes it possible to temporarily execute JavaScript code in the context of the application, granting access to the session of the victim. This is possible because user-provided data, such as URL parameters, are copied into the HTML body of the HTTP response that is sent back to the user.",
  "url": "https://rules.sonarsource.com/php/rspec-5131/"
},
{
  "title": "Deserialization should not be vulnerable to injection attacks",
  "description": "Deserialization injections occur when applications deserialize wholly or partially untrusted data without verification. What is the potential impact? In the context of a web application performing unsafe deserialization: After detecting the injection vector, attackers inject a carefully-crafted payload into the application. Below are some real-world scenarios that illustrate some impacts of an attacker exploiting the vulnerability. Application-specific attacks In this scenario, the attackers succeed in injecting an object of the expected class, but with malicious properties that affect the object’s behavior. If the application relies on the properties of the deserialized object, attackers can modify the data structure or content to escalate privileges or perform unwanted actions. In the context of an e-commerce application, this could be changing the number of products or prices. Full application compromise In the worst-case scenario, the attackers succeed in injecting an object of a completely different class than expected, triggering code execution. Depending on the attacker, code execution can be used with different intentions: Download the internal server’s data, most likely to sell it. Modify data, install malware, for instance, malware that mines cryptocurrencies. Stop services or exhaust resources, for instance, with fork bombs. This threat is particularly insidious if the attacked organization does not maintain a Disaster Recovery Plan (DRP). Root privilege escalation and pivot In this scenario, the attacker can do everything described in the previous section. The difference is that the attacker additionally manages to elevate his privileges as an administrator and attack other servers. Here, the impact depends on how much the target company focuses on its Defense In Depth. For example, the entire infrastructure can be compromised through a combination of unsafe deserialization and misconfiguration: Docker or Kubernetes clusters cloud services network firewalls and routing OS access control",
  "url": "https://rules.sonarsource.com/php/rspec-5135/"
},
{
  "title": "Server-side requests should not be vulnerable to forging attacks",
  "description": "Server-Side Request Forgery (SSRF) occurs when attackers can coerce a server to perform arbitrary requests on their behalf. An SSRF vulnerability can either be basic or blind, depending on whether the server’s fetched data is directly returned in the web application’s response. The absence of the corresponding response for the coerced request on the application is not a barrier to exploitation and thus must be treated in the same way as basic SSRF. What is the potential impact? SSRF usually results in unauthorized actions or data disclosure in the vulnerable application or on a different system it can reach. Conditional to what is reachable, remote command execution can be achieved, although it often requires chaining with further exploitations. Information disclosure is SSRF’s core outcome. Depending on the extracted data, an attacker can perform a variety of different actions that can range from low to critical severity. Below are some real-world scenarios that illustrate some impacts of an attacker exploiting the vulnerability. Local file read to host takeover An attacker manipulates an application into performing a local request for a sensitive file, such as ~/.ssh/id_rsa, by using the File URI scheme file://. Once in possession of the SSH keys, the attacker establishes a remote connection to the system hosting the web application. Internal Network Reconnaissance An attacker enumerates internal accessible ports from the affected server or others to which the server can communicate by iterating over the port field in the URL http://127.0.0.1:{port}. Taking advantage of other supported URL schemas (dependent on the affected system), for example, gopher://127.0.0.1:3306, an attacker would be able to connect to a database service and perform queries on it.",
  "url": "https://rules.sonarsource.com/php/rspec-5144/"
},
{
  "title": "Logging should not be vulnerable to injection attacks",
  "description": "Log injection occurs when an application fails to sanitize untrusted data used for logging. An attacker can forge log content to prevent an organization from being able to trace back malicious activities. What is the potential impact? If an attacker can insert arbitrary data into a log file, the integrity of the chain of events being recorded can be compromised. This frequently occurs because attackers can inject the log entry separator of the logger framework, commonly newlines, and thus insert artificial log entries. Other attacks could also occur requiring only field pollution, such as cross-site scripting (XSS) or code injection (for example, Log4Shell) if the logged data is fed to other application components, which may interpret the injected data differently. The focus of this rule is newline character replacement. Log Forge An attacker, able to create independent log entries by injecting log entry separators, inserts bogus data into a log file to conceal his malicious activities. This obscures the content for an incident response team to trace the origin of the breach as the indicators of compromise (IoCs) lead to fake application events.",
  "url": "https://rules.sonarsource.com/php/rspec-5145/"
},
{
  "title": "HTTP request redirections should not be open to forging attacks",
  "description": "Open redirection occurs when an application uses user-controllable data to redirect users to a URL. An attacker with malicious intent could manipulate a user to browse into a specially crafted URL, such as https://trusted.example.com?url=evil.example.com, to redirect the victim to his evil domain. Tricking users into sending the malicious HTTP request is usually the main task of exploiting an open redirection. Often, it requires an attacker to build a credible pretext to prevent suspicions from the victim. Attackers commonly use open redirect exploits in mass phishing campaigns. What is the potential impact? If an attacker tricks a user into opening a link of his choice, the user is redirected to a domain controlled by the attacker. From then on, the attacker can perform various malicious actions, some more impactful than others. Below are some real-world scenarios that illustrate some impacts of an attacker exploiting the vulnerability. Domain Mirroring A malicious link redirects to an attacker’s controlled website mirroring the interface of a web application trusted by the user. Due to the similarity in the application appearance and the apparently trustable clicked hyperlink, the user struggles to identify that they are browsing on a malicious domain. Depending on the attacker’s purpose, the malicious website can leak credentials, bypass Multi-Factor Authentication (MFA), and reach any authenticated data or action. Malware Distribution A malicious link redirects to an attacker’s controlled website that serves malware. On the same basis as the domain mirroring exploitation, the attacker develops a spearphishing or phishing campaign with a carefully crafted pretext that would result in the download and potential execution of a hosted malicious file. The worst-case scenario could result in complete system compromise.",
  "url": "https://rules.sonarsource.com/php/rspec-5146/"
},
{
  "title": "Manual generation of session ID is security-sensitive",
  "description": "If a session ID can be guessed (not generated with a secure pseudo random generator, or with insufficient length …​) an attacker may be able to hijack another user’s session. Ask Yourself Whether the session ID is not unique. the session ID is set from a user-controlled input. the session ID is generated with not secure pseudo random generator. the session ID length is too short. There is a risk if you answered yes to any of those questions. Recommended Secure Coding Practices Don’t manually generate session IDs, use instead language based native functionality. Sensitive Code Example session_id(bin2hex(random_bytes(4))); // Sensitive: 4 bytes is too short session_id($_POST[\"session_id\"]); // Sensitive: session ID can be specified by the user Compliant Solution session_regenerate_id(); ; // Compliant session_id(bin2hex(random_bytes(16))); // Compliant See OWASP - Top 10 2021 Category A4 - Insecure Design OWASP - Top 10 2021 Category A7 - Identification and Authentication Failures OWASP - Top 10 2017 Category A6 - Security Misconfiguration OWASP Sesssion Fixation CWE - CWE-330 - Use of Insufficiently Random Values CWE - CWE-340 - Generation of Predictable Numbers or Identifiers PHP: random_bytes() PHP: session_regenerate_id() STIG Viewer - Application Security and Development: V-222579 - Applications must use system-generated session identifiers that protect against session fixation. STIG Viewer - Application Security and Development: V-222582 - The application must not re-use or recycle session IDs.",
  "url": "https://rules.sonarsource.com/php/rspec-5328/"
},
{
  "title": "Using clear-text protocols is security-sensitive",
  "description": "Clear-text protocols such as ftp, telnet, or http lack encryption of transported data, as well as the capability to build an authenticated connection. It means that an attacker able to sniff traffic from the network can read, modify, or corrupt the transported content. These protocols are not secure as they expose applications to an extensive range of risks: sensitive data exposure traffic redirected to a malicious endpoint malware-infected software update or installer execution of client-side code corruption of critical information Even in the context of isolated networks like offline environments or segmented cloud environments, the insider threat exists. Thus, attacks involving communications being sniffed or tampered with can still happen. For example, attackers could successfully compromise prior security layers by: bypassing isolation mechanisms compromising a component of the network getting the credentials of an internal IAM account (either from a service account or an actual person) In such cases, encrypting communications would decrease the chances of attackers to successfully leak data or steal credentials from other network components. By layering various security practices (segmentation and encryption, for example), the application will follow the defense-in-depth principle. Note that using the http protocol is being deprecated by major web browsers. In the past, it has led to the following vulnerabilities: CVE-2019-6169 CVE-2019-12327 CVE-2019-11065 Ask Yourself Whether Application data needs to be protected against falsifications or leaks when transiting over the network. Application data transits over an untrusted network. Compliance rules require the service to encrypt data in transit. Your application renders web pages with a relaxed mixed content policy. OS-level protections against clear-text traffic are deactivated. There is a risk if you answered yes to any of those questions. Recommended Secure Coding Practices Make application data transit over a secure, authenticated and encrypted protocol like TLS or SSH. Here are a few alternatives to the most common clear-text protocols: Use ssh as an alternative to telnet. Use sftp, scp, or ftps instead of ftp. Use https instead of http. Use SMTP over SSL/TLS or SMTP with STARTTLS instead of clear-text SMTP. Enable encryption of cloud components communications whenever it is possible. Configure your application to block mixed content when rendering web pages. If available, enforce OS-level deactivation of all clear-text traffic. It is recommended to secure all transport channels, even on local networks, as it can take a single non-secure connection to compromise an entire application or system. Sensitive Code Example $url = \"http://example.com\"; // Sensitive $url = \"ftp://anonymous@example.com\"; // Sensitive $url = \"telnet://anonymous@example.com\"; // Sensitive $con = ftp_connect('example.com'); // Sensitive $trans = (new Swift_SmtpTransport('XXX', 1234)); // Sensitive $mailer = new PHPMailer(true); // Sensitive define( 'FORCE_SSL_ADMIN', false); // Sensitive define( 'FORCE_SSL_LOGIN', false); // Sensitive Compliant Solution $url = \"https://example.com\"; $url = \"sftp://anonymous@example.com\"; $url = \"ssh://anonymous@example.com\"; $con = ftp_ssl_connect('example.com'); $trans = (new Swift_SmtpTransport('smtp.example.org', 1234)) -&gt;setEncryption('tls') ; $mailer = new PHPMailer(true); $mailer-&gt;SMTPSecure = 'tls'; define( 'FORCE_SSL_ADMIN', true); define( 'FORCE_SSL_LOGIN', true); Exceptions No issue is reported for the following cases because they are not considered sensitive: Insecure protocol scheme followed by loopback addresses like 127.0.0.1 or localhost. See Documentation AWS Documentation - Listeners for your Application Load Balancers AWS Documentation - Stream Encryption Articles &amp; blog posts Google - Moving towards more secure web Mozilla - Deprecating non secure http Standards OWASP - Top 10 2017 Category A3 - Sensitive Data Exposure OWASP - Top 10 2021 Category A2 - Cryptographic Failures CWE - CWE-200 - Exposure of Sensitive Information to an Unauthorized Actor CWE - CWE-319 - Cleartext Transmission of Sensitive Information STIG Viewer - Application Security and Development: V-222397 - The application must implement cryptographic mechanisms to protect the integrity of remote access sessions. STIG Viewer - Application Security and Development: V-222534 - Service-Oriented Applications handling non-releasable data must authenticate endpoint devices via mutual SSL/TLS. STIG Viewer - Application Security and Development: V-222562 - Applications used for non-local maintenance must implement cryptographic mechanisms to protect the integrity of maintenance and diagnostic communications. STIG Viewer - Application Security and Development: V-222563 - Applications used for non-local maintenance must implement cryptographic mechanisms to protect the confidentiality of maintenance and diagnostic communications. STIG Viewer - Application Security and Development: V-222577 - The application must not expose session IDs. STIG Viewer - Application Security and Development: V-222596 - The application must protect the confidentiality and integrity of transmitted information. STIG Viewer - Application Security and Development: V-222597 - The application must implement cryptographic mechanisms to prevent unauthorized disclosure of information and/or detect changes to information during transmission. STIG Viewer - Application Security and Development: V-222598 - The application must maintain the confidentiality and integrity of information during preparation for transmission. STIG Viewer - Application Security and Development: V-222599 - The application must maintain the confidentiality and integrity of information during reception.",
  "url": "https://rules.sonarsource.com/php/rspec-5332/"
},
{
  "title": "Dynamic code execution should not be vulnerable to injection attacks",
  "description": "Code injections occur when applications allow the dynamic execution of code instructions from untrusted data. An attacker can influence the behavior of the targeted application and modify it to get access to sensitive data. What is the potential impact? An attacker exploiting a dynamic code injection vulnerability will be able to execute arbitrary code in the context of the vulnerable application. The impact depends on the access control measures taken on the target system OS. In the worst-case scenario, the process that executes the code runs with root privileges, and therefore any OS commands or programs may be affected. Below are some real-world scenarios that illustrate some impacts of an attacker exploiting the vulnerability. Denial of service and data leaks In this scenario, the attack aims to disrupt the organization’s activities and profit from data leaks. An attacker could, for example: download the internal server’s data, most likely to sell it modify data, send malware stop services or exhaust resources (with fork bombs for example) This threat is particularly insidious if the attacked organization does not maintain a disaster recovery plan (DRP). Root privilege escalation and pivot In this scenario, the attacker can do everything described in the previous section. The difference is that the attacker also manages to elevate their privileges to an administrative level and attacks other servers. Here, the impact depends on how much the target company focuses on its Defense In Depth. For example, the entire infrastructure can be compromised by a combination of code injections and misconfiguration of: Docker or Kubernetes clusters cloud services network firewalls and routing OS access control",
  "url": "https://rules.sonarsource.com/php/rspec-5334/"
},
{
  "title": "Include expressions should not be vulnerable to injection attacks",
  "description": "Include injections occur in an application when the application retrieves data from a user or a third-party service and inserts it into an include expression without sanitizing it first. If an application contains an include expression that is vulnerable to injections, it is exposed to attacks that target the underlying server. What is the potential impact? A user with malicious intent can create requests that will cause the include expression to leak valuable data or achieve remote code execution on the server’s website. After creating the malicious request, the attacker can attack the servers affected by this vulnerability without relying on any prerequisites. The impact depends on the access control measures taken on the target system OS. In the worst-case scenario, the process runs with root privileges, and therefore any OS commands or programs may be affected. Below are some real-world scenarios that illustrate some impacts of an attacker exploiting the vulnerability. Denial of service and data leaks In this scenario, the attack aims to disrupt the organization’s activities and profit from data leaks. An attacker could, for example: download the internal server’s data, most likely to sell it modify data, send malware stop services or exhaust resources (with fork bombs for example) This threat is particularly insidious if the attacked organization does not maintain a disaster recovery plan (DRP). Root privilege escalation and pivot In this scenario, the attacker can do everything described in the previous section. The difference is that the attacker also manages to elevate their privileges to an administrative level and attacks other servers. Here, the impact depends on how much the target company focuses on its Defense In Depth. For example, the entire infrastructure can be compromised by a combination of OS injections and misconfiguration of: Docker or Kubernetes clusters cloud services network firewalls and routing OS access control",
  "url": "https://rules.sonarsource.com/php/rspec-5335/"
},
{
  "title": "`str_replace` should be preferred to `preg_replace`",
  "description": "An preg_replace call always performs an evaluation of the first argument as a regular expression, even if no regular expression features were used. This has a significant performance cost and therefore should be used with care. When preg_replace is used, the first argument should be a real regular expression. If it’s not the case, str_replace does exactly the same thing as preg_replace without the performance drawback of the regex. This rule raises an issue for each preg_replace used with a simple string as first argument which doesn’t contains special regex character or pattern. Noncompliant code example $str = \"Bob is a Bird... Bob is a Plane... Bob is Superman!\"; $changed = preg_replace(\"/Bob is/\", \"It's\", $str); // Noncompliant $changed = preg_replace(\"/\\.\\.\\./\", \";\", $changed); // Noncompliant Compliant solution $str = \"Bob is a Bird... Bob is a Plane... Bob is Superman!\"; $changed = str_replace(\"Bob is\", \"It's\", $str); $changed = str_replace(\"...\", \";\", $changed); Or, with a regex: $str = \"Bob is a Bird... Bob is a Plane... Bob is Superman!\"; $changed = preg_replace(\"/\\w*\\sis/\", \"It's\", $str); $changed = preg_replace(\"/\\.{3}/\", \";\", $changed);",
  "url": "https://rules.sonarsource.com/php/rspec-5361/"
},
{
  "title": "Server hostnames should be verified during SSL/TLS connections",
  "description": "This vulnerability allows attackers to impersonate a trusted host.",
  "url": "https://rules.sonarsource.com/php/rspec-5527/"
},
{
  "title": "Encryption algorithms should be used with secure mode and padding scheme",
  "description": "This vulnerability exposes encrypted data to a number of attacks whose goal is to recover the plaintext.",
  "url": "https://rules.sonarsource.com/php/rspec-5542/"
},
{
  "title": "Cipher algorithms should be robust",
  "description": "This vulnerability makes it possible that the cleartext of the encrypted message might be recoverable without prior knowledge of the key.",
  "url": "https://rules.sonarsource.com/php/rspec-5547/"
},
{
  "title": "Raised Exceptions must derive from Throwable",
  "description": "Instances of classes that do not derive from the \"Throwable\" interface cannot be used in a PHP \"throw\" statement. Many built-in exceptions such as \"Exception\" and the SPL exception classes do implement the \"Throwable\" interface and can be extended when creating custom exceptions. This rule raises an issue when an instance of a class that does not implement the \"Throwable\" interface is used in a \"throw\" statement . Noncompliant code example class NoThrowable {} throw new NoThrowable(); // Noncompliant Compliant solution &lt;?php class SomeThrowable implements Throwable { // Implementation of the Throwable methods } throw new SomeThrowable(); // Compliant class SomeCustomException extends Exception {} throw new SomeCustomException(); // Compliant{code}",
  "url": "https://rules.sonarsource.com/php/rspec-5632/"
},
{
  "title": "Allowing requests with excessive content length is security-sensitive",
  "description": "Rejecting requests with significant content length is a good practice to control the network traffic intensity and thus resource consumption in order to prevent DoS attacks. Ask Yourself Whether size limits are not defined for the different resources of the web application. the web application is not protected by rate limiting features. the web application infrastructure has limited resources. There is a risk if you answered yes to any of those questions. Recommended Secure Coding Practices For most of the features of an application, it is recommended to limit the size of requests to: lower or equal to 8mb for file uploads. lower or equal to 2mb for other requests. It is recommended to customize the rule with the limit values that correspond to the web application. Sensitive Code Example For Symfony Constraints: use Symfony\\Component\\Validator\\Constraints as Assert; use Symfony\\Component\\Validator\\Mapping\\ClassMetadata; class TestEntity { public static function loadValidatorMetadata(ClassMetadata $metadata) { $metadata-&gt;addPropertyConstraint('upload', new Assert\\File([ 'maxSize' =&gt; '100M', // Sensitive ])); } } For Laravel Validator: use App\\Http\\Controllers\\Controller; use Illuminate\\Http\\Request; class TestController extends Controller { public function test(Request $request) { $validatedData = $request-&gt;validate([ 'upload' =&gt; 'required|file', // Sensitive ]); } } Compliant Solution For Symfony Constraints: use Symfony\\Component\\Validator\\Constraints as Assert; use Symfony\\Component\\Validator\\Mapping\\ClassMetadata; class TestEntity { public static function loadValidatorMetadata(ClassMetadata $metadata) { $metadata-&gt;addPropertyConstraint('upload', new Assert\\File([ 'maxSize' =&gt; '8M', // Compliant ])); } } For Laravel Validator: use App\\Http\\Controllers\\Controller; use Illuminate\\Http\\Request; class TestController extends Controller { public function test(Request $request) { $validatedData = $request-&gt;validate([ 'upload' =&gt; 'required|file|max:8000', // Compliant ]); } } See OWASP - Top 10 2021 Category A5 - Security Misconfiguration Owasp Cheat Sheet - Owasp Denial of Service Cheat Sheet OWASP - Top 10 2017 Category A6 - Security Misconfiguration CWE - CWE-770 - Allocation of Resources Without Limits or Throttling CWE - CWE-400 - Uncontrolled Resource Consumption",
  "url": "https://rules.sonarsource.com/php/rspec-5693/"
},
{
  "title": "Caught Exceptions must derive from Throwable",
  "description": "Instances of classes that do not derive from the \"Throwable\" interface cannot be used in a PHP \"throw\" statement. Thus, it does not make sense to try to catch such objects within a \"try-catch\" block. Many built-in exceptions such as \"Exception\" and the SPL exception classes do implement the \"Throwable\" interface and can be extended when creating custom exceptions. This rule raises an issue when the classes used to specify the type of objects to be caught in a \"try-catch\" block do not derive from \"Throwable\" . Noncompliant code example class NoThrowable {} try { foo(); } catch (NoThrowable $e) { // Noncompliant } Compliant solution &lt;?php class SomeThrowable implements Throwable { // Implementation of the Throwable methods } try { foo(); } catch (SomeThrowable $e) { // Compliant } class SomeCustomException extends Exception {} try { foo(); } catch (SomeCustomException $e) { // Compliant }{code}",
  "url": "https://rules.sonarsource.com/php/rspec-5708/"
},
{
  "title": "A subclass should not be in the same \"catch\" clause as a parent class",
  "description": "Repeating an exception class in a single catch clause will not fail but it is not what the developer intended. Either the class is not the one which should be caught, or this is dead code. Having a subclass and a parent class in the same catch clause is also useless. It is enough to keep only the parent class. This rule raises an issue when an exception class is duplicated in a catch clause, or when an exception class has a parent class in the same catch clause. Noncompliant code example try { throw new CustomException(); } catch(CustomException | Exception $e) { // Noncompliant. CustomException inherits from Exception echo $e-&gt;message(); } try { throw new CustomException(); } catch(Exception | Exception $e) { // Noncompliant. echo $e-&gt;message(); } Compliant solution try { throw new CustomException(); } catch(Exception $e) { echo $e-&gt;message(); } try { throw new CustomException(); } catch(CustomException $e) { echo $e-&gt;getCustomMessage(); } catch(Exception $e) { echo $e-&gt;message(); }",
  "url": "https://rules.sonarsource.com/php/rspec-5713/"
},
{
  "title": "Assertion failure exceptions should not be ignored",
  "description": "PHPUnit assertions do throw a PHPUnit\\Framework\\ExpectationFailedException exception when they fail. This is how PHPUnit internally notices when assertions within testcases fail. However, if such an exception type or one of its parent types is captured within a try-catch block and not rethrown, PHPUnit does not notice the assertion failure. This check raises an issue on assertions within the try body of a try-catch block that do catch exceptions of the type PHPUnit\\Framework\\ExpectationFailedException, PHPUnit\\Framework\\AssertionFailedError, or Exception, and do not handle the variable holding the exception. Noncompliant code example public function testA() { try { assertTrue(getValue()); // Noncompliant } catch (\\PHPUnit\\Framework\\ExpectationFailedException $e) { } } Compliant solution public function testB() { try { assertTrue(getValue()); // Compliant } catch (\\PHPUnit\\Framework\\ExpectationFailedException $e) { assertEquals(\"Some message\", $e-&gt;getMessage()); } }",
  "url": "https://rules.sonarsource.com/php/rspec-5779/"
},
{
  "title": "Only one method invocation is expected when testing exceptions",
  "description": "When verifying that code raises an exception, a good practice is to avoid having multiple method calls inside the tested code, to be explicit about what is exactly tested. When two of the methods can raise the same exception, not respecting this good practice is a bug, since it is not possible to know what is really tested. Noncompliant code example public function testSomething() { try { g(y(1)); // Noncompliant $this-&gt;fail('RuntimeException is not thrown'); } catch (RuntimeException $e) {} } Compliant solution public function testSomething() { $y = y(1); try { g($y); $this-&gt;fail('RuntimeException is not thrown by g()'); } catch (RuntimeException $e) {} }",
  "url": "https://rules.sonarsource.com/php/rspec-5783/"
},
{
  "title": "PHPUnit assertTrue/assertFalse should be simplified to the corresponding dedicated assertion",
  "description": "Testing equality or nullness with PHPUnit’s assertTrue() or assertFalse() should be simplified to the corresponding dedicated assertion. Noncompliant code example assertTrue($a === $b); assertTrue($a == $b); assertTrue($a === null); assertTrue($a !== null); assertTrue($a !== $b); assertTrue($a != $b); assertFalse($a === $b); assertFalse($a == $b); assertTrue($a == true); assertTrue($a == false); Compliant solution assertEquals($a, $b); assertSame($a, $b); assertNull($a); assertNotNull($a); assertNotEquals($a, $b); assertNotSame($a, $b); assertNotEquals($a, $b); assertNotSame($a, $b); assertTrue($a); assertFalse($a);",
  "url": "https://rules.sonarsource.com/php/rspec-5785/"
},
{
  "title": "Constants should not be used as conditions",
  "description": "This rule raises an issue when a constant expression is used as a condition in an if, elif, a conditional expression or other boolean expressions.",
  "url": "https://rules.sonarsource.com/php/rspec-5797/"
},
{
  "title": "Authorizations should be based on strong decisions",
  "description": "When granting users access to resources of an application, such an authorization should be based on strong decisions. For instance, a user may be authorized to access a resource only if they are authenticated, or if they have the correct role and privileges.",
  "url": "https://rules.sonarsource.com/php/rspec-5808/"
},
{
  "title": "Repeated patterns in regular expressions should not match the empty string",
  "description": "A regex should never include a repetitive pattern whose body would match the empty string. This is usually a sign that a part of the regex is redundant or does not do what the author intended. Noncompliant code example \"/(?:)*/\" // same as the empty regex, the '*' accomplishes nothing \"/(?:|x)*/\" // same as the empty regex, the alternative has no effect \"/(?:x|)*/\" // same as 'x*', the empty alternative has no effect \"/(?:x*|y*)*/\" // same as 'x*', the first alternative would always match, y* is never tried \"/(?:x?)*/\" // same as 'x*' \"/(?:x?)+/\" // same as 'x*' Compliant solution \"/x*/\"",
  "url": "https://rules.sonarsource.com/php/rspec-5842/"
},
{
  "title": "Regular expressions should not be too complicated",
  "description": "Overly complicated regular expressions are hard to read and to maintain and can easily cause hard-to-find bugs. If a regex is too complicated, you should consider replacing it or parts of it with regular code or splitting it apart into multiple patterns at least. The complexity of a regular expression is determined as follows: Each of the following operators increases the complexity by an amount equal to the current nesting level and also increases the current nesting level by one for its arguments: | - when multiple | operators are used together, the subsequent ones only increase the complexity by 1 Quantifiers (*, +, ?, {n,m}, {n,} or {n}) Non-capturing groups that set flags (such as (?i:some_pattern) or (?i)some_pattern) Lookahead and lookbehind assertions Additionally, each use of the following features increase the complexity by 1 regardless of nesting: character classes back references Noncompliant code example if (preg_match(\"/^(?:(?:31(\\\\/|-|\\\\.)(?:0?[13578]|1[02]))\\\\1|(?:(?:29|30)(\\\\/|-|\\\\.)(?:0?[13-9]|1[0-2])\\\\2))(?:(?:1[6-9]|[2-9]\\\\d)?\\\\d{2})$|^(?:29(\\\\/|-|\\\\.)0?2\\\\3(?:(?:(?:1[6-9]|[2-9]\\\\d)?(?:0[48]|[2468][048]|[13579][26])|(?:(?:16|[2468][048]|[3579][26])00))))$|^(?:0?[1-9]|1\\\\d|2[0-8])(\\\\/|-|\\\\.)(?:(?:0?[1-9])|(?:1[0-2]))\\\\4(?:(?:1[6-9]|[2-9]\\\\d)?\\\\d{2})$/\", $dateString)) { handleDate($dateString); } Compliant solution if (preg_match(\"/^\\\\d{1,2}([-/.])\\\\d{1,2}\\\\1\\\\d{1,4}$/\"), $dateString) { $dateParts = preg_split(\"/[-/.]/\", $dateString); $day = intval($dateParts[0]); $month = intval($dateParts[1]); $year = intval($dateParts[2]); // Put logic to validate and process the date based on its integer parts here }",
  "url": "https://rules.sonarsource.com/php/rspec-5843/"
},
{
  "title": "Alternatives in regular expressions should be grouped when used with anchors",
  "description": "In regular expressions, anchors (^, $, \\A, \\Z and \\z) have higher precedence than the | operator. So in a regular expression like ^alt1|alt2|alt3$, alt1 would be anchored to the beginning, alt3 to the end and alt2 wouldn’t be anchored at all. Usually the intended behavior is that all alternatives are anchored at both ends. To achieve this, a non-capturing group should be used around the alternatives. In cases where it is intended that the anchors only apply to one alternative each, adding (non-capturing) groups around the anchors and the parts that they apply to will make it explicit which parts are anchored and avoid readers misunderstanding the precedence or changing it because they mistakenly assume the precedence was not intended. Noncompliant code example /^a|b|c$/ Compliant solution /^(?:a|b|c)$/ or /^a$|^b$|^c$/ or, if you do want the anchors to only apply to a and c respectively: /(?:^a)|b|(?:c$)/",
  "url": "https://rules.sonarsource.com/php/rspec-5850/"
},
{
  "title": "Regex alternatives should not be redundant",
  "description": "This rule raises an issue when multiple branches of a regex alternative match the same input.",
  "url": "https://rules.sonarsource.com/php/rspec-5855/"
},
{
  "title": "Regular expressions should be syntactically valid",
  "description": "Regular expressions have their own syntax that is understood by regular expression engines. Those engines will throw an exception at runtime if they are given a regular expression that does not conform to that syntax. To avoid syntax errors, special characters should be escaped with backslashes when they are intended to be matched literally and references to capturing groups should use the correctly spelled name or number of the group. To match a literal string, rather than a regular expression, either all special characters should be escaped or methods that don’t use regular expressions should be used. Noncompliant code example preg_match(\"/([/\", $input); preg_replace(\"/[/\", \"{\", $input); preg_replace(\"/(\\\\w+-(\\\\d+)/\", \"1234\", $input); Compliant solution preg_match(\"/\\\\(\\\\[/\", $input); str_replace(\"([\", \"{\", $input); preg_replace(\"/(\\\\w+)-(\\\\d+)/\", \"1234\", $input);",
  "url": "https://rules.sonarsource.com/php/rspec-5856/"
},
{
  "title": "Character classes should be preferred over reluctant quantifiers in regular expressions",
  "description": "Using reluctant quantifiers (also known as lazy or non-greedy quantifiers) in patterns can often lead to needless backtracking, making the regex needlessly inefficient and potentially vulnerable to catastrophic backtracking. Particularly when using .*? or .+? to match anything up to some terminating character, it is usually a better idea to instead use a greedily or possessively quantified negated character class containing the terminating character. For example &lt;.+?&gt; should be replaced with &lt;[^&gt;]++&gt;. Noncompliant code example /&lt;.+?&gt;/ /\".*?\"/ Compliant solution /&lt;[^&gt;]++&gt;/ /\"[^\"]*+\"/ or /&lt;[^&gt;]+&gt;/ /\"[^\"]*\"/ Exceptions This rule only applies in cases where the reluctant quantifier can easily be replaced with a negated character class. That means the repetition has to be terminated by a single character or character class. Patterns such as the following, where the alternatives without reluctant quantifiers are more complicated, are therefore not subject to this rule: /&lt;!--.*?--&gt;/ -/\\*.*?\\*/-",
  "url": "https://rules.sonarsource.com/php/rspec-5857/"
},
{
  "title": "Assertions should not compare an object to itself",
  "description": "Assertions comparing an object to itself are more likely to be bugs due to developer’s carelessness. This rule raises an issue when the actual expression matches the expected expression. Noncompliant code example assertEqual($a, $a); // Noncompliant assertSame($a, $a); // Noncompliant assertNotEqual($a, $a); // Noncompliant assertNotSame($a, $a); // Noncompliant Compliant solution assertEqual($expected, $a); assertSame($expected, $a); assertNotEqual($expected, $a); assertNotSame($expected, $a);",
  "url": "https://rules.sonarsource.com/php/rspec-5863/"
},
{
  "title": "Unicode-aware versions of character classes should be preferred",
  "description": "When using metacharacters like \\w without the Unicode flag or when using hard-coded character classes like [a-zA-Z], letters outside of the ASCII range, such as umlauts, accented letters, or letters from non-Latin languages, won’t be matched. This may cause code to incorrectly handle input containing such letters. To correctly handle non-ASCII input, it is recommended to use the Unicode flag \\u or Unicode character properties like \\p{L}. Noncompliant code example preg_match(\"/[a-zA-Z]/\", \"ö\"); // returns 0 preg_match(\"/\\w/\", \"ö\"); // returns 0 Compliant solution preg_match(\"/\\w/u\", \"ö\"); // returns 1 preg_match(\"/\\p{L}/\", \"ö\"); // return 1",
  "url": "https://rules.sonarsource.com/php/rspec-5867/"
},
{
  "title": "Unicode Grapheme Clusters should be avoided inside regex character classes",
  "description": "When placing Unicode Grapheme Clusters (characters which require to be encoded in multiple Code Points) inside a character class of a regular expression, this will likely lead to unintended behavior. For instance, the grapheme cluster c̈ requires two code points: one for 'c', followed by one for the umlaut modifier '\\u{0308}'. If placed within a character class, such as [c̈], the regex will consider the character class being the enumeration [c\\u{0308}] instead. It will, therefore, match every 'c' and every umlaut that isn’t expressed as a single codepoint, which is extremely unlikely to be the intended behavior. This rule raises an issue every time Unicode Grapheme Clusters are used within a character class of a regular expression. Noncompliant code example preg_replace(\"/[c̈d̈]/\", \"X\", \"cc̈d̈d\"); // Noncompliant, print \"XXXXXX\" instead of expected \"cXXd\". Compliant solution preg_replace(\"/c̈|d̈/\", \"X\", \"cc̈d̈d\"); // print \"cXXd\"",
  "url": "https://rules.sonarsource.com/php/rspec-5868/"
},
{
  "title": "Character classes in regular expressions should not contain the same character twice",
  "description": "Character classes in regular expressions are a convenient way to match one of several possible characters by listing the allowed characters or ranges of characters. If the same character is listed twice in the same character class or if the character class contains overlapping ranges, this has no effect. Thus duplicate characters in a character class are either a simple oversight or a sign that a range in the character class matches more than is intended or that the author misunderstood how character classes work and wanted to match more than one character. A common example of the latter mistake is trying to use a range like [0-99] to match numbers of up to two digits, when in fact it is equivalent to [0-9]. Another common cause is forgetting to escape the - character, creating an unintended range that overlaps with other characters in the character class. Noncompliant code example \"/[0-99]/\" // Noncompliant, this won't actually match strings with two digits \"/[0-9.-_]/\" // Noncompliant, .-_ is a range that already contains 0-9 (as well as various other characters such as capital letters) Compliant solution \"/[0-9]{1,2}/\" \"/[0-9.\\\\-_]/\"",
  "url": "https://rules.sonarsource.com/php/rspec-5869/"
},
{
  "title": "A new session should be created during user authentication",
  "description": "An attacker may trick a user into using a predetermined session identifier. Consequently, this attacker can gain unauthorized access and impersonate the user’s session. This kind of attack is called session fixation, and protections against it should not be disabled.",
  "url": "https://rules.sonarsource.com/php/rspec-5876/"
},
{
  "title": "OS commands should not be vulnerable to argument injection attacks",
  "description": "OS command argument injections occur when applications allow the execution of operating system commands from untrusted data but the untrusted data is limited to the arguments. It is not possible to directly inject arbitrary commands that compromise the underlying operating system, but the behavior of the executed command still might be influenced in a way that allows to expand access, for example, execution of arbitrary commands. The security of the application depends on the behavior of the application that is executed. What is the potential impact? An attacker exploiting an arguments injection vulnerability will be able to add arbitrary argument to a system binary call. Depending on the command the parameters are added to, this might lead to arbitrary command execution. The impact depends on the access control measures taken on the target system OS. In the worst-case scenario, the process runs with root privileges, and therefore any OS commands or programs may be affected. Below are some real-world scenarios that illustrate some impacts of an attacker exploiting the vulnerability. Denial of service and data leaks In this scenario, the attack aims to disrupt the organization’s activities and profit from data leaks. An attacker could, for example: download the internal server’s data, most likely to sell it modify data, send malware stop services or exhaust resources (with fork bombs for example) This threat is particularly insidious if the attacked organization does not maintain a disaster recovery plan (DRP). Root privilege escalation and pivot In this scenario, the attacker can do everything described in the previous section. The difference is that the attacker also manages to elevate their privileges to an administrative level and attacks other servers. Here, the impact depends on how much the target company focuses on its Defense In Depth. For example, the entire infrastructure can be compromised by a combination of OS injections and misconfiguration of: Docker or Kubernetes clusters cloud services network firewalls and routing OS access control",
  "url": "https://rules.sonarsource.com/php/rspec-5883/"
},
{
  "title": "Test methods should be discoverable",
  "description": "The PHPUnit test runner does execute public methods defined within test classes that have a name starting with \"test\" or the @test annotation. Methods that do not convey to this will not get executed. This rule raises an issue on methods marked as test methods (by name or annotation) but do not have a public visibility. An issue is also raised on public methods that are not marked as tests, do contain assertions, and are not called from within another discoverable test method within the class. No issues are raised in abstract classes, or on public static method which provides data. Noncompliant code example class MyTest extends \\PHPUnit\\Framework\\TestCase { private function testA() { // Noncompliant $this-&gt;assertTrue(getValue()); } public function b() { // Noncompliant $this-&gt;assertTrue(getValue()); } } Compliant solution class MyTest extends \\PHPUnit\\Framework\\TestCase { public function testA() { // Compliant $this-&gt;assertTrue(getValue()); } public function testB() { $this-&gt;b(); } public function b() { // Compliant $this-&gt;assertTrue(getValue()); } }",
  "url": "https://rules.sonarsource.com/php/rspec-5899/"
},
{
  "title": "Class of caught exception should be defined",
  "description": "Exception handling provides a way to help developers handle and recover from runtime errors and unexpected events during program execution. When an error occurs, an exception is thrown and can be caught by an appropriate try-catch block, allowing the program to handle the exception and prevent the program from crashing. A problem arises, when an exception or error class — an instance of Throwable — in a catch clause does not exist, as PHP won’t generate an error. This typically occurs when being in a namespace trying to catch PHP built-in exception classes without escaping to the global namespace or importing the classes. In summary, this rule raises an issue when, being in a namespace, an undefined class belonging to that namespace is caught. What is the potential impact? Initially, since the exception is not being caught, it will cause a runtime error in production. Additionally, this can lead to complex debugging problems as the root cause of the issue may not be obvious.",
  "url": "https://rules.sonarsource.com/php/rspec-5911/"
},
{
  "title": "Assertions should not be made at the end of blocks expecting an exception",
  "description": "In PHPUnit, to test that an exception is thrown in a given piece of code, the expectException*() methods or the @expectedException* annotations can be used. For such a test to succeed, something in the test method has to throw an exception with the awaited properties. Having an assertion at the end of such a test method, means that, if the test succeeds, that assertion was never evaluated because an exception was thrown before getting to that point. Noncompliant code example public function testA() { $o = new MyClass(); $this-&gt;expectException(\\Exception::class); $o-&gt;doSomething(); $this-&gt;assertTrue($o-&gt;hasProperty()); // Noncompliant - This assertion might never get evaluated } Compliant solution public function testA() { $o = new MyClass(); $this-&gt;expectException(\\Exception::class); $o-&gt;doSomething(); } public function testB() { $o = new MyClass(); $this-&gt;assertTrue($o-&gt;hasProperty()); }",
  "url": "https://rules.sonarsource.com/php/rspec-5915/"
},
{
  "title": "Framework-provided functions should be used to test exceptions",
  "description": "PHPUnit provides helper functions and annotations to verify that a given block of code throws an exception and to assert different properties of that exception. The provided helper functions are: expectException() expectExceptionCode() expectExceptionMessage() expectExceptionMessageRegExp() This check raises an issue when the throw of an exception is verified using a try-catch approach instead of relying on the provided helper functions. Noncompliant code example public function testA() { try { doSomething(); $this-&gt;fail(\"Assertion should have been thrown\"); } catch (MyException $e) { assertEquals(\"Exception message\", $e-&gt;getMessage()); } } Compliant solution public function testB() { $this-&gt;expectException(MyException::class); $this-&gt;expectExceptionMessage(\"Exception message\"); doSomething(); }",
  "url": "https://rules.sonarsource.com/php/rspec-5935/"
},
{
  "title": "Allowing all external requests from a WordPress server is security-sensitive",
  "description": "External requests initiated by a WordPress server should be considered as security-sensitive. They may contain sensitive data which is stored in the files or in the database of the server. It’s important for the administrator of a WordPress server to understand what they contain and to which server they are sent. WordPress makes it possible to block external requests by setting the WP_HTTP_BLOCK_EXTERNAL option to true. It’s then possible to authorize requests to only a few servers using another option named WP_ACCESSIBLE_HOSTS. Ask Yourself Whether Your WordPress website contains code which may call external requests to servers you don’t know. Your WordPress website may send sensitive data to other servers. Your WordPress website uses a lot of plugins or themes. There is a risk if you answered yes to any of those questions. Recommended Secure Coding Practices Uninstall WordPress plugins which send requests to servers you don’t know. Make sure that WP_HTTP_BLOCK_EXTERNAL is defined in wp-config.php. Make sure that WP_HTTP_BLOCK_EXTERNAL is set to true. Make sure that WP_ACCESSIBLE_HOSTS is configured to authorize requests to the servers you trust. Sensitive Code Example define( 'WP_HTTP_BLOCK_EXTERNAL', false ); // Sensitive Compliant Solution define( 'WP_HTTP_BLOCK_EXTERNAL', true ); define( 'WP_ACCESSIBLE_HOSTS', 'api.wordpress.org' ); See OWASP - Top 10 2021 Category A5 - Security Misconfiguration OWASP - Top 10 2021 Category A10 - Server-Side Request Forgery (SSRF) wordpress.org - Block External URL Requests OWASP - Top 10 2017 Category A6 - Security Misconfiguration OWASP Attack Category - Server Side Request Forgery CWE - CWE-918 - Server-Side Request Forgery (SSRF)",
  "url": "https://rules.sonarsource.com/php/rspec-6345/"
},
{
  "title": "Allowing unauthenticated database repair in WordPress is security-sensitive",
  "description": "WordPress has a database repair and optimization mode that can be activated by setting WP_ALLOW_REPAIR to true in the configuration. If activated, the repair page can be accessed by any user, authenticated or not. This makes sense because if the database is corrupted, the authentication mechanism might not work. Malicious users could trigger this potentially costly operation repeatadly slowing down the website, and making it unavailable. Ask Yourself Whether The database is not currently corrupted. There is a risk if you answered yes to this question. Recommended Secure Coding Practices It’s recommended to enable automatic database repair mode only in case of database corruption. This feature should be deactivated again when the database issue is resolved. Sensitive Code Example define( 'WP_ALLOW_REPAIR', true ); // Sensitive Compliant Solution // The default value is false, so the value does not have to be expilicitly set. define( 'WP_ALLOW_REPAIR', false ); See OWASP - Top 10 2021 Category A5 - Security Misconfiguration OWASP - Top 10 2021 Category A7 - Identification and Authentication Failures wordpress.org - Automatic Database Optimizing OWASP - Top 10 2017 Category A6 - Security Misconfiguration",
  "url": "https://rules.sonarsource.com/php/rspec-6346/"
},
{
  "title": "WordPress options should not be defined at the end of \"wp-config.php\"",
  "description": "WordPress makes it possible to define options using define statements inside a configuration file named wp-config.php. However, if the statements are located after the settings are loaded at the end of this file, they are not taken into account by WordPress. This rule raises an issue when a define statement appears after wp-settings.php is loaded. What is the potential impact? This issue could entail more serious problems. A configuration that is security related could be ignored and not considered without any warning.",
  "url": "https://rules.sonarsource.com/php/rspec-6347/"
},
{
  "title": "Allowing unfiltered HTML content in WordPress is security-sensitive",
  "description": "By default, the WordPress administrator and editor roles can add unfiltered HTML content in various places, such as post content. This includes the capability to add JavaScript code. If an account with such a role gets hijacked, this capability can be used to plant malicious JavaScript code that gets executed whenever somebody visits the website. Ask Yourself Whether You really need the possibility to add unfiltered HTML with editor or administrator roles. There’s a chance that the accounts of authorized users get compromised. There is a risk if you answered yes to any of those questions. Recommended Secure Coding Practices The unfiltered_html capability should be granted to trusted roles that need to use markup when publishing dynamic content to the WordPress website. If this capability is not required for all users, including administrators and editors roles, then it’s recommended to set DISALLOW_UNFILTERED_HTML to true. Sensitive Code Example define( 'DISALLOW_UNFILTERED_HTML', false ); // sensitive Compliant Solution define( 'DISALLOW_UNFILTERED_HTML', true ); See OWASP - Top 10 2021 Category A3 - Injection OWASP - Top 10 2021 Category A5 - Security Misconfiguration OWASP - Top 10 2017 Category A6 - Security Misconfiguration OWASP - Top 10 2017 Category A7 - Cross-Site Scripting (XSS) CWE - CWE-79 - Improper Neutralization of Input During Web Page Generation ('Cross-site Scripting')",
  "url": "https://rules.sonarsource.com/php/rspec-6348/"
},
{
  "title": "WordPress option names should not be misspelled",
  "description": "WordPress relies a lot on the configuration located in a file named wp-config.php. This file contains mostly define statements and each of them creates a constant for a given WordPress option. However, no warning appears if an option is misspelled: the statement simply defines a constant which is never used. This rule raises an issue when a file named wp-config.php defines a constant whose name is slightly different from a known WordPress option.",
  "url": "https://rules.sonarsource.com/php/rspec-6349/"
},
{
  "title": "Constructing arguments of system commands from user input is security-sensitive",
  "description": "Constructing arguments of system commands from user input is security-sensitive. It has led in the past to the following vulnerabilities: CVE-2016-9920 CVE-2021-29472 Arguments of system commands are processed by the executed program. The arguments are usually used to configure and influence the behavior of the programs. Control over a single argument might be enough for an attacker to trigger dangerous features like executing arbitrary commands or writing files into specific directories. Ask Yourself Whether Malicious arguments can result in undesired behavior in the executed command. Passing user input to a system command is not necessary. There is a risk if you answered yes to any of those questions. Recommended Secure Coding Practices Avoid constructing system commands from user input when possible. Ensure that no risky arguments can be injected for the given program, e.g., type-cast the argument to an integer. Use a more secure interface to communicate with other programs, e.g., the standard input stream (stdin). Sensitive Code Example Arguments like -delete or -exec for the find command can alter the expected behavior and result in vulnerabilities: $input = $_GET['input']; system('/usr/bin/find ' . escapeshellarg($input)); // Sensitive Compliant Solution Use an allow-list to restrict the arguments to trusted values: $input = $_GET['input']; if (in_array($input, $allowed, true)) { system('/usr/bin/find ' . escapeshellarg($input)); } See OWASP - Top 10 2021 Category A3 - Injection OWASP - Top 10 2017 Category A1 - Injection CWE - CWE-88 - Argument Injection or Modification CVE-2021-29472 - PHP Supply Chain Attack on Composer STIG Viewer - Application Security and Development: V-222609 - The application must not be subject to input handling vulnerabilities.",
  "url": "https://rules.sonarsource.com/php/rspec-6350/"
},
{
  "title": "Regular expression quantifiers and character classes should be used concisely",
  "description": "A regular expression is a sequence of characters that specifies a match pattern in text. Among the most important concepts are: Character classes: defines a set of characters, any one of which can occur in an input string for a match to succeed. Quantifiers: used to specify how many instances of a character, group, or character class must be present in the input for a match. Wildcard (.): matches all characters except line terminators (also matches them if the s flag is set). Many of these features include shortcuts of widely used expressions, so there is more than one way to construct a regular expression to achieve the same results. For example, to match a two-digit number, one could write [0-9]{2,2} or \\d{2}. The latter is not only shorter but easier to read and thus to maintain. This rule recommends replacing some quantifiers and character classes with more concise equivalents: \\d for [0-9] and \\D for [^0-9] \\w for [A-Za-z0-9_] and \\W for [^A-Za-z0-9_] . for character classes matching everything (e.g. [\\w\\W], [\\d\\D], or [\\s\\S] with s flag) x? for x{0,1}, x* for x{0,}, x+ for x{1,}, x{N} for x{N,N} \"/[0-9]/\" // Noncompliant - same as \"/\\d/\" \"/[^0-9]/\" // Noncompliant - same as \"/\\D/\" \"/[A-Za-z0-9_]/\" // Noncompliant - same as \"/\\w/\" \"/[\\w\\W]/\" // Noncompliant - same as \"/./\" \"/a{0,}/\" // Noncompliant - same as \"/a*/\" Use the more concise version to make the regex expression more readable. \"/\\d/\" \"/\\D/\" \"/\\w/\" \"/./\" \"/a*/\"",
  "url": "https://rules.sonarsource.com/php/rspec-6353/"
},
{
  "title": "Regular expressions should have valid delimiters",
  "description": "Regular expressions are patterns used to match and manipulate strings based on specific rules. The pattern provided to PHP regular expression functions is required to be enclosed in valid delimiters to be working correctly. What is the potential impact? Failing to enclose the pattern with valid delimiters will result in a PHP warning and the pattern never matching. Since the warning only appears during runtime when the pattern is evaluated, such a mistake risks to get unnoticed into production. The use of suppressed warnings in PHP can further complicate this issue. As regex pattern are often used for validation or sanitization, the suppress warnings feature can obscure any problems regarding incorrect patterns. As the incorrect patterns are not recognized and have no effect, this could lead to more serious security issues.",
  "url": "https://rules.sonarsource.com/php/rspec-6393/"
},
{
  "title": "Non-capturing groups without quantifier should not be used",
  "description": "Sub-patterns can be wrapped by parentheses to build a group. This enables to restrict alternations, back reference the group or apply quantifier to the sub-pattern. If this group should not be part of the match result or if no reference to this group is required, a non-capturing group can be created by adding ?: behind the opening parenthesis. However, if this non-capturing group does not have a quantifier, or does not wrap an alternation, then imaging this group is redundant. Noncompliant code example \"(?:number)\\d{2}\" Compliant solution \"number\\d{2}\" \"(?:number)?\\d{2}\" Exceptions This rule does not report an issue if the non-capturing group is an alternation. \"(?:number|string)\"",
  "url": "https://rules.sonarsource.com/php/rspec-6395/"
},
{
  "title": "Superfluous curly brace quantifiers should be avoided",
  "description": "Curly brace quantifiers in regular expressions can be used to have a more fine-grained control over how many times the character or the sub-expression preceeding them should occur. They can be used to match an expression exactly n times with {n}, between n and m times with {n,m}, or at least n times with {n,}. In some cases, using such a quantifier is superfluous for the semantic of the regular expression, and it can be removed to improve readability. This rule raises an issue when one of the following quantifiers is encountered: {1,1} or {1}: they match the expression exactly once. The same behavior can be achieved without the quantifier. {0,0} or {0}: they match the expression zero times. The same behavior can be achieved by removing the expression. Noncompliant code example \"/ab{1,1}c/\" \"/ab{1}c/\" \"/ab{0,0}c/\" \"/ab{0}c/\" Compliant solution \"/abc/\" \"/ac/\"",
  "url": "https://rules.sonarsource.com/php/rspec-6396/"
},
{
  "title": "Character classes in regular expressions should not contain only one character",
  "description": "Character classes in regular expressions are a convenient way to match one of several possible characters by listing the allowed characters or ranges of characters. If a character class contains only one character, the effect is the same as just writing the character without a character class. Thus, having only one character in a character class is usually a simple oversight that remained after removing other characters of the class. Noncompliant code example /a[b]c/ Compliant solution /abc/ Exceptions This rule does not raise when the character inside the class is a metacharacter. This notation is sometimes used to avoid escaping (e.g., [.]{3} to match three dots).",
  "url": "https://rules.sonarsource.com/php/rspec-6397/"
},
{
  "title": "Hard-coded secrets are security-sensitive",
  "description": "Because it is easy to extract strings from an application source code or binary, secrets should not be hard-coded. This is particularly true for applications that are distributed or that are open-source. In the past, it has led to the following vulnerabilities: CVE-2022-25510 CVE-2021-42635 Secrets should be stored outside of the source code in a configuration file or a management service for secrets. This rule detects variables/fields having a name matching a list of words (secret, token, credential, auth, api[_.-]?key) being assigned a pseudorandom hard-coded value. The pseudorandomness of the hard-coded value is based on its entropy and the probability to be human-readable. The randomness sensibility can be adjusted if needed. Lower values will detect less random values, raising potentially more false positives. Ask Yourself Whether The secret allows access to a sensitive component like a database, a file storage, an API, or a service. The secret is used in a production environment. Application re-distribution is required before updating the secret. There would be a risk if you answered yes to any of those questions. Recommended Secure Coding Practices Store the secret in a configuration file that is not pushed to the code repository. Use your cloud provider’s service for managing secrets. If a secret has been disclosed through the source code: revoke it and create a new one. Sensitive Code Example $secret = '47828a8dd77ee1eb9dde2d5e93cb221ce8c32b37'; MyClass-&gt;callMyService($secret); Compliant Solution Using AWS Secrets Manager: use Aws\\SecretsManager\\SecretsManagerClient; use Aws\\Exception\\AwsException; $client = new SecretsManagerClient(...); $secretName = 'example'; doSomething($client, $secretName) function doSomething($client, $secretName) { try { $result = $client-&gt;getSecretValue([ 'SecretId' =&gt; $secretName, ]); } catch (AwsException $e) { ... } if (isset($result['SecretString'])) { $secret = $result['SecretString']; } else { $secret = base64_decode($result['SecretBinary']); } // do something with the secret MyClass-&gt;callMyService($secret); } See OWASP - Top 10 2021 Category A7 - Identification and Authentication Failures OWASP - Top 10 2017 Category A2 - Broken Authentication CWE - CWE-798 - Use of Hard-coded Credentials",
  "url": "https://rules.sonarsource.com/php/rspec-6418/"
},
{
  "title": "Credentials should not be hard-coded",
  "description": "Secret leaks often occur when a sensitive piece of authentication data is stored with the source code of an application. Considering the source code is intended to be deployed across multiple assets, including source code repositories or application hosting servers, the secrets might get exposed to an unintended audience.",
  "url": "https://rules.sonarsource.com/php/rspec-6437/"
},
{
  "title": "Unnecessary parentheses should not be used for constructs",
  "description": "In PHP, incorrect use of parentheses can cause unexpected behavior in code. Therefore, it is important to avoid the unnecessary usage of parentheses for language constructs.",
  "url": "https://rules.sonarsource.com/php/rspec-6600/"
},
{
  "title": "Server-side requests should not be vulnerable to traversing attacks",
  "description": "Path Traversal Server-Side Request Forgery is a sub-class of Server-Side Request Forgery (SSRF). In this type of attack, the attacker manipulates the path of the URL in the server-side request, rather than controlling the entire URL. This can lead to unauthorized access to endpoints or data by altering the request path. Path Traversal SSRF attacks are dangerous because they can exploit the server-side application’s ability to send requests to internal resources that are typically inaccessible to external attackers. By manipulating the path, attackers can potentially gain access to sensitive information or functionalities that should be protected. What is the potential impact? The impact of SSRF vulnerabilities can vary greatly depending on the context in which the user input is used. API Traversal In a path traversal SSRF attack, the attacker can manipulate the path of the server-side request to traverse through different endpoints of an API. This can lead to several potential impacts: Unauthorized access to API endpoints By manipulating the path of the server-side request, an attacker can potentially access API endpoints that are not intended to be publicly accessible. This could include endpoints that provide access to sensitive data or functionality. Unauthorized access to these endpoints could lead to data breaches or unauthorized actions being performed on the server. Manipulation of API responses If an attacker can manipulate the path of a server-side request to traverse to different API endpoints, they could potentially influence the responses that the server sends back. This could lead to incorrect or misleading data being returned, which could have a variety of impacts depending on the nature of the application and the data involved.",
  "url": "https://rules.sonarsource.com/php/rspec-7044/"
},
{
  "title": "Variables should be initialized before use",
  "description": "In PHP it is not required to initialize variables before their usage. However, using uninitialized variables is considered bad practice and should be avoided because of the following reasons: The value and type of uninitialized variables depend on the context of their first usage. It is better to be explicit about those to avoid confusion. The interpreter raises a warning or a notice in many cases. Noncompliant code example &lt;?php function getText(array $lines): string { foreach ($lines as $line) { $text .= $line; } return $text; } Compliant solution &lt;?php function getText(array $lines): string { $text = \"\"; foreach ($lines as $line) { $text .= $line; } return $text; }",
  "url": "https://rules.sonarsource.com/php/rspec-836/"
},
{
  "title": "Increment (++) and decrement (--) operators should not be used in a method call or mixed with other operators in an expression",
  "description": "The use of increment and decrement operators in method calls or in combination with other arithmetic operators is not recommended, because: It can significantly impair the readability of the code. It introduces additional side effects into a statement, with the potential for undefined behavior. It is safer to use these operators in isolation from any other arithmetic operators. Noncompliant code example $u8a = ++$u8b + $u8c--; $foo = $bar++ / 4; Compliant solution The following sequence is clearer and therefore safer: ++$u8b; $u8a = $u8b + $u8c; $u8c--; $foo = $bar / 4; $bar++;",
  "url": "https://rules.sonarsource.com/php/rspec-881/"
},
{
  "title": "Non-empty statements should change control flow or have at least one side-effect",
  "description": "Statements with no side effects and no change of control flow do not contribute to the functionality of the code and can indicate a programming error.",
  "url": "https://rules.sonarsource.com/php/rspec-905/"
},
{
  "title": "\"goto\" statement should not be used",
  "description": "goto is an unstructured control flow statement. It makes code less readable and maintainable. Structured control flow statements such as if, for, while, continue or break should be used instead. Noncompliant code example $i = 0; loop: echo(\"i = $i\"); $i++; if ($i &lt; 10){ goto loop; } Compliant solution for ($i = 0; $i &lt; 10; $i++){ echo(\"i = $i\"); }",
  "url": "https://rules.sonarsource.com/php/rspec-907/"
},
{
  "title": "The number of arguments passed to a function should match the number of parameters",
  "description": "Calling a function or a method with fewer or more arguments than expected will raise a TypeError. This is usually a bug and should be fixed. Provide missing arguments to the call, or define default values if there are fewer arguments. Reduce the number of arguments provided by the function call, or add more parameter if there are more arguments than expected. Noncompliant code example function myFunction($a, $b, $c = null) { //... } myFunction($a); // Noncompliant - 2 arguments are required Exceptions No issue is reported when arguments are used in the body of the function being called. function myFunction() { $arg_list = func_get_args(); //... } myFunction($a, $b);",
  "url": "https://rules.sonarsource.com/php/rspec-930/"
}
]